<div class="uk-flex-item-1" style="padding-left:15px; ">
							<div id="x-content-top">
								<!-- __snippet__.contentTop -->
																<!-- // __snippet__.contentTop -->
							</div>
							<div id="x-content">
								    <h4>&#22522;&#26412;&#27010;&#24565;</h4>
    <div class="x-wiki-info">
    	<span>Reads: 54135</span>
    	<a href="/manage/wiki/wikipage_update?id=1298613246361634" target="_blank" class="x-can-edit uk-text-danger">Edit</a>
</div>

    <hr>

    <div class="x-wiki-content x-main-content">
<p>&#22312;&#35745;&#31639;&#26426;&#20013;&#65292;&#25105;&#20204;&#32463;&#24120;&#38656;&#35201;&#22788;&#29702;&#26085;&#26399;&#21644;&#26102;&#38388;&#12290;</p>
<p>&#36825;&#26159;&#26085;&#26399;&#65306;</p>
<ul>
<li>2019-11-20</li>
<li>2020-1-1</li>
</ul>
<p>&#36825;&#26159;&#26102;&#38388;&#65306;</p>
<ul>
<li>12:30:59</li>
<li>2020-1-1 20:21:59</li>
</ul>
<p>&#26085;&#26399;&#26159;&#25351;&#26576;&#19968;&#22825;&#65292;&#23427;&#19981;&#26159;&#36830;&#32493;&#21464;&#21270;&#30340;&#65292;&#32780;&#26159;&#24212;&#35813;&#34987;&#30475;&#25104;&#31163;&#25955;&#30340;&#12290;</p>
<p>&#32780;&#26102;&#38388;&#26377;&#20004;&#31181;&#27010;&#24565;&#65292;&#19968;&#31181;&#26159;&#19981;&#24102;&#26085;&#26399;&#30340;&#26102;&#38388;&#65292;&#20363;&#22914;&#65292;12:30:59&#12290;&#21478;&#19968;&#31181;&#26159;&#24102;&#26085;&#26399;&#30340;&#26102;&#38388;&#65292;&#20363;&#22914;&#65292;2020-1-1 20:21:59&#65292;&#21482;&#26377;&#36825;&#31181;&#24102;&#26085;&#26399;&#30340;&#26102;&#38388;&#33021;&#21807;&#19968;&#30830;&#23450;&#26576;&#20010;&#26102;&#21051;&#65292;&#19981;&#24102;&#26085;&#26399;&#30340;&#26102;&#38388;&#26159;&#26080;&#27861;&#30830;&#23450;&#19968;&#20010;&#21807;&#19968;&#26102;&#21051;&#30340;&#12290;</p>
<h3>&#26412;&#22320;&#26102;&#38388;</h3>
<p>&#24403;&#25105;&#20204;&#35828;&#24403;&#21069;&#26102;&#21051;&#26159;2019&#24180;11&#26376;20&#26085;&#26089;&#19978;8:15&#30340;&#26102;&#20505;&#65292;&#25105;&#20204;&#35828;&#30340;&#23454;&#38469;&#19978;&#26159;&#26412;&#22320;&#26102;&#38388;&#12290;&#22312;&#22269;&#20869;&#23601;&#26159;&#21271;&#20140;&#26102;&#38388;&#12290;&#22312;&#36825;&#20010;&#26102;&#21051;&#65292;&#22914;&#26524;&#22320;&#29699;&#19978;&#19981;&#21516;&#22320;&#26041;&#30340;&#20154;&#20204;&#21516;&#26102;&#30475;&#19968;&#30524;&#25163;&#34920;&#65292;&#20182;&#20204;&#21508;&#33258;&#30340;&#26412;&#22320;&#26102;&#38388;&#26159;&#19981;&#21516;&#30340;&#65306;</p>
<p><img src="/static/img/loading.svg" data-src="/files/attachments/1298615433691201/l" alt="localtime"></p>
<p>&#25152;&#20197;&#65292;&#19981;&#21516;&#30340;&#26102;&#21306;&#65292;&#22312;&#21516;&#19968;&#26102;&#21051;&#65292;&#26412;&#22320;&#26102;&#38388;&#26159;&#19981;&#21516;&#30340;&#12290;&#20840;&#29699;&#19968;&#20849;&#20998;&#20026;24&#20010;&#26102;&#21306;&#65292;&#20262;&#25958;&#25152;&#22312;&#30340;&#26102;&#21306;&#31216;&#20026;&#26631;&#20934;&#26102;&#21306;&#65292;&#20854;&#20182;&#26102;&#21306;&#25353;&#19996;&#65295;&#35199;&#20559;&#31227;&#30340;&#23567;&#26102;&#21306;&#20998;&#65292;&#21271;&#20140;&#25152;&#22312;&#30340;&#26102;&#21306;&#26159;&#19996;&#20843;&#21306;&#12290;</p>
<h3>&#26102;&#21306;</h3>
<p>&#22240;&#20026;&#20809;&#38752;&#26412;&#22320;&#26102;&#38388;&#36824;&#26080;&#27861;&#21807;&#19968;&#30830;&#23450;&#19968;&#20010;&#20934;&#30830;&#30340;&#26102;&#21051;&#65292;&#25152;&#20197;&#25105;&#20204;&#36824;&#38656;&#35201;&#32473;&#26412;&#22320;&#26102;&#38388;&#21152;&#19978;&#19968;&#20010;&#26102;&#21306;&#12290;&#26102;&#21306;&#26377;&#22909;&#20960;&#31181;&#34920;&#31034;&#26041;&#24335;&#12290;</p>
<p>&#19968;&#31181;&#26159;&#20197;<code>GMT</code>&#25110;&#32773;<code>UTC</code>&#21152;&#26102;&#21306;&#20559;&#31227;&#34920;&#31034;&#65292;&#20363;&#22914;&#65306;<code>GMT+08:00</code>&#25110;&#32773;<code>UTC+08:00</code>&#34920;&#31034;&#19996;&#20843;&#21306;&#12290;</p>
<p><code>GMT</code>&#21644;<code>UTC</code>&#21487;&#20197;&#35748;&#20026;&#22522;&#26412;&#26159;&#31561;&#20215;&#30340;&#65292;&#21482;&#26159;<code>UTC</code>&#20351;&#29992;&#26356;&#31934;&#30830;&#30340;&#21407;&#23376;&#38047;&#35745;&#26102;&#65292;&#27599;&#38548;&#20960;&#24180;&#20250;&#26377;&#19968;&#20010;&#38384;&#31186;&#65292;&#25105;&#20204;&#22312;&#24320;&#21457;&#31243;&#24207;&#30340;&#26102;&#20505;&#21487;&#20197;&#24573;&#30053;&#20004;&#32773;&#30340;&#35823;&#24046;&#65292;&#22240;&#20026;&#35745;&#31639;&#26426;&#30340;&#26102;&#38047;&#22312;&#32852;&#32593;&#30340;&#26102;&#20505;&#20250;&#33258;&#21160;&#19982;&#26102;&#38388;&#26381;&#21153;&#22120;&#21516;&#27493;&#26102;&#38388;&#12290;</p>
<p>&#21478;&#19968;&#31181;&#26159;&#32553;&#20889;&#65292;&#20363;&#22914;&#65292;<code>CST</code>&#34920;&#31034;<code>China Standard Time</code>&#65292;&#20063;&#23601;&#26159;&#20013;&#22269;&#26631;&#20934;&#26102;&#38388;&#12290;&#20294;&#26159;<code>CST</code>&#20063;&#21487;&#20197;&#34920;&#31034;&#32654;&#22269;&#20013;&#37096;&#26102;&#38388;<code>Central Standard Time USA</code>&#65292;&#22240;&#27492;&#65292;&#32553;&#20889;&#23481;&#26131;&#20135;&#29983;&#28151;&#28102;&#65292;&#25105;&#20204;&#23613;&#37327;&#19981;&#35201;&#20351;&#29992;&#32553;&#20889;&#12290;</p>
<p>&#26368;&#21518;&#19968;&#31181;&#26159;&#20197;&#27954;&#65295;&#22478;&#24066;&#34920;&#31034;&#65292;&#20363;&#22914;&#65292;<code>Asia/Shanghai</code>&#65292;&#34920;&#31034;&#19978;&#28023;&#25152;&#22312;&#22320;&#30340;&#26102;&#21306;&#12290;&#29305;&#21035;&#27880;&#24847;&#22478;&#24066;&#21517;&#31216;&#19981;&#26159;&#20219;&#24847;&#30340;&#22478;&#24066;&#65292;&#32780;&#26159;&#30001;&#22269;&#38469;&#26631;&#20934;&#32452;&#32455;&#35268;&#23450;&#30340;&#22478;&#24066;&#12290;</p>
<p>&#22240;&#20026;&#26102;&#21306;&#30340;&#23384;&#22312;&#65292;&#19996;&#20843;&#21306;&#30340;2019&#24180;11&#26376;20&#26085;&#26089;&#19978;8:15&#65292;&#21644;&#35199;&#20116;&#21306;&#30340;2019&#24180;11&#26376;19&#26085;&#26202;&#19978;19:15&#65292;&#20182;&#20204;&#30340;&#26102;&#21051;&#26159;&#30456;&#21516;&#30340;&#65306;</p>
<p><img src="/static/img/loading.svg" data-src="/files/attachments/1298616075419714/l" alt="timezone"></p>
<p>&#26102;&#21051;&#30456;&#21516;&#30340;&#24847;&#24605;&#23601;&#26159;&#65292;&#20998;&#21035;&#22312;&#20004;&#20010;&#26102;&#21306;&#30340;&#20004;&#20010;&#20154;&#65292;&#22914;&#26524;&#22312;&#36825;&#19968;&#21051;&#36890;&#30005;&#35805;&#65292;&#20182;&#20204;&#21508;&#33258;&#25253;&#20986;&#33258;&#24049;&#25163;&#34920;&#19978;&#30340;&#26102;&#38388;&#65292;&#34429;&#28982;&#26412;&#22320;&#26102;&#38388;&#26159;&#19981;&#21516;&#30340;&#65292;&#20294;&#26159;&#36825;&#20004;&#20010;&#26102;&#38388;&#34920;&#31034;&#30340;&#26102;&#21051;&#26159;&#30456;&#21516;&#30340;&#12290;</p>
<h3>&#22799;&#20196;&#26102;</h3>
<p>&#26102;&#21306;&#36824;&#19981;&#26159;&#26368;&#22797;&#26434;&#30340;&#65292;&#26356;&#22797;&#26434;&#30340;&#26159;&#22799;&#20196;&#26102;&#12290;&#25152;&#35859;&#22799;&#20196;&#26102;&#65292;&#23601;&#26159;&#22799;&#22825;&#24320;&#22987;&#30340;&#26102;&#20505;&#65292;&#25226;&#26102;&#38388;&#24448;&#21518;&#25320;1&#23567;&#26102;&#65292;&#22799;&#22825;&#32467;&#26463;&#30340;&#26102;&#20505;&#65292;&#20877;&#25226;&#26102;&#38388;&#24448;&#21069;&#25320;1&#23567;&#26102;&#12290;&#25105;&#20204;&#22269;&#23478;&#23454;&#34892;&#36807;&#19968;&#27573;&#26102;&#38388;&#22799;&#20196;&#26102;&#65292;1992&#24180;&#23601;&#24223;&#38500;&#20102;&#65292;&#20294;&#26159;&#30699;&#24773;&#30340;&#32654;&#22269;&#20154;&#21040;&#29616;&#22312;&#36824;&#22312;&#20351;&#29992;&#65292;&#25152;&#20197;&#26102;&#38388;&#25442;&#31639;&#26356;&#21152;&#22797;&#26434;&#12290;</p>
<p><img src="/static/img/loading.svg" data-src="/files/attachments/1298616301912130/l" alt="daynight-saving"></p>
<p>&#22240;&#20026;&#28041;&#21450;&#21040;&#22799;&#20196;&#26102;&#65292;&#30456;&#21516;&#30340;&#26102;&#21306;&#65292;&#22914;&#26524;&#34920;&#31034;&#30340;&#26041;&#24335;&#19981;&#21516;&#65292;&#36716;&#25442;&#20986;&#30340;&#26102;&#38388;&#26159;&#19981;&#21516;&#30340;&#12290;&#25105;&#20204;&#20030;&#20010;&#26647;&#23376;&#65306;</p>
<p>&#23545;&#20110;2019-11-20&#21644;2019-6-20&#20004;&#20010;&#26085;&#26399;&#26469;&#35828;&#65292;&#20551;&#35774;&#21271;&#20140;&#20154;&#22312;&#32445;&#32422;&#65306;</p>
<ul>
<li>
<p>&#22914;&#26524;&#20197;<code>GMT</code>&#25110;&#32773;<code>UTC</code>&#20316;&#20026;&#26102;&#21306;&#65292;&#26080;&#35770;&#26085;&#26399;&#26159;&#22810;&#23569;&#65292;&#26102;&#38388;&#37117;&#26159;<code>19:00</code>&#65307;</p>
</li>
<li>
<p>&#22914;&#26524;&#20197;&#22269;&#23478;&#65295;&#22478;&#24066;&#34920;&#31034;&#65292;&#20363;&#22914;<code>America&#65295;NewYork</code>&#65292;&#34429;&#28982;&#32445;&#32422;&#20063;&#22312;&#35199;&#20116;&#21306;&#65292;&#20294;&#26159;&#65292;&#22240;&#20026;&#22799;&#20196;&#26102;&#30340;&#23384;&#22312;&#65292;&#22312;&#19981;&#21516;&#30340;&#26085;&#26399;&#65292;<code>GMT</code>&#26102;&#38388;&#21644;&#32445;&#32422;&#26102;&#38388;&#21487;&#33021;&#26159;&#19981;&#19968;&#26679;&#30340;&#65306;</p>
</li>
</ul>
<table>
<thead>
<tr>
<th>&#26102;&#21306;</th>
<th>2019-11-20</th>
<th>2019-6-20</th>
</tr>
</thead>
<tbody>
<tr>
<td>GMT-05:00</td>
<td>19:00</td>
<td>19:00</td>
</tr>
<tr>
<td>UTC-05:00</td>
<td>19:00</td>
<td>19:00</td>
</tr>
<tr>
<td>America/New_York</td>
<td>19:00</td>
<td>20:00</td>
</tr>
</tbody>
</table>
<p>&#23454;&#34892;&#22799;&#20196;&#26102;&#30340;&#19981;&#21516;&#22320;&#21306;&#65292;&#36827;&#20837;&#21644;&#36864;&#20986;&#22799;&#20196;&#26102;&#30340;&#26102;&#38388;&#24456;&#21487;&#33021;&#26159;&#19981;&#21516;&#30340;&#12290;&#21516;&#19968;&#20010;&#22320;&#21306;&#65292;&#26681;&#25454;&#21382;&#21490;&#19978;&#26159;&#21542;&#23454;&#34892;&#36807;&#22799;&#20196;&#26102;&#65292;&#26631;&#20934;&#26102;&#38388;&#22312;&#19981;&#21516;&#24180;&#20221;&#25442;&#31639;&#25104;&#24403;&#22320;&#26102;&#38388;&#20063;&#26159;&#19981;&#21516;&#30340;&#12290;&#22240;&#27492;&#65292;&#35745;&#31639;&#22799;&#20196;&#26102;&#65292;&#27809;&#26377;&#32479;&#19968;&#30340;&#20844;&#24335;&#65292;&#24517;&#39035;&#25353;&#29031;&#19968;&#32452;&#32473;&#23450;&#30340;&#35268;&#21017;&#26469;&#31639;&#65292;&#24182;&#19988;&#65292;&#35813;&#35268;&#21017;&#35201;&#23450;&#26399;&#26356;&#26032;&#12290;</p>
<pre><code class="language-!">&#35745;&#31639;&#22799;&#20196;&#26102;&#35831;&#20351;&#29992;&#26631;&#20934;&#24211;&#25552;&#20379;&#30340;&#30456;&#20851;&#31867;&#65292;&#19981;&#35201;&#35797;&#22270;&#33258;&#24049;&#35745;&#31639;&#22799;&#20196;&#26102;&#12290;
</code></pre>
<h3>&#26412;&#22320;&#21270;</h3>
<p>&#22312;&#35745;&#31639;&#26426;&#20013;&#65292;&#36890;&#24120;&#20351;&#29992;<code>Locale</code>&#34920;&#31034;&#19968;&#20010;&#22269;&#23478;&#25110;&#22320;&#21306;&#30340;&#26085;&#26399;&#12289;&#26102;&#38388;&#12289;&#25968;&#23383;&#12289;&#36135;&#24065;&#31561;&#26684;&#24335;&#12290;<code>Locale</code>&#30001;<code>&#35821;&#35328;_&#22269;&#23478;</code>&#30340;&#23383;&#27597;&#32553;&#20889;&#26500;&#25104;&#65292;&#20363;&#22914;&#65292;<code>zh_CN</code>&#34920;&#31034;&#20013;&#25991;+&#20013;&#22269;&#65292;<code>en_US</code>&#34920;&#31034;&#33521;&#25991;+&#32654;&#22269;&#12290;&#35821;&#35328;&#20351;&#29992;&#23567;&#20889;&#65292;&#22269;&#23478;&#20351;&#29992;&#22823;&#20889;&#12290;</p>
<p>&#23545;&#20110;&#26085;&#26399;&#26469;&#35828;&#65292;&#19981;&#21516;&#30340;Locale&#65292;&#20363;&#22914;&#65292;&#20013;&#22269;&#21644;&#32654;&#22269;&#30340;&#34920;&#31034;&#26041;&#24335;&#22914;&#19979;&#65306;</p>
<ul>
<li>zh_CN&#65306;2016-11-30</li>
<li>en_US&#65306;11/30/2016</li>
</ul>
<p>&#35745;&#31639;&#26426;&#29992;<code>Locale</code>&#22312;&#26085;&#26399;&#12289;&#26102;&#38388;&#12289;&#36135;&#24065;&#21644;&#23383;&#31526;&#20018;&#20043;&#38388;&#36827;&#34892;&#36716;&#25442;&#12290;&#19968;&#20010;&#30005;&#21830;&#32593;&#31449;&#20250;&#26681;&#25454;&#29992;&#25143;&#25152;&#22312;&#30340;<code>Locale</code>&#23545;&#29992;&#25143;&#26174;&#31034;&#22914;&#19979;&#65306;</p>
<table>
<thead>
<tr>
<th></th>
<th>&#20013;&#22269;&#29992;&#25143;</th>
<th>&#32654;&#22269;&#29992;&#25143;</th>
</tr>
</thead>
<tbody>
<tr>
<td>&#36141;&#20080;&#20215;&#26684;</td>
<td>12000.00</td>
<td>12,000.00</td>
</tr>
<tr>
<td>&#36141;&#20080;&#26085;&#26399;</td>
<td>2016-11-30</td>
<td>11/30/2016</td>
</tr>
</tbody>
</table>
<h3>&#23567;&#32467;</h3>
<p>&#22312;&#32534;&#20889;&#26085;&#26399;&#21644;&#26102;&#38388;&#30340;&#31243;&#24207;&#21069;&#65292;&#25105;&#20204;&#35201;&#20934;&#30830;&#29702;&#35299;&#26085;&#26399;&#12289;&#26102;&#38388;&#21644;&#26102;&#21051;&#30340;&#27010;&#24565;&#12290;</p>
<p>&#30001;&#20110;&#23384;&#22312;&#26412;&#22320;&#26102;&#38388;&#65292;&#25105;&#20204;&#38656;&#35201;&#29702;&#35299;&#26102;&#21306;&#30340;&#27010;&#24565;&#65292;&#24182;&#19988;&#24517;&#39035;&#29282;&#35760;&#30001;&#20110;&#22799;&#20196;&#26102;&#30340;&#23384;&#22312;&#65292;&#21516;&#19968;&#22320;&#21306;&#29992;<code>GMT/UTC</code>&#21644;&#22478;&#24066;&#34920;&#31034;&#30340;&#26102;&#21306;&#21487;&#33021;&#23548;&#33268;&#26102;&#38388;&#19981;&#21516;&#12290;</p>
<p>&#35745;&#31639;&#26426;&#36890;&#36807;<code>Locale</code>&#26469;&#38024;&#23545;&#24403;&#22320;&#29992;&#25143;&#20064;&#24815;&#26684;&#24335;&#21270;&#26085;&#26399;&#12289;&#26102;&#38388;&#12289;&#25968;&#23383;&#12289;&#36135;&#24065;&#31561;&#12290;</p>
</div>

    <hr>

    <div class="x-wiki-prev-next uk-clearfix"></div>

    <div class="x-anchor x-comment-anchor"><a name="comments"></a></div>
							</div>
							<div id="x-content-bottom">
								<!-- __snippet__.contentBottom -->
								<div id="sponsor-a" class="uk-margin-bottom"></div>
								<!-- // __snippet__.contentBottom -->
							</div>
							<div id="x-content-comment">
								    <h3>Comments</h3>

    <ul id="x-comment-list" class="uk-comment-list">
    </ul>

    <h3>Make a comment</h3>

    <div class="x-display-if-not-signin">
        <p><button type="button" class="uk-button" onclick="showSignin()"><i class="uk-icon-signin"></i> Sign in to make a comment</button></p>
    </div>

    <div id="x-comment-area"></div>

							</div>
						</div>
											
