<div class="uk-flex-item-1" style="padding-left:15px; ">
							<div id="x-content-top">
								<!-- __snippet__.contentTop -->
																<!-- // __snippet__.contentTop -->
							</div>
							<div id="x-content">
								    <h4>&#27491;&#21017;&#34920;&#36798;&#24335;&#31616;&#20171;</h4>
    <div class="x-wiki-info">
    	<span>Reads: 77706</span>
    	<a href="/manage/wiki/wikipage_update?id=1304066130968610" target="_blank" class="x-can-edit uk-text-danger">Edit</a>
</div>

    <hr>

    <div class="x-wiki-content x-main-content">
<p>&#22312;&#20102;&#35299;&#27491;&#21017;&#34920;&#36798;&#24335;&#20043;&#21069;&#65292;&#25105;&#20204;&#20808;&#30475;&#20960;&#20010;&#38750;&#24120;&#24120;&#35265;&#30340;&#38382;&#39064;&#65306;</p>
<ul>
<li>
<p>&#22914;&#20309;&#21028;&#26029;&#23383;&#31526;&#20018;&#26159;&#21542;&#26159;&#26377;&#25928;&#30340;&#30005;&#35805;&#21495;&#30721;&#65311;&#20363;&#22914;&#65306;<code>010-1234567</code>&#65292;<code>123ABC456</code>&#65292;<code>13510001000</code>&#31561;&#65307;</p>
</li>
<li>
<p>&#22914;&#20309;&#21028;&#26029;&#23383;&#31526;&#20018;&#26159;&#21542;&#26159;&#26377;&#25928;&#30340;&#30005;&#23376;&#37038;&#20214;&#22320;&#22336;&#65311;&#20363;&#22914;&#65306;<code>test@example.com</code>&#65292;<code>test#example</code>&#31561;&#65307;</p>
</li>
<li>
<p>&#22914;&#20309;&#21028;&#26029;&#23383;&#31526;&#20018;&#26159;&#21542;&#26159;&#26377;&#25928;&#30340;&#26102;&#38388;&#65311;&#20363;&#22914;&#65306;<code>12:34</code>&#65292;<code>09:60</code>&#65292;<code>99:99</code>&#31561;&#12290;</p>
</li>
</ul>
<p>&#19968;&#31181;&#30452;&#35266;&#30340;&#24819;&#27861;&#26159;&#36890;&#36807;&#31243;&#24207;&#21028;&#26029;&#65292;&#36825;&#31181;&#26041;&#27861;&#38656;&#35201;&#20026;&#27599;&#31181;&#29992;&#20363;&#21019;&#24314;&#35268;&#21017;&#65292;&#28982;&#21518;&#29992;&#20195;&#30721;&#23454;&#29616;&#12290;&#19979;&#38754;&#26159;&#21028;&#26029;&#25163;&#26426;&#21495;&#30340;&#20195;&#30721;&#65306;</p>
<pre><code>boolean isValidMobileNumber(String s) {
    // &#26159;&#21542;&#26159;11&#20301;&#65311;
    if (s.length() != 11) {
        return false;
    }
    // &#27599;&#19968;&#20301;&#37117;&#26159;0~9&#65306;
    for (int i=0; i&lt;s.length(); i++) {
        char c = s.charAt(i);
        if (c &lt; '0' || c &gt; '9') {
            return false;
        }
    }
    return true;
}
</code></pre>
<p>&#19978;&#36848;&#20195;&#30721;&#20165;&#20165;&#20570;&#20102;&#38750;&#24120;&#31895;&#30053;&#30340;&#21028;&#26029;&#65292;&#24182;&#26410;&#32771;&#34385;&#39318;&#20301;&#25968;&#23383;&#19981;&#33021;&#20026;<code>0</code>&#31561;&#26356;&#35814;&#32454;&#30340;&#24773;&#20917;&#12290;</p>
<p>&#38500;&#20102;&#21028;&#26029;&#25163;&#26426;&#21495;&#65292;&#25105;&#20204;&#36824;&#38656;&#35201;&#21028;&#26029;&#30005;&#23376;&#37038;&#20214;&#22320;&#22336;&#12289;&#30005;&#35805;&#12289;&#37038;&#32534;&#31561;&#31561;&#65306;</p>
<ul>
<li>boolean isValidMobileNumber(String s) { ... }</li>
<li>boolean isValidEmail(String s) { ... }</li>
<li>boolean isValidPhoneNumber(String s) { ... }</li>
<li>boolean isValidZipCode(String s) { ... }</li>
<li>...</li>
</ul>
<p>&#20026;&#27599;&#19968;&#31181;&#21028;&#26029;&#36923;&#36753;&#32534;&#20889;&#20195;&#30721;&#23454;&#22312;&#26159;&#22826;&#32321;&#29712;&#20102;&#12290;&#26377;&#27809;&#26377;&#26356;&#31616;&#21333;&#30340;&#26041;&#27861;&#65311;</p>
<p>&#26377;&#65281;&#29992;&#27491;&#21017;&#34920;&#36798;&#24335;&#65281;</p>
<p>&#27491;&#21017;&#34920;&#36798;&#24335;&#21487;&#20197;&#29992;&#23383;&#31526;&#20018;&#26469;&#25551;&#36848;&#35268;&#21017;&#65292;&#24182;&#29992;&#26469;&#21305;&#37197;&#23383;&#31526;&#20018;&#12290;&#20363;&#22914;&#65292;&#21028;&#26029;&#25163;&#26426;&#21495;&#65292;&#25105;&#20204;&#29992;&#27491;&#21017;&#34920;&#36798;&#24335;<code>\d{11}</code>&#65306;</p>
<pre><code>boolean isValidMobileNumber(String s) {
    return s.matches("\\d{11}");
}
</code></pre>
<p>&#20351;&#29992;&#27491;&#21017;&#34920;&#36798;&#24335;&#30340;&#22909;&#22788;&#26377;&#21738;&#20123;&#65311;&#19968;&#20010;&#27491;&#21017;&#34920;&#36798;&#24335;&#23601;&#26159;&#19968;&#20010;&#25551;&#36848;&#35268;&#21017;&#30340;&#23383;&#31526;&#20018;&#65292;&#25152;&#20197;&#65292;&#21482;&#38656;&#35201;&#32534;&#20889;&#27491;&#30830;&#30340;&#35268;&#21017;&#65292;&#25105;&#20204;&#23601;&#21487;&#20197;&#35753;&#27491;&#21017;&#34920;&#36798;&#24335;&#24341;&#25806;&#21435;&#21028;&#26029;&#30446;&#26631;&#23383;&#31526;&#20018;&#26159;&#21542;&#31526;&#21512;&#35268;&#21017;&#12290;</p>
<p>&#27491;&#21017;&#34920;&#36798;&#24335;&#26159;&#19968;&#22871;&#26631;&#20934;&#65292;&#23427;&#21487;&#20197;&#29992;&#20110;&#20219;&#20309;&#35821;&#35328;&#12290;Java&#26631;&#20934;&#24211;&#30340;<code>java.util.regex</code>&#21253;&#20869;&#32622;&#20102;&#27491;&#21017;&#34920;&#36798;&#24335;&#24341;&#25806;&#65292;&#22312;Java&#31243;&#24207;&#20013;&#20351;&#29992;&#27491;&#21017;&#34920;&#36798;&#24335;&#38750;&#24120;&#31616;&#21333;&#12290;</p>
<p>&#20030;&#20010;&#20363;&#23376;&#65306;&#35201;&#21028;&#26029;&#29992;&#25143;&#36755;&#20837;&#30340;&#24180;&#20221;&#26159;&#21542;&#26159;<code>20##</code>&#24180;&#65292;&#25105;&#20204;&#20808;&#20889;&#20986;&#35268;&#21017;&#22914;&#19979;&#65306;</p>
<p>&#19968;&#20849;&#26377;4&#20010;&#23383;&#31526;&#65292;&#20998;&#21035;&#26159;&#65306;<code>2</code>&#65292;<code>0</code>&#65292;<code>0~9&#20219;&#24847;&#25968;&#23383;</code>&#65292;<code>0~9&#20219;&#24847;&#25968;&#23383;</code>&#12290;</p>
<p>&#23545;&#24212;&#30340;&#27491;&#21017;&#34920;&#36798;&#24335;&#23601;&#26159;&#65306;<code>20\d\d</code>&#65292;&#20854;&#20013;<code>\d</code>&#34920;&#31034;&#20219;&#24847;&#19968;&#20010;&#25968;&#23383;&#12290;</p>
<p>&#25226;&#27491;&#21017;&#34920;&#36798;&#24335;&#36716;&#25442;&#20026;Java&#23383;&#31526;&#20018;&#23601;&#21464;&#25104;&#20102;<code>20\\d\\d</code>&#65292;&#27880;&#24847;Java&#23383;&#31526;&#20018;&#29992;<code>\\</code>&#34920;&#31034;<code>\</code>&#12290;</p>
<p>&#26368;&#21518;&#65292;&#29992;&#27491;&#21017;&#34920;&#36798;&#24335;&#21305;&#37197;&#19968;&#20010;&#23383;&#31526;&#20018;&#30340;&#20195;&#30721;&#22914;&#19979;&#65306;</p>
<pre><code class="language-x-java">// regex
----
public class Main {
    public static void main(String[] args) {
        String regex = "20\\d\\d";
        System.out.println("2019".matches(regex)); // true
        System.out.println("2100".matches(regex)); // false
    }
}
</code></pre>
<p>&#21487;&#35265;&#65292;&#20351;&#29992;&#27491;&#21017;&#34920;&#36798;&#24335;&#65292;&#19981;&#24517;&#32534;&#20889;&#22797;&#26434;&#30340;&#20195;&#30721;&#26469;&#21028;&#26029;&#65292;&#21482;&#38656;&#32473;&#20986;&#19968;&#20010;&#23383;&#31526;&#20018;&#34920;&#36798;&#30340;&#27491;&#21017;&#35268;&#21017;&#21363;&#21487;&#12290;</p>
<h3>&#23567;&#32467;</h3>
<p>&#27491;&#21017;&#34920;&#36798;&#24335;&#26159;&#29992;&#23383;&#31526;&#20018;&#25551;&#36848;&#30340;&#19968;&#20010;&#21305;&#37197;&#35268;&#21017;&#65292;&#20351;&#29992;&#27491;&#21017;&#34920;&#36798;&#24335;&#21487;&#20197;&#24555;&#36895;&#21028;&#26029;&#32473;&#23450;&#30340;&#23383;&#31526;&#20018;&#26159;&#21542;&#31526;&#21512;&#21305;&#37197;&#35268;&#21017;&#12290;Java&#26631;&#20934;&#24211;<code>java.util.regex</code>&#20869;&#24314;&#20102;&#27491;&#21017;&#34920;&#36798;&#24335;&#24341;&#25806;&#12290;</p>
</div>

    <hr>

    <div class="x-wiki-prev-next uk-clearfix"></div>

    <div class="x-anchor x-comment-anchor"><a name="comments"></a></div>
							</div>
							<div id="x-content-bottom">
								<!-- __snippet__.contentBottom -->
								<div id="sponsor-a" class="uk-margin-bottom"></div>
								<!-- // __snippet__.contentBottom -->
							</div>
							<div id="x-content-comment">
								    <h3>Comments</h3>

    <ul id="x-comment-list" class="uk-comment-list">
    </ul>

    <h3>Make a comment</h3>

    <div class="x-display-if-not-signin">
        <p><button type="button" class="uk-button" onclick="showSignin()"><i class="uk-icon-signin"></i> Sign in to make a comment</button></p>
    </div>

    <div id="x-comment-area"></div>

							</div>
						</div>
											
