<div class="uk-flex-item-1" style="padding-left:15px; ">
							<div id="x-content-top">
								<!-- __snippet__.contentTop -->
																<!-- // __snippet__.contentTop -->
							</div>
							<div id="x-content">
								    <h4>&#21704;&#24076;&#31639;&#27861;</h4>
    <div class="x-wiki-info">
    	<span>Reads: 44333</span>
    	<a href="/manage/wiki/wikipage_update?id=1304227729113121" target="_blank" class="x-can-edit uk-text-danger">Edit</a>
</div>

    <hr>

    <div class="x-wiki-content x-main-content">
<p>&#21704;&#24076;&#31639;&#27861;&#65288;Hash&#65289;&#21448;&#31216;&#25688;&#35201;&#31639;&#27861;&#65288;Digest&#65289;&#65292;&#23427;&#30340;&#20316;&#29992;&#26159;&#65306;&#23545;&#20219;&#24847;&#19968;&#32452;&#36755;&#20837;&#25968;&#25454;&#36827;&#34892;&#35745;&#31639;&#65292;&#24471;&#21040;&#19968;&#20010;&#22266;&#23450;&#38271;&#24230;&#30340;&#36755;&#20986;&#25688;&#35201;&#12290;</p>
<p>&#21704;&#24076;&#31639;&#27861;&#26368;&#37325;&#35201;&#30340;&#29305;&#28857;&#23601;&#26159;&#65306;</p>
<ul>
<li>&#30456;&#21516;&#30340;&#36755;&#20837;&#19968;&#23450;&#24471;&#21040;&#30456;&#21516;&#30340;&#36755;&#20986;&#65307;</li>
<li>&#19981;&#21516;&#30340;&#36755;&#20837;&#22823;&#27010;&#29575;&#24471;&#21040;&#19981;&#21516;&#30340;&#36755;&#20986;&#12290;</li>
</ul>
<p>&#21704;&#24076;&#31639;&#27861;&#30340;&#30446;&#30340;&#23601;&#26159;&#20026;&#20102;&#39564;&#35777;&#21407;&#22987;&#25968;&#25454;&#26159;&#21542;&#34987;&#31713;&#25913;&#12290;</p>
<p>Java&#23383;&#31526;&#20018;&#30340;<code>hashCode()</code>&#23601;&#26159;&#19968;&#20010;&#21704;&#24076;&#31639;&#27861;&#65292;&#23427;&#30340;&#36755;&#20837;&#26159;&#20219;&#24847;&#23383;&#31526;&#20018;&#65292;&#36755;&#20986;&#26159;&#22266;&#23450;&#30340;4&#23383;&#33410;<code>int</code>&#25972;&#25968;&#65306;</p>
<pre><code>"hello".hashCode(); // 0x5e918d2
"hello, java".hashCode(); // 0x7a9d88e8
"hello, bob".hashCode(); // 0xa0dbae2f
</code></pre>
<p>&#20004;&#20010;&#30456;&#21516;&#30340;&#23383;&#31526;&#20018;&#27704;&#36828;&#20250;&#35745;&#31639;&#20986;&#30456;&#21516;&#30340;<code>hashCode</code>&#65292;&#21542;&#21017;&#22522;&#20110;<code>hashCode</code>&#23450;&#20301;&#30340;<code>HashMap</code>&#23601;&#26080;&#27861;&#27491;&#24120;&#24037;&#20316;&#12290;&#36825;&#20063;&#26159;&#20026;&#20160;&#20040;&#24403;&#25105;&#20204;&#33258;&#23450;&#20041;&#19968;&#20010;class&#26102;&#65292;&#35206;&#20889;<code>equals()</code>&#26041;&#27861;&#26102;&#25105;&#20204;&#24517;&#39035;&#27491;&#30830;&#35206;&#20889;<code>hashCode()</code>&#26041;&#27861;&#12290;</p>
<h3>&#21704;&#24076;&#30896;&#25758;</h3>
<p>&#21704;&#24076;&#30896;&#25758;&#26159;&#25351;&#65292;&#20004;&#20010;&#19981;&#21516;&#30340;&#36755;&#20837;&#24471;&#21040;&#20102;&#30456;&#21516;&#30340;&#36755;&#20986;&#65306;</p>
<pre><code>"AaAaAa".hashCode(); // 0x7460e8c0
"BBAaBB".hashCode(); // 0x7460e8c0
</code></pre>
<p>&#26377;&#31461;&#38795;&#20250;&#38382;&#65306;&#30896;&#25758;&#33021;&#19981;&#33021;&#36991;&#20813;&#65311;&#31572;&#26696;&#26159;&#19981;&#33021;&#12290;&#30896;&#25758;&#26159;&#19968;&#23450;&#20250;&#20986;&#29616;&#30340;&#65292;&#22240;&#20026;&#36755;&#20986;&#30340;&#23383;&#33410;&#38271;&#24230;&#26159;&#22266;&#23450;&#30340;&#65292;<code>String</code>&#30340;<code>hashCode()</code>&#36755;&#20986;&#26159;4&#23383;&#33410;&#25972;&#25968;&#65292;&#26368;&#22810;&#21482;&#26377;4294967296&#31181;&#36755;&#20986;&#65292;&#20294;&#36755;&#20837;&#30340;&#25968;&#25454;&#38271;&#24230;&#26159;&#19981;&#22266;&#23450;&#30340;&#65292;&#26377;&#26080;&#25968;&#31181;&#36755;&#20837;&#12290;&#25152;&#20197;&#65292;&#21704;&#24076;&#31639;&#27861;&#26159;&#25226;&#19968;&#20010;&#26080;&#38480;&#30340;&#36755;&#20837;&#38598;&#21512;&#26144;&#23556;&#21040;&#19968;&#20010;&#26377;&#38480;&#30340;&#36755;&#20986;&#38598;&#21512;&#65292;&#24517;&#28982;&#20250;&#20135;&#29983;&#30896;&#25758;&#12290;</p>
<p>&#30896;&#25758;&#19981;&#21487;&#24597;&#65292;&#25105;&#20204;&#25285;&#24515;&#30340;&#19981;&#26159;&#30896;&#25758;&#65292;&#32780;&#26159;&#30896;&#25758;&#30340;&#27010;&#29575;&#65292;&#22240;&#20026;&#30896;&#25758;&#27010;&#29575;&#30340;&#39640;&#20302;&#20851;&#31995;&#21040;&#21704;&#24076;&#31639;&#27861;&#30340;&#23433;&#20840;&#24615;&#12290;&#19968;&#20010;&#23433;&#20840;&#30340;&#21704;&#24076;&#31639;&#27861;&#24517;&#39035;&#28385;&#36275;&#65306;</p>
<ul>
<li>&#30896;&#25758;&#27010;&#29575;&#20302;&#65307;</li>
<li>&#19981;&#33021;&#29468;&#27979;&#36755;&#20986;&#12290;</li>
</ul>
<p>&#19981;&#33021;&#29468;&#27979;&#36755;&#20986;&#26159;&#25351;&#65292;&#36755;&#20837;&#30340;&#20219;&#24847;&#19968;&#20010;bit&#30340;&#21464;&#21270;&#20250;&#36896;&#25104;&#36755;&#20986;&#23436;&#20840;&#19981;&#21516;&#65292;&#36825;&#26679;&#23601;&#24456;&#38590;&#20174;&#36755;&#20986;&#21453;&#25512;&#36755;&#20837;&#65288;&#21482;&#33021;&#20381;&#38752;&#26292;&#21147;&#31351;&#20030;&#65289;&#12290;&#20551;&#35774;&#19968;&#31181;&#21704;&#24076;&#31639;&#27861;&#26377;&#22914;&#19979;&#35268;&#24459;&#65306;</p>
<pre><code>hashA("java001") = "123456"
hashA("java002") = "123457"
hashA("java003") = "123458"
</code></pre>
<p>&#37027;&#20040;&#24456;&#23481;&#26131;&#20174;&#36755;&#20986;<code>123459</code>&#21453;&#25512;&#36755;&#20837;&#65292;&#36825;&#31181;&#21704;&#24076;&#31639;&#27861;&#23601;&#19981;&#23433;&#20840;&#12290;&#23433;&#20840;&#30340;&#21704;&#24076;&#31639;&#27861;&#20174;&#36755;&#20986;&#26159;&#30475;&#19981;&#20986;&#20219;&#20309;&#35268;&#24459;&#30340;&#65306;</p>
<pre><code>hashB("java001") = "123456"
hashB("java002") = "580271"
hashB("java003") = ???
</code></pre>
<p>&#24120;&#29992;&#30340;&#21704;&#24076;&#31639;&#27861;&#26377;&#65306;</p>
<table>
<thead>
<tr>
<th>&#31639;&#27861;</th>
<th>&#36755;&#20986;&#38271;&#24230;&#65288;&#20301;&#65289;</th>
<th>&#36755;&#20986;&#38271;&#24230;&#65288;&#23383;&#33410;&#65289;</th>
</tr>
</thead>
<tbody>
<tr>
<td>MD5</td>
<td>128 bits</td>
<td>16 bytes</td>
</tr>
<tr>
<td>SHA-1</td>
<td>160 bits</td>
<td>20 bytes</td>
</tr>
<tr>
<td>RipeMD-160</td>
<td>160 bits</td>
<td>20 bytes</td>
</tr>
<tr>
<td>SHA-256</td>
<td>256 bits</td>
<td>32 bytes</td>
</tr>
<tr>
<td>SHA-512</td>
<td>512 bits</td>
<td>64 bytes</td>
</tr>
</tbody>
</table>
<p>&#26681;&#25454;&#30896;&#25758;&#27010;&#29575;&#65292;&#21704;&#24076;&#31639;&#27861;&#30340;&#36755;&#20986;&#38271;&#24230;&#36234;&#38271;&#65292;&#23601;&#36234;&#38590;&#20135;&#29983;&#30896;&#25758;&#65292;&#20063;&#23601;&#36234;&#23433;&#20840;&#12290;</p>
<p>Java&#26631;&#20934;&#24211;&#25552;&#20379;&#20102;&#24120;&#29992;&#30340;&#21704;&#24076;&#31639;&#27861;&#65292;&#24182;&#19988;&#26377;&#19968;&#22871;&#32479;&#19968;&#30340;&#25509;&#21475;&#12290;&#25105;&#20204;&#20197;MD5&#31639;&#27861;&#20026;&#20363;&#65292;&#30475;&#30475;&#22914;&#20309;&#23545;&#36755;&#20837;&#35745;&#31639;&#21704;&#24076;&#65306;</p>
<pre><code class="language-x-java">import java.math.BigInteger;
import java.security.MessageDigest;
----
public class Main {
    public static void main(String[] args) throws Exception {
        // &#21019;&#24314;&#19968;&#20010;MessageDigest&#23454;&#20363;:
        MessageDigest md = MessageDigest.getInstance("MD5");
        // &#21453;&#22797;&#35843;&#29992;update&#36755;&#20837;&#25968;&#25454;:
        md.update("Hello".getBytes("UTF-8"));
        md.update("World".getBytes("UTF-8"));
        byte[] result = md.digest(); // 16 bytes: 68e109f0f40ca72a15e05cc22786f8e6
        System.out.println(new BigInteger(1, result).toString(16));
    }
}
</code></pre>
<p>&#20351;&#29992;<code>MessageDigest</code>&#26102;&#65292;&#25105;&#20204;&#39318;&#20808;&#26681;&#25454;&#21704;&#24076;&#31639;&#27861;&#33719;&#21462;&#19968;&#20010;<code>MessageDigest</code>&#23454;&#20363;&#65292;&#28982;&#21518;&#65292;&#21453;&#22797;&#35843;&#29992;<code>update(byte[])</code>&#36755;&#20837;&#25968;&#25454;&#12290;&#24403;&#36755;&#20837;&#32467;&#26463;&#21518;&#65292;&#35843;&#29992;<code>digest()</code>&#26041;&#27861;&#33719;&#24471;byte[]&#25968;&#32452;&#34920;&#31034;&#30340;&#25688;&#35201;&#65292;&#26368;&#21518;&#65292;&#25226;&#23427;&#36716;&#25442;&#20026;&#21313;&#20845;&#36827;&#21046;&#30340;&#23383;&#31526;&#20018;&#12290;</p>
<p>&#36816;&#34892;&#19978;&#36848;&#20195;&#30721;&#65292;&#21487;&#20197;&#24471;&#21040;&#36755;&#20837;<code>HelloWorld</code>&#30340;MD5&#26159;<code>68e109f0f40ca72a15e05cc22786f8e6</code>&#12290;</p>
<h3>&#21704;&#24076;&#31639;&#27861;&#30340;&#29992;&#36884;</h3>
<p>&#22240;&#20026;&#30456;&#21516;&#30340;&#36755;&#20837;&#27704;&#36828;&#20250;&#24471;&#21040;&#30456;&#21516;&#30340;&#36755;&#20986;&#65292;&#22240;&#27492;&#65292;&#22914;&#26524;&#36755;&#20837;&#34987;&#20462;&#25913;&#20102;&#65292;&#24471;&#21040;&#30340;&#36755;&#20986;&#23601;&#20250;&#19981;&#21516;&#12290;</p>
<p>&#25105;&#20204;&#22312;&#32593;&#31449;&#19978;&#19979;&#36733;&#36719;&#20214;&#30340;&#26102;&#20505;&#65292;&#32463;&#24120;&#30475;&#21040;&#19979;&#36733;&#39029;&#26174;&#31034;&#30340;&#21704;&#24076;&#65306;</p>
<p><img src="/static/img/loading.svg" data-src="/files/attachments/1305351978745921/l" alt="file-md5"></p>
<p>&#22914;&#20309;&#21028;&#26029;&#19979;&#36733;&#21040;&#26412;&#22320;&#30340;&#36719;&#20214;&#26159;&#21407;&#22987;&#30340;&#12289;&#26410;&#32463;&#31713;&#25913;&#30340;&#25991;&#20214;&#65311;&#25105;&#20204;&#21482;&#38656;&#35201;&#33258;&#24049;&#35745;&#31639;&#19968;&#19979;&#26412;&#22320;&#25991;&#20214;&#30340;&#21704;&#24076;&#20540;&#65292;&#20877;&#19982;&#23448;&#32593;&#20844;&#24320;&#30340;&#21704;&#24076;&#20540;&#23545;&#27604;&#65292;&#22914;&#26524;&#30456;&#21516;&#65292;&#35828;&#26126;&#25991;&#20214;&#19979;&#36733;&#27491;&#30830;&#65292;&#21542;&#21017;&#65292;&#35828;&#26126;&#25991;&#20214;&#24050;&#34987;&#31713;&#25913;&#12290;</p>
<p>&#21704;&#24076;&#31639;&#27861;&#30340;&#21478;&#19968;&#20010;&#37325;&#35201;&#29992;&#36884;&#26159;&#23384;&#20648;&#29992;&#25143;&#21475;&#20196;&#12290;&#22914;&#26524;&#30452;&#25509;&#23558;&#29992;&#25143;&#30340;&#21407;&#22987;&#21475;&#20196;&#23384;&#25918;&#21040;&#25968;&#25454;&#24211;&#20013;&#65292;&#20250;&#20135;&#29983;&#26497;&#22823;&#30340;&#23433;&#20840;&#39118;&#38505;&#65306;</p>
<ul>
<li>&#25968;&#25454;&#24211;&#31649;&#29702;&#21592;&#33021;&#22815;&#30475;&#21040;&#29992;&#25143;&#26126;&#25991;&#21475;&#20196;&#65307;</li>
<li>&#25968;&#25454;&#24211;&#25968;&#25454;&#19968;&#26086;&#27844;&#28431;&#65292;&#40657;&#23458;&#21363;&#21487;&#33719;&#21462;&#29992;&#25143;&#26126;&#25991;&#21475;&#20196;&#12290;</li>
</ul>
<p>&#19981;&#23384;&#20648;&#29992;&#25143;&#30340;&#21407;&#22987;&#21475;&#20196;&#65292;&#37027;&#20040;&#22914;&#20309;&#23545;&#29992;&#25143;&#36827;&#34892;&#35748;&#35777;&#65311;</p>
<p>&#26041;&#27861;&#26159;&#23384;&#20648;&#29992;&#25143;&#21475;&#20196;&#30340;&#21704;&#24076;&#65292;&#20363;&#22914;&#65292;MD5&#12290;</p>
<p>&#22312;&#29992;&#25143;&#36755;&#20837;&#21407;&#22987;&#21475;&#20196;&#21518;&#65292;&#31995;&#32479;&#35745;&#31639;&#29992;&#25143;&#36755;&#20837;&#30340;&#21407;&#22987;&#21475;&#20196;&#30340;MD5&#24182;&#19982;&#25968;&#25454;&#24211;&#23384;&#20648;&#30340;MD5&#23545;&#27604;&#65292;&#22914;&#26524;&#19968;&#33268;&#65292;&#35828;&#26126;&#21475;&#20196;&#27491;&#30830;&#65292;&#21542;&#21017;&#65292;&#21475;&#20196;&#38169;&#35823;&#12290;</p>
<p>&#22240;&#27492;&#65292;&#25968;&#25454;&#24211;&#23384;&#20648;&#29992;&#25143;&#21517;&#21644;&#21475;&#20196;&#30340;&#34920;&#20869;&#23481;&#24212;&#35813;&#20687;&#19979;&#38754;&#36825;&#26679;&#65306;</p>
<table>
<thead>
<tr>
<th>username</th>
<th>password</th>
</tr>
</thead>
<tbody>
<tr>
<td>bob</td>
<td>f30aa7a662c728b7407c54ae6bfd27d1</td>
</tr>
<tr>
<td>alice</td>
<td>25d55ad283aa400af464c76d713c07ad</td>
</tr>
<tr>
<td>tim</td>
<td>5f4dcc3b5aa765d61d8327deb882cf99</td>
</tr>
</tbody>
</table>
<p>&#36825;&#26679;&#19968;&#26469;&#65292;&#25968;&#25454;&#24211;&#31649;&#29702;&#21592;&#30475;&#19981;&#21040;&#29992;&#25143;&#30340;&#21407;&#22987;&#21475;&#20196;&#12290;&#21363;&#20351;&#25968;&#25454;&#24211;&#27844;&#28431;&#65292;&#40657;&#23458;&#20063;&#26080;&#27861;&#25343;&#21040;&#29992;&#25143;&#30340;&#21407;&#22987;&#21475;&#20196;&#12290;&#24819;&#35201;&#25343;&#21040;&#29992;&#25143;&#30340;&#21407;&#22987;&#21475;&#20196;&#65292;&#24517;&#39035;&#29992;&#26292;&#21147;&#31351;&#20030;&#30340;&#26041;&#27861;&#65292;&#19968;&#20010;&#21475;&#20196;&#19968;&#20010;&#21475;&#20196;&#22320;&#35797;&#65292;&#30452;&#21040;&#26576;&#20010;&#21475;&#20196;&#35745;&#31639;&#30340;MD5&#24688;&#22909;&#31561;&#20110;&#25351;&#23450;&#20540;&#12290;</p>
<p>&#20351;&#29992;&#21704;&#24076;&#21475;&#20196;&#26102;&#65292;&#36824;&#35201;&#27880;&#24847;&#38450;&#27490;&#24425;&#34425;&#34920;&#25915;&#20987;&#12290;</p>
<p>&#20160;&#20040;&#26159;&#24425;&#34425;&#34920;&#21602;&#65311;&#19978;&#38754;&#35762;&#21040;&#20102;&#65292;&#22914;&#26524;&#21482;&#25343;&#21040;MD5&#65292;&#20174;MD5&#21453;&#25512;&#26126;&#25991;&#21475;&#20196;&#65292;&#21482;&#33021;&#20351;&#29992;&#26292;&#21147;&#31351;&#20030;&#30340;&#26041;&#27861;&#12290;</p>
<p>&#28982;&#32780;&#40657;&#23458;&#24182;&#19981;&#31528;&#65292;&#26292;&#21147;&#31351;&#20030;&#20250;&#28040;&#32791;&#22823;&#37327;&#30340;&#31639;&#21147;&#21644;&#26102;&#38388;&#12290;&#20294;&#26159;&#65292;&#22914;&#26524;&#26377;&#19968;&#20010;&#39044;&#20808;&#35745;&#31639;&#22909;&#30340;&#24120;&#29992;&#21475;&#20196;&#21644;&#23427;&#20204;&#30340;MD5&#30340;&#23545;&#29031;&#34920;&#65306;</p>
<table>
<thead>
<tr>
<th>&#24120;&#29992;&#21475;&#20196;</th>
<th>MD5</th>
</tr>
</thead>
<tbody>
<tr>
<td>hello123</td>
<td>f30aa7a662c728b7407c54ae6bfd27d1</td>
</tr>
<tr>
<td>12345678</td>
<td>25d55ad283aa400af464c76d713c07ad</td>
</tr>
<tr>
<td>passw0rd</td>
<td>bed128365216c019988915ed3add75fb</td>
</tr>
<tr>
<td>19700101</td>
<td>570da6d5277a646f6552b8832012f5dc</td>
</tr>
<tr>
<td>&#8230;</td>
<td>&#8230;</td>
</tr>
<tr>
<td>20201231</td>
<td>6879c0ae9117b50074ce0a0d4c843060</td>
</tr>
</tbody>
</table>
<p>&#36825;&#20010;&#34920;&#23601;&#26159;&#24425;&#34425;&#34920;&#12290;&#22914;&#26524;&#29992;&#25143;&#20351;&#29992;&#20102;&#24120;&#29992;&#21475;&#20196;&#65292;&#40657;&#23458;&#20174;MD5&#19968;&#19979;&#23601;&#33021;&#21453;&#26597;&#21040;&#21407;&#22987;&#21475;&#20196;&#65306;</p>
<p>bob&#30340;MD5&#65306;<code>f30aa7a662c728b7407c54ae6bfd27d1</code>&#65292;&#21407;&#22987;&#21475;&#20196;&#65306;<code>hello123</code>&#65307;</p>
<p>alice&#30340;MD5&#65306;<code>25d55ad283aa400af464c76d713c07ad</code>&#65292;&#21407;&#22987;&#21475;&#20196;&#65306;<code>12345678</code>&#65307;</p>
<p>tim&#30340;MD5&#65306;<code>bed128365216c019988915ed3add75fb</code>&#65292;&#21407;&#22987;&#21475;&#20196;&#65306;<code>passw0rd</code>&#12290;</p>
<p>&#36825;&#23601;&#26159;&#20026;&#20160;&#20040;&#19981;&#35201;&#20351;&#29992;&#24120;&#29992;&#23494;&#30721;&#65292;&#20197;&#21450;&#19981;&#35201;&#20351;&#29992;&#29983;&#26085;&#20316;&#20026;&#23494;&#30721;&#30340;&#21407;&#22240;&#12290;</p>
<p>&#21363;&#20351;&#29992;&#25143;&#20351;&#29992;&#20102;&#24120;&#29992;&#21475;&#20196;&#65292;&#25105;&#20204;&#20063;&#21487;&#20197;&#37319;&#21462;&#25514;&#26045;&#26469;&#25269;&#24481;&#24425;&#34425;&#34920;&#25915;&#20987;&#65292;&#26041;&#27861;&#26159;&#23545;&#27599;&#20010;&#21475;&#20196;&#39069;&#22806;&#28155;&#21152;&#38543;&#26426;&#25968;&#65292;&#36825;&#20010;&#26041;&#27861;&#31216;&#20043;&#20026;&#21152;&#30416;&#65288;salt&#65289;&#65306;</p>
<pre><code>digest = md5(salt+inputPassword)
</code></pre>
<p>&#32463;&#36807;&#21152;&#30416;&#22788;&#29702;&#30340;&#25968;&#25454;&#24211;&#34920;&#65292;&#20869;&#23481;&#22914;&#19979;&#65306;</p>
<table>
<thead>
<tr>
<th>username</th>
<th>salt</th>
<th>password</th>
</tr>
</thead>
<tbody>
<tr>
<td>bob</td>
<td>H1r0a</td>
<td>a5022319ff4c56955e22a74abcc2c210</td>
</tr>
<tr>
<td>alice</td>
<td>7$p2w</td>
<td>e5de688c99e961ed6e560b972dab8b6a</td>
</tr>
<tr>
<td>tim</td>
<td>z5Sk9</td>
<td>1eee304b92dc0d105904e7ab58fd2f64</td>
</tr>
</tbody>
</table>
<p>&#21152;&#30416;&#30340;&#30446;&#30340;&#22312;&#20110;&#20351;&#40657;&#23458;&#30340;&#24425;&#34425;&#34920;&#22833;&#25928;&#65292;&#21363;&#20351;&#29992;&#25143;&#20351;&#29992;&#24120;&#29992;&#21475;&#20196;&#65292;&#20063;&#26080;&#27861;&#20174;MD5&#21453;&#25512;&#21407;&#22987;&#21475;&#20196;&#12290;</p>
<h3>SHA-1</h3>
<p>SHA-1&#20063;&#26159;&#19968;&#31181;&#21704;&#24076;&#31639;&#27861;&#65292;&#23427;&#30340;&#36755;&#20986;&#26159;160 bits&#65292;&#21363;20&#23383;&#33410;&#12290;SHA-1&#26159;&#30001;&#32654;&#22269;&#22269;&#23478;&#23433;&#20840;&#23616;&#24320;&#21457;&#30340;&#65292;SHA&#31639;&#27861;&#23454;&#38469;&#19978;&#26159;&#19968;&#20010;&#31995;&#21015;&#65292;&#21253;&#25324;SHA-0&#65288;&#24050;&#24223;&#24323;&#65289;&#12289;SHA-1&#12289;SHA-256&#12289;SHA-512&#31561;&#12290;</p>
<p>&#22312;Java&#20013;&#20351;&#29992;SHA-1&#65292;&#21644;MD5&#23436;&#20840;&#19968;&#26679;&#65292;&#21482;&#38656;&#35201;&#25226;&#31639;&#27861;&#21517;&#31216;&#25913;&#20026;<code>"SHA-1"</code>&#65306;</p>
<pre><code class="language-x-java">import java.math.BigInteger;
import java.security.MessageDigest;
----
public class Main {
    public static void main(String[] args) throws Exception {
        // &#21019;&#24314;&#19968;&#20010;MessageDigest&#23454;&#20363;:
        MessageDigest md = MessageDigest.getInstance("SHA-1");
        // &#21453;&#22797;&#35843;&#29992;update&#36755;&#20837;&#25968;&#25454;:
        md.update("Hello".getBytes("UTF-8"));
        md.update("World".getBytes("UTF-8"));
        byte[] result = md.digest(); // 20 bytes: 6f44e49f848dd8ed27f73f59ab5bd4631b3f6b0d
        System.out.println(new BigInteger(1, result).toString(16));
    }
}
</code></pre>
<p>&#31867;&#20284;&#30340;&#65292;&#35745;&#31639;SHA-256&#65292;&#25105;&#20204;&#38656;&#35201;&#20256;&#20837;&#21517;&#31216;<code>"SHA-256"</code>&#65292;&#35745;&#31639;SHA-512&#65292;&#25105;&#20204;&#38656;&#35201;&#20256;&#20837;&#21517;&#31216;<code>"SHA-512"</code>&#12290;Java&#26631;&#20934;&#24211;&#25903;&#25345;&#30340;&#25152;&#26377;&#21704;&#24076;&#31639;&#27861;&#21487;&#20197;&#22312;<a href="https://docs.oracle.com/en/java/javase/13/docs/specs/security/standard-names.html#messagedigest-algorithms">&#36825;&#37324;</a>&#26597;&#21040;&#12290;</p>
<pre><code class="language-!">&#27880;&#24847;&#65306;MD5&#22240;&#20026;&#36755;&#20986;&#38271;&#24230;&#36739;&#30701;&#65292;&#30701;&#26102;&#38388;&#20869;&#30772;&#35299;&#26159;&#21487;&#33021;&#30340;&#65292;&#30446;&#21069;&#24050;&#32463;&#19981;&#25512;&#33616;&#20351;&#29992;&#12290;
</code></pre>
<h3>&#23567;&#32467;</h3>
<p>&#21704;&#24076;&#31639;&#27861;&#21487;&#29992;&#20110;&#39564;&#35777;&#25968;&#25454;&#23436;&#25972;&#24615;&#65292;&#20855;&#26377;&#38450;&#31713;&#25913;&#26816;&#27979;&#30340;&#21151;&#33021;&#65307;</p>
<p>&#24120;&#29992;&#30340;&#21704;&#24076;&#31639;&#27861;&#26377;MD5&#12289;SHA-1&#31561;&#65307;</p>
<p>&#29992;&#21704;&#24076;&#23384;&#20648;&#21475;&#20196;&#26102;&#35201;&#32771;&#34385;&#24425;&#34425;&#34920;&#25915;&#20987;&#12290;</p>
</div>

    <hr>

    <div class="x-wiki-prev-next uk-clearfix"></div>

    <div class="x-anchor x-comment-anchor"><a name="comments"></a></div>
							</div>
							<div id="x-content-bottom">
								<!-- __snippet__.contentBottom -->
								<div id="sponsor-a" class="uk-margin-bottom"></div>
								<!-- // __snippet__.contentBottom -->
							</div>
							<div id="x-content-comment">
								    <h3>Comments</h3>

    <ul id="x-comment-list" class="uk-comment-list">
    </ul>

    <h3>Make a comment</h3>

    <div class="x-display-if-not-signin">
        <p><button type="button" class="uk-button" onclick="showSignin()"><i class="uk-icon-signin"></i> Sign in to make a comment</button></p>
    </div>

    <div id="x-comment-area"></div>

							</div>
						</div>
											
