<div class="uk-flex-item-1" style="padding-left:15px; ">
							<div id="x-content-top">
								<!-- __snippet__.contentTop -->
																<!-- // __snippet__.contentTop -->
							</div>
							<div id="x-content">
								    <h4>&#31614;&#21517;&#31639;&#27861;</h4>
    <div class="x-wiki-info">
    	<span>Reads: 14926</span>
    	<a href="/manage/wiki/wikipage_update?id=1304227943022626" target="_blank" class="x-can-edit uk-text-danger">Edit</a>
</div>

    <hr>

    <div class="x-wiki-content x-main-content">
<p>&#25105;&#20204;&#20351;&#29992;&#38750;&#23545;&#31216;&#21152;&#23494;&#31639;&#27861;&#30340;&#26102;&#20505;&#65292;&#23545;&#20110;&#19968;&#20010;&#20844;&#38053;-&#31169;&#38053;&#23545;&#65292;&#36890;&#24120;&#26159;&#29992;&#20844;&#38053;&#21152;&#23494;&#65292;&#31169;&#38053;&#35299;&#23494;&#12290;</p>
<p>&#22914;&#26524;&#20351;&#29992;&#31169;&#38053;&#21152;&#23494;&#65292;&#20844;&#38053;&#35299;&#23494;&#26159;&#21542;&#21487;&#34892;&#21602;&#65311;&#23454;&#38469;&#19978;&#26159;&#23436;&#20840;&#21487;&#34892;&#30340;&#12290;</p>
<p>&#19981;&#36807;&#25105;&#20204;&#20877;&#20180;&#32454;&#24819;&#19968;&#24819;&#65292;&#31169;&#38053;&#26159;&#20445;&#23494;&#30340;&#65292;&#32780;&#20844;&#38053;&#26159;&#20844;&#24320;&#30340;&#65292;&#29992;&#31169;&#38053;&#21152;&#23494;&#65292;&#37027;&#30456;&#24403;&#20110;&#25152;&#26377;&#20154;&#37117;&#21487;&#20197;&#29992;&#20844;&#38053;&#35299;&#23494;&#12290;&#36825;&#20010;&#21152;&#23494;&#26377;&#20160;&#20040;&#24847;&#20041;&#65311;</p>
<p>&#36825;&#20010;&#21152;&#23494;&#30340;&#24847;&#20041;&#22312;&#20110;&#65292;&#22914;&#26524;&#23567;&#26126;&#29992;&#33258;&#24049;&#30340;&#31169;&#38053;&#21152;&#23494;&#20102;&#19968;&#26465;&#28040;&#24687;&#65292;&#27604;&#22914;<code>&#23567;&#26126;&#21916;&#27426;&#23567;&#32418;</code>&#65292;&#28982;&#21518;&#20182;&#20844;&#24320;&#20102;&#21152;&#23494;&#28040;&#24687;&#65292;&#30001;&#20110;&#20219;&#20309;&#20154;&#37117;&#21487;&#20197;&#29992;&#23567;&#26126;&#30340;&#20844;&#38053;&#35299;&#23494;&#65292;&#20174;&#32780;&#20351;&#24471;&#20219;&#20309;&#20154;&#37117;&#21487;&#20197;&#30830;&#35748;<code>&#23567;&#26126;&#21916;&#27426;&#23567;&#32418;</code>&#36825;&#26465;&#28040;&#24687;&#32943;&#23450;&#26159;&#23567;&#26126;&#21457;&#20986;&#30340;&#65292;&#20854;&#20182;&#20154;&#19981;&#33021;&#20266;&#36896;&#36825;&#20010;&#28040;&#24687;&#65292;&#23567;&#26126;&#20063;&#19981;&#33021;&#25269;&#36182;&#36825;&#26465;&#28040;&#24687;&#19981;&#26159;&#33258;&#24049;&#20889;&#30340;&#12290;</p>
<p>&#22240;&#27492;&#65292;&#31169;&#38053;&#21152;&#23494;&#24471;&#21040;&#30340;&#23494;&#25991;&#23454;&#38469;&#19978;&#23601;&#26159;&#25968;&#23383;&#31614;&#21517;&#65292;&#35201;&#39564;&#35777;&#36825;&#20010;&#31614;&#21517;&#26159;&#21542;&#27491;&#30830;&#65292;&#21482;&#33021;&#29992;&#31169;&#38053;&#25345;&#26377;&#32773;&#30340;&#20844;&#38053;&#36827;&#34892;&#35299;&#23494;&#39564;&#35777;&#12290;&#20351;&#29992;&#25968;&#23383;&#31614;&#21517;&#30340;&#30446;&#30340;&#26159;&#20026;&#20102;&#30830;&#35748;&#26576;&#20010;&#20449;&#24687;&#30830;&#23454;&#26159;&#30001;&#26576;&#20010;&#21457;&#36865;&#26041;&#21457;&#36865;&#30340;&#65292;&#20219;&#20309;&#20154;&#37117;&#19981;&#21487;&#33021;&#20266;&#36896;&#28040;&#24687;&#65292;&#24182;&#19988;&#65292;&#21457;&#36865;&#26041;&#20063;&#19981;&#33021;&#25269;&#36182;&#12290;</p>
<p>&#22312;&#23454;&#38469;&#24212;&#29992;&#30340;&#26102;&#20505;&#65292;&#31614;&#21517;&#23454;&#38469;&#19978;&#24182;&#19981;&#26159;&#38024;&#23545;&#21407;&#22987;&#28040;&#24687;&#65292;&#32780;&#26159;&#38024;&#23545;&#21407;&#22987;&#28040;&#24687;&#30340;&#21704;&#24076;&#36827;&#34892;&#31614;&#21517;&#65292;&#21363;&#65306;</p>
<pre><code>signature = encrypt(privateKey, sha256(message))
</code></pre>
<p>&#23545;&#31614;&#21517;&#36827;&#34892;&#39564;&#35777;&#23454;&#38469;&#19978;&#23601;&#26159;&#29992;&#20844;&#38053;&#35299;&#23494;&#65306;</p>
<pre><code>hash = decrypt(publicKey, signature)
</code></pre>
<p>&#28982;&#21518;&#25226;&#35299;&#23494;&#21518;&#30340;&#21704;&#24076;&#19982;&#21407;&#22987;&#28040;&#24687;&#30340;&#21704;&#24076;&#36827;&#34892;&#23545;&#27604;&#12290;</p>
<p>&#22240;&#20026;&#29992;&#25143;&#24635;&#26159;&#20351;&#29992;&#33258;&#24049;&#30340;&#31169;&#38053;&#36827;&#34892;&#31614;&#21517;&#65292;&#25152;&#20197;&#65292;&#31169;&#38053;&#23601;&#30456;&#24403;&#20110;&#29992;&#25143;&#36523;&#20221;&#12290;&#32780;&#20844;&#38053;&#29992;&#26469;&#32473;&#22806;&#37096;&#39564;&#35777;&#29992;&#25143;&#36523;&#20221;&#12290;</p>
<p>&#24120;&#29992;&#25968;&#23383;&#31614;&#21517;&#31639;&#27861;&#26377;&#65306;</p>
<ul>
<li>MD5withRSA</li>
<li>SHA1withRSA</li>
<li>SHA256withRSA</li>
</ul>
<p>&#23427;&#20204;&#23454;&#38469;&#19978;&#23601;&#26159;&#25351;&#23450;&#26576;&#31181;&#21704;&#24076;&#31639;&#27861;&#36827;&#34892;RSA&#31614;&#21517;&#30340;&#26041;&#24335;&#12290;</p>
<pre><code class="language-x-java">import java.math.BigInteger;
import java.nio.charset.StandardCharsets;
import java.security.*;
----
public class Main {
    public static void main(String[] args) throws GeneralSecurityException {
        // &#29983;&#25104;RSA&#20844;&#38053;/&#31169;&#38053;:
        KeyPairGenerator kpGen = KeyPairGenerator.getInstance("RSA");
        kpGen.initialize(1024);
        KeyPair kp = kpGen.generateKeyPair();
        PrivateKey sk = kp.getPrivate();
        PublicKey pk = kp.getPublic();

        // &#24453;&#31614;&#21517;&#30340;&#28040;&#24687;:
        byte[] message = "Hello, I am Bob!".getBytes(StandardCharsets.UTF_8);

        // &#29992;&#31169;&#38053;&#31614;&#21517;:
        Signature s = Signature.getInstance("SHA1withRSA");
        s.initSign(sk);
        s.update(message);
        byte[] signed = s.sign();
        System.out.println(String.format("signature: %x", new BigInteger(1, signed)));

        // &#29992;&#20844;&#38053;&#39564;&#35777;:
        Signature v = Signature.getInstance("SHA1withRSA");
        v.initVerify(pk);
        v.update(message);
        boolean valid = v.verify(signed);
        System.out.println("valid? " + valid);
    }
}
</code></pre>
<p>&#20351;&#29992;&#20854;&#20182;&#20844;&#38053;&#65292;&#25110;&#32773;&#39564;&#35777;&#31614;&#21517;&#30340;&#26102;&#20505;&#20462;&#25913;&#21407;&#22987;&#20449;&#24687;&#65292;&#37117;&#26080;&#27861;&#39564;&#35777;&#25104;&#21151;&#12290;</p>
<h3>DSA&#31614;&#21517;</h3>
<p>&#38500;&#20102;RSA&#21487;&#20197;&#31614;&#21517;&#22806;&#65292;&#36824;&#21487;&#20197;&#20351;&#29992;DSA&#31639;&#27861;&#36827;&#34892;&#31614;&#21517;&#12290;DSA&#26159;Digital Signature Algorithm&#30340;&#32553;&#20889;&#65292;&#23427;&#20351;&#29992;ElGamal&#25968;&#23383;&#31614;&#21517;&#31639;&#27861;&#12290;</p>
<p>DSA&#21482;&#33021;&#37197;&#21512;SHA&#20351;&#29992;&#65292;&#24120;&#29992;&#30340;&#31639;&#27861;&#26377;&#65306;</p>
<ul>
<li>SHA1withDSA</li>
<li>SHA256withDSA</li>
<li>SHA512withDSA</li>
</ul>
<p>&#21644;RSA&#25968;&#23383;&#31614;&#21517;&#30456;&#27604;&#65292;DSA&#30340;&#20248;&#28857;&#26159;&#26356;&#24555;&#12290;</p>
<h3>ECDSA&#31614;&#21517;</h3>
<p>&#26925;&#22278;&#26354;&#32447;&#31614;&#21517;&#31639;&#27861;ECDSA&#65306;Elliptic Curve Digital Signature Algorithm&#20063;&#26159;&#19968;&#31181;&#24120;&#29992;&#30340;&#31614;&#21517;&#31639;&#27861;&#65292;&#23427;&#30340;&#29305;&#28857;&#26159;&#21487;&#20197;&#20174;&#31169;&#38053;&#25512;&#20986;&#20844;&#38053;&#12290;&#27604;&#29305;&#24065;&#30340;&#31614;&#21517;&#31639;&#27861;&#23601;&#37319;&#29992;&#20102;ECDSA&#31639;&#27861;&#65292;&#20351;&#29992;&#26631;&#20934;&#26925;&#22278;&#26354;&#32447;secp256k1&#12290;BouncyCastle&#25552;&#20379;&#20102;ECDSA&#30340;&#23436;&#25972;&#23454;&#29616;&#12290;</p>
<h3>&#32451;&#20064;</h3>
<p><a href="https://gitee.com/liaoxuefeng/learn-java/raw/master/practices/Java%E6%95%99%E7%A8%8B/120.%E5%8A%A0%E5%AF%86%E4%B8%8E%E5%AE%89%E5%85%A8.1255943717668160/90.%E7%AD%BE%E5%90%8D%E7%AE%97%E6%B3%95.1304227943022626/encrypt-rsasign.zip">&#31614;&#21517;&#31639;&#27861;&#32451;&#20064;</a></p>
<h3>&#23567;&#32467;</h3>
<p>&#25968;&#23383;&#31614;&#21517;&#23601;&#26159;&#29992;&#21457;&#36865;&#26041;&#30340;&#31169;&#38053;&#23545;&#21407;&#22987;&#25968;&#25454;&#36827;&#34892;&#31614;&#21517;&#65292;&#21482;&#26377;&#29992;&#21457;&#36865;&#26041;&#20844;&#38053;&#25165;&#33021;&#36890;&#36807;&#31614;&#21517;&#39564;&#35777;&#12290;</p>
<p>&#25968;&#23383;&#31614;&#21517;&#29992;&#20110;&#65306;</p>
<ul>
<li>&#38450;&#27490;&#20266;&#36896;&#65307;</li>
<li>&#38450;&#27490;&#25269;&#36182;&#65307;</li>
<li>&#26816;&#27979;&#31713;&#25913;&#12290;</li>
</ul>
<p>&#24120;&#29992;&#30340;&#25968;&#23383;&#31614;&#21517;&#31639;&#27861;&#21253;&#25324;&#65306;MD5withRSA&#65295;SHA1withRSA&#65295;SHA256withRSA&#65295;SHA1withDSA&#65295;SHA256withDSA&#65295;SHA512withDSA&#65295;ECDSA&#31561;&#12290;</p>
</div>

    <hr>

    <div class="x-wiki-prev-next uk-clearfix"></div>

    <div class="x-anchor x-comment-anchor"><a name="comments"></a></div>
							</div>
							<div id="x-content-bottom">
								<!-- __snippet__.contentBottom -->
								<div id="sponsor-a" class="uk-margin-bottom"></div>
								<!-- // __snippet__.contentBottom -->
							</div>
							<div id="x-content-comment">
								    <h3>Comments</h3>

    <ul id="x-comment-list" class="uk-comment-list">
    </ul>

    <h3>Make a comment</h3>

    <div class="x-display-if-not-signin">
        <p><button type="button" class="uk-button" onclick="showSignin()"><i class="uk-icon-signin"></i> Sign in to make a comment</button></p>
    </div>

    <div id="x-comment-area"></div>

							</div>
						</div>
											
