<div class="uk-flex-item-1" style="padding-left:15px; ">
							<div id="x-content-top">
								<!-- __snippet__.contentTop -->
																<!-- // __snippet__.contentTop -->
							</div>
							<div id="x-content">
								    <h4>&#22810;&#32447;&#31243;&#22522;&#30784;</h4>
    <div class="x-wiki-info">
    	<span>Reads: 189307</span>
    	<a href="/manage/wiki/wikipage_update?id=1304521607217185" target="_blank" class="x-can-edit uk-text-danger">Edit</a>
</div>

    <hr>

    <div class="x-wiki-content x-main-content">
<p>&#29616;&#20195;&#25805;&#20316;&#31995;&#32479;&#65288;Windows&#65292;macOS&#65292;Linux&#65289;&#37117;&#21487;&#20197;&#25191;&#34892;&#22810;&#20219;&#21153;&#12290;&#22810;&#20219;&#21153;&#23601;&#26159;&#21516;&#26102;&#36816;&#34892;&#22810;&#20010;&#20219;&#21153;&#65292;&#20363;&#22914;&#65306;</p>
<p><span style="font-size:2em"><i class="uk-icon-internet-explorer"></i> <i class="uk-icon-qq"></i> <i class="uk-icon-music"></i></span></p>
<p>CPU&#25191;&#34892;&#20195;&#30721;&#37117;&#26159;&#19968;&#26465;&#19968;&#26465;&#39034;&#24207;&#25191;&#34892;&#30340;&#65292;&#20294;&#26159;&#65292;&#21363;&#20351;&#26159;&#21333;&#26680;cpu&#65292;&#20063;&#21487;&#20197;&#21516;&#26102;&#36816;&#34892;&#22810;&#20010;&#20219;&#21153;&#12290;&#22240;&#20026;&#25805;&#20316;&#31995;&#32479;&#25191;&#34892;&#22810;&#20219;&#21153;&#23454;&#38469;&#19978;&#23601;&#26159;&#35753;CPU&#23545;&#22810;&#20010;&#20219;&#21153;&#36718;&#27969;&#20132;&#26367;&#25191;&#34892;&#12290;</p>
<p>&#20363;&#22914;&#65292;&#20551;&#35774;&#25105;&#20204;&#26377;&#35821;&#25991;&#12289;&#25968;&#23398;&#12289;&#33521;&#35821;3&#38376;&#20316;&#19994;&#35201;&#20570;&#65292;&#27599;&#20010;&#20316;&#19994;&#38656;&#35201;30&#20998;&#38047;&#12290;&#25105;&#20204;&#25226;&#36825;3&#38376;&#20316;&#19994;&#30475;&#25104;&#26159;3&#20010;&#20219;&#21153;&#65292;&#21487;&#20197;&#20570;1&#20998;&#38047;&#35821;&#25991;&#20316;&#19994;&#65292;&#20877;&#20570;1&#20998;&#38047;&#25968;&#23398;&#20316;&#19994;&#65292;&#20877;&#20570;1&#20998;&#38047;&#33521;&#35821;&#20316;&#19994;&#65306;</p>
<p><img src="/static/img/loading.svg" data-src="/files/attachments/1305615538323521/m" alt="fast"></p>
<p>&#36825;&#26679;&#36718;&#27969;&#20570;&#19979;&#21435;&#65292;&#22312;&#26576;&#20123;&#20154;&#30524;&#37324;&#30475;&#26469;&#65292;&#20570;&#20316;&#19994;&#30340;&#36895;&#24230;&#23601;&#38750;&#24120;&#24555;&#65292;&#30475;&#19978;&#21435;&#23601;&#20687;&#21516;&#26102;&#22312;&#20570;3&#38376;&#20316;&#19994;&#19968;&#26679;</p>
<p><img src="/static/img/loading.svg" data-src="/files/attachments/1305615165030466/l" alt="ooops"></p>
<p>&#31867;&#20284;&#30340;&#65292;&#25805;&#20316;&#31995;&#32479;&#36718;&#27969;&#35753;&#22810;&#20010;&#20219;&#21153;&#20132;&#26367;&#25191;&#34892;&#65292;&#20363;&#22914;&#65292;&#35753;&#27983;&#35272;&#22120;&#25191;&#34892;0.001&#31186;&#65292;&#35753;QQ&#25191;&#34892;0.001&#31186;&#65292;&#20877;&#35753;&#38899;&#20048;&#25773;&#25918;&#22120;&#25191;&#34892;0.001&#31186;&#65292;&#22312;&#20154;&#30475;&#26469;&#65292;CPU&#23601;&#26159;&#22312;&#21516;&#26102;&#25191;&#34892;&#22810;&#20010;&#20219;&#21153;&#12290;</p>
<p>&#21363;&#20351;&#26159;&#22810;&#26680;CPU&#65292;&#22240;&#20026;&#36890;&#24120;&#20219;&#21153;&#30340;&#25968;&#37327;&#36828;&#36828;&#22810;&#20110;CPU&#30340;&#26680;&#25968;&#65292;&#25152;&#20197;&#20219;&#21153;&#20063;&#26159;&#20132;&#26367;&#25191;&#34892;&#30340;&#12290;</p>
<h3>&#36827;&#31243;</h3>
<p>&#22312;&#35745;&#31639;&#26426;&#20013;&#65292;&#25105;&#20204;&#25226;&#19968;&#20010;&#20219;&#21153;&#31216;&#20026;&#19968;&#20010;&#36827;&#31243;&#65292;&#27983;&#35272;&#22120;&#23601;&#26159;&#19968;&#20010;&#36827;&#31243;&#65292;&#35270;&#39057;&#25773;&#25918;&#22120;&#26159;&#21478;&#19968;&#20010;&#36827;&#31243;&#65292;&#31867;&#20284;&#30340;&#65292;&#38899;&#20048;&#25773;&#25918;&#22120;&#21644;Word&#37117;&#26159;&#36827;&#31243;&#12290;</p>
<p>&#26576;&#20123;&#36827;&#31243;&#20869;&#37096;&#36824;&#38656;&#35201;&#21516;&#26102;&#25191;&#34892;&#22810;&#20010;&#23376;&#20219;&#21153;&#12290;&#20363;&#22914;&#65292;&#25105;&#20204;&#22312;&#20351;&#29992;Word&#26102;&#65292;Word&#21487;&#20197;&#35753;&#25105;&#20204;&#19968;&#36793;&#25171;&#23383;&#65292;&#19968;&#36793;&#36827;&#34892;&#25340;&#20889;&#26816;&#26597;&#65292;&#21516;&#26102;&#36824;&#21487;&#20197;&#22312;&#21518;&#21488;&#36827;&#34892;&#25171;&#21360;&#65292;&#25105;&#20204;&#25226;&#23376;&#20219;&#21153;&#31216;&#20026;&#32447;&#31243;&#12290;</p>
<p>&#36827;&#31243;&#21644;&#32447;&#31243;&#30340;&#20851;&#31995;&#23601;&#26159;&#65306;&#19968;&#20010;&#36827;&#31243;&#21487;&#20197;&#21253;&#21547;&#19968;&#20010;&#25110;&#22810;&#20010;&#32447;&#31243;&#65292;&#20294;&#33267;&#23569;&#20250;&#26377;&#19968;&#20010;&#32447;&#31243;&#12290;</p>
<pre><code class="language-ascii">                        &#9484;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9488;
                        &#9474;Process   &#9474;
                        &#9474;&#9484;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9488;&#9474;
            &#9484;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9488;&#9474;&#9474; Thread &#9474;&#9474;&#9484;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9488;
            &#9474;Process   &#9474;&#9474;&#9492;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9496;&#9474;&#9474;Process   &#9474;
            &#9474;&#9484;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9488;&#9474;&#9474;&#9484;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9488;&#9474;&#9474;&#9484;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9488;&#9474;
&#9484;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9488;&#9474;&#9474; Thread &#9474;&#9474;&#9474;&#9474; Thread &#9474;&#9474;&#9474;&#9474; Thread &#9474;&#9474;
&#9474;Process   &#9474;&#9474;&#9492;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9496;&#9474;&#9474;&#9492;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9496;&#9474;&#9474;&#9492;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9496;&#9474;
&#9474;&#9484;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9488;&#9474;&#9474;&#9484;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9488;&#9474;&#9474;&#9484;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9488;&#9474;&#9474;&#9484;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9488;&#9474;
&#9474;&#9474; Thread &#9474;&#9474;&#9474;&#9474; Thread &#9474;&#9474;&#9474;&#9474; Thread &#9474;&#9474;&#9474;&#9474; Thread &#9474;&#9474;
&#9474;&#9492;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9496;&#9474;&#9474;&#9492;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9496;&#9474;&#9474;&#9492;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9496;&#9474;&#9474;&#9492;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9496;&#9474;
&#9492;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9496;&#9492;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9496;&#9492;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9496;&#9492;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9496;
&#9484;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9488;
&#9474;               Operating System               &#9474;
&#9492;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9496;
</code></pre>
<p>&#25805;&#20316;&#31995;&#32479;&#35843;&#24230;&#30340;&#26368;&#23567;&#20219;&#21153;&#21333;&#20301;&#20854;&#23454;&#19981;&#26159;&#36827;&#31243;&#65292;&#32780;&#26159;&#32447;&#31243;&#12290;&#24120;&#29992;&#30340;Windows&#12289;Linux&#31561;&#25805;&#20316;&#31995;&#32479;&#37117;&#37319;&#29992;&#25250;&#21344;&#24335;&#22810;&#20219;&#21153;&#65292;&#22914;&#20309;&#35843;&#24230;&#32447;&#31243;&#23436;&#20840;&#30001;&#25805;&#20316;&#31995;&#32479;&#20915;&#23450;&#65292;&#31243;&#24207;&#33258;&#24049;&#19981;&#33021;&#20915;&#23450;&#20160;&#20040;&#26102;&#20505;&#25191;&#34892;&#65292;&#20197;&#21450;&#25191;&#34892;&#22810;&#38271;&#26102;&#38388;&#12290;</p>
<p>&#22240;&#20026;&#21516;&#19968;&#20010;&#24212;&#29992;&#31243;&#24207;&#65292;&#26082;&#21487;&#20197;&#26377;&#22810;&#20010;&#36827;&#31243;&#65292;&#20063;&#21487;&#20197;&#26377;&#22810;&#20010;&#32447;&#31243;&#65292;&#22240;&#27492;&#65292;&#23454;&#29616;&#22810;&#20219;&#21153;&#30340;&#26041;&#27861;&#65292;&#26377;&#20197;&#19979;&#20960;&#31181;&#65306;</p>
<p>&#22810;&#36827;&#31243;&#27169;&#24335;&#65288;&#27599;&#20010;&#36827;&#31243;&#21482;&#26377;&#19968;&#20010;&#32447;&#31243;&#65289;&#65306;</p>
<pre><code class="language-ascii">&#9484;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9488; &#9484;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9488; &#9484;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9488;
&#9474;Process   &#9474; &#9474;Process   &#9474; &#9474;Process   &#9474;
&#9474;&#9484;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9488;&#9474; &#9474;&#9484;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9488;&#9474; &#9474;&#9484;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9488;&#9474;
&#9474;&#9474; Thread &#9474;&#9474; &#9474;&#9474; Thread &#9474;&#9474; &#9474;&#9474; Thread &#9474;&#9474;
&#9474;&#9492;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9496;&#9474; &#9474;&#9492;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9496;&#9474; &#9474;&#9492;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9496;&#9474;
&#9492;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9496; &#9492;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9496; &#9492;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9496;
</code></pre>
<p>&#22810;&#32447;&#31243;&#27169;&#24335;&#65288;&#19968;&#20010;&#36827;&#31243;&#26377;&#22810;&#20010;&#32447;&#31243;&#65289;&#65306;</p>
<pre><code class="language-ascii">&#9484;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9488;
&#9474;Process             &#9474;
&#9474;&#9484;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9488;&#9484;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9488;&#9474;
&#9474;&#9474; Thread &#9474;&#9474; Thread &#9474;&#9474;
&#9474;&#9492;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9496;&#9492;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9496;&#9474;
&#9474;&#9484;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9488;&#9484;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9488;&#9474;
&#9474;&#9474; Thread &#9474;&#9474; Thread &#9474;&#9474;
&#9474;&#9492;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9496;&#9492;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9496;&#9474;
&#9492;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9496;
</code></pre>
<p>&#22810;&#36827;&#31243;&#65291;&#22810;&#32447;&#31243;&#27169;&#24335;&#65288;&#22797;&#26434;&#24230;&#26368;&#39640;&#65289;&#65306;</p>
<pre><code class="language-ascii">&#9484;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9488;&#9484;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9488;&#9484;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9488;
&#9474;Process   &#9474;&#9474;Process   &#9474;&#9474;Process   &#9474;
&#9474;&#9484;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9488;&#9474;&#9474;&#9484;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9488;&#9474;&#9474;&#9484;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9488;&#9474;
&#9474;&#9474; Thread &#9474;&#9474;&#9474;&#9474; Thread &#9474;&#9474;&#9474;&#9474; Thread &#9474;&#9474;
&#9474;&#9492;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9496;&#9474;&#9474;&#9492;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9496;&#9474;&#9474;&#9492;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9496;&#9474;
&#9474;&#9484;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9488;&#9474;&#9474;&#9484;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9488;&#9474;&#9474;&#9484;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9488;&#9474;
&#9474;&#9474; Thread &#9474;&#9474;&#9474;&#9474; Thread &#9474;&#9474;&#9474;&#9474; Thread &#9474;&#9474;
&#9474;&#9492;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9496;&#9474;&#9474;&#9492;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9496;&#9474;&#9474;&#9492;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9496;&#9474;
&#9492;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9496;&#9492;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9496;&#9492;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9496;
</code></pre>
<h3>&#36827;&#31243; vs &#32447;&#31243;</h3>
<p>&#36827;&#31243;&#21644;&#32447;&#31243;&#26159;&#21253;&#21547;&#20851;&#31995;&#65292;&#20294;&#26159;&#22810;&#20219;&#21153;&#26082;&#21487;&#20197;&#30001;&#22810;&#36827;&#31243;&#23454;&#29616;&#65292;&#20063;&#21487;&#20197;&#30001;&#21333;&#36827;&#31243;&#20869;&#30340;&#22810;&#32447;&#31243;&#23454;&#29616;&#65292;&#36824;&#21487;&#20197;&#28151;&#21512;&#22810;&#36827;&#31243;&#65291;&#22810;&#32447;&#31243;&#12290;</p>
<p>&#20855;&#20307;&#37319;&#29992;&#21738;&#31181;&#26041;&#24335;&#65292;&#35201;&#32771;&#34385;&#21040;&#36827;&#31243;&#21644;&#32447;&#31243;&#30340;&#29305;&#28857;&#12290;</p>
<p>&#21644;&#22810;&#32447;&#31243;&#30456;&#27604;&#65292;&#22810;&#36827;&#31243;&#30340;&#32570;&#28857;&#22312;&#20110;&#65306;</p>
<ul>
<li>&#21019;&#24314;&#36827;&#31243;&#27604;&#21019;&#24314;&#32447;&#31243;&#24320;&#38144;&#22823;&#65292;&#23588;&#20854;&#26159;&#22312;Windows&#31995;&#32479;&#19978;&#65307;</li>
<li>&#36827;&#31243;&#38388;&#36890;&#20449;&#27604;&#32447;&#31243;&#38388;&#36890;&#20449;&#35201;&#24930;&#65292;&#22240;&#20026;&#32447;&#31243;&#38388;&#36890;&#20449;&#23601;&#26159;&#35835;&#20889;&#21516;&#19968;&#20010;&#21464;&#37327;&#65292;&#36895;&#24230;&#24456;&#24555;&#12290;</li>
</ul>
<p>&#32780;&#22810;&#36827;&#31243;&#30340;&#20248;&#28857;&#22312;&#20110;&#65306;</p>
<p>&#22810;&#36827;&#31243;&#31283;&#23450;&#24615;&#27604;&#22810;&#32447;&#31243;&#39640;&#65292;&#22240;&#20026;&#22312;&#22810;&#36827;&#31243;&#30340;&#24773;&#20917;&#19979;&#65292;&#19968;&#20010;&#36827;&#31243;&#23849;&#28291;&#19981;&#20250;&#24433;&#21709;&#20854;&#20182;&#36827;&#31243;&#65292;&#32780;&#22312;&#22810;&#32447;&#31243;&#30340;&#24773;&#20917;&#19979;&#65292;&#20219;&#20309;&#19968;&#20010;&#32447;&#31243;&#23849;&#28291;&#20250;&#30452;&#25509;&#23548;&#33268;&#25972;&#20010;&#36827;&#31243;&#23849;&#28291;&#12290;</p>
<h3>&#22810;&#32447;&#31243;</h3>
<p>Java&#35821;&#35328;&#20869;&#32622;&#20102;&#22810;&#32447;&#31243;&#25903;&#25345;&#65306;&#19968;&#20010;Java&#31243;&#24207;&#23454;&#38469;&#19978;&#26159;&#19968;&#20010;JVM&#36827;&#31243;&#65292;JVM&#36827;&#31243;&#29992;&#19968;&#20010;&#20027;&#32447;&#31243;&#26469;&#25191;&#34892;<code>main()</code>&#26041;&#27861;&#65292;&#22312;<code>main()</code>&#26041;&#27861;&#20869;&#37096;&#65292;&#25105;&#20204;&#21448;&#21487;&#20197;&#21551;&#21160;&#22810;&#20010;&#32447;&#31243;&#12290;&#27492;&#22806;&#65292;JVM&#36824;&#26377;&#36127;&#36131;&#22403;&#22334;&#22238;&#25910;&#30340;&#20854;&#20182;&#24037;&#20316;&#32447;&#31243;&#31561;&#12290;</p>
<p>&#22240;&#27492;&#65292;&#23545;&#20110;&#22823;&#22810;&#25968;Java&#31243;&#24207;&#26469;&#35828;&#65292;&#25105;&#20204;&#35828;&#22810;&#20219;&#21153;&#65292;&#23454;&#38469;&#19978;&#26159;&#35828;&#22914;&#20309;&#20351;&#29992;&#22810;&#32447;&#31243;&#23454;&#29616;&#22810;&#20219;&#21153;&#12290;</p>
<p>&#21644;&#21333;&#32447;&#31243;&#30456;&#27604;&#65292;&#22810;&#32447;&#31243;&#32534;&#31243;&#30340;&#29305;&#28857;&#22312;&#20110;&#65306;&#22810;&#32447;&#31243;&#32463;&#24120;&#38656;&#35201;&#35835;&#20889;&#20849;&#20139;&#25968;&#25454;&#65292;&#24182;&#19988;&#38656;&#35201;&#21516;&#27493;&#12290;&#20363;&#22914;&#65292;&#25773;&#25918;&#30005;&#24433;&#26102;&#65292;&#23601;&#24517;&#39035;&#30001;&#19968;&#20010;&#32447;&#31243;&#25773;&#25918;&#35270;&#39057;&#65292;&#21478;&#19968;&#20010;&#32447;&#31243;&#25773;&#25918;&#38899;&#39057;&#65292;&#20004;&#20010;&#32447;&#31243;&#38656;&#35201;&#21327;&#35843;&#36816;&#34892;&#65292;&#21542;&#21017;&#30011;&#38754;&#21644;&#22768;&#38899;&#23601;&#19981;&#21516;&#27493;&#12290;&#22240;&#27492;&#65292;&#22810;&#32447;&#31243;&#32534;&#31243;&#30340;&#22797;&#26434;&#24230;&#39640;&#65292;&#35843;&#35797;&#26356;&#22256;&#38590;&#12290;</p>
<p>Java&#22810;&#32447;&#31243;&#32534;&#31243;&#30340;&#29305;&#28857;&#21448;&#22312;&#20110;&#65306;</p>
<ul>
<li>&#22810;&#32447;&#31243;&#27169;&#22411;&#26159;Java&#31243;&#24207;&#26368;&#22522;&#26412;&#30340;&#24182;&#21457;&#27169;&#22411;&#65307;</li>
<li>&#21518;&#32493;&#35835;&#20889;&#32593;&#32476;&#12289;&#25968;&#25454;&#24211;&#12289;Web&#24320;&#21457;&#31561;&#37117;&#20381;&#36182;Java&#22810;&#32447;&#31243;&#27169;&#22411;&#12290;</li>
</ul>
<p>&#22240;&#27492;&#65292;&#24517;&#39035;&#25484;&#25569;Java&#22810;&#32447;&#31243;&#32534;&#31243;&#25165;&#33021;&#32487;&#32493;&#28145;&#20837;&#23398;&#20064;&#20854;&#20182;&#20869;&#23481;&#12290;</p>
</div>

    <hr>

    <div class="x-wiki-prev-next uk-clearfix"></div>

    <div class="x-anchor x-comment-anchor"><a name="comments"></a></div>
							</div>
							<div id="x-content-bottom">
								<!-- __snippet__.contentBottom -->
								<div id="sponsor-a" class="uk-margin-bottom"></div>
								<!-- // __snippet__.contentBottom -->
							</div>
							<div id="x-content-comment">
								    <h3>Comments</h3>

    <ul id="x-comment-list" class="uk-comment-list">
    </ul>

    <h3>Make a comment</h3>

    <div class="x-display-if-not-signin">
        <p><button type="button" class="uk-button" onclick="showSignin()"><i class="uk-icon-signin"></i> Sign in to make a comment</button></p>
    </div>

    <div id="x-comment-area"></div>

							</div>
						</div>
											
