<div class="uk-flex-item-1" style="padding-left:15px; ">
							<div id="x-content-top">
								<!-- __snippet__.contentTop -->
																<!-- // __snippet__.contentTop -->
							</div>
							<div id="x-content">
								    <h4>&#20351;&#29992;StampedLock</h4>
    <div class="x-wiki-info">
    	<span>Reads: 14545</span>
    	<a href="/manage/wiki/wikipage_update?id=1309138673991714" target="_blank" class="x-can-edit uk-text-danger">Edit</a>
</div>

    <hr>

    <div class="x-wiki-content x-main-content">
<p>&#21069;&#38754;&#20171;&#32461;&#30340;<code>ReadWriteLock</code>&#21487;&#20197;&#35299;&#20915;&#22810;&#32447;&#31243;&#21516;&#26102;&#35835;&#65292;&#20294;&#21482;&#26377;&#19968;&#20010;&#32447;&#31243;&#33021;&#20889;&#30340;&#38382;&#39064;&#12290;</p>
<p>&#22914;&#26524;&#25105;&#20204;&#28145;&#20837;&#20998;&#26512;<code>ReadWriteLock</code>&#65292;&#20250;&#21457;&#29616;&#23427;&#26377;&#20010;&#28508;&#22312;&#30340;&#38382;&#39064;&#65306;&#22914;&#26524;&#26377;&#32447;&#31243;&#27491;&#22312;&#35835;&#65292;&#20889;&#32447;&#31243;&#38656;&#35201;&#31561;&#24453;&#35835;&#32447;&#31243;&#37322;&#25918;&#38145;&#21518;&#25165;&#33021;&#33719;&#21462;&#20889;&#38145;&#65292;&#21363;&#35835;&#30340;&#36807;&#31243;&#20013;&#19981;&#20801;&#35768;&#20889;&#65292;&#36825;&#26159;&#19968;&#31181;&#24754;&#35266;&#30340;&#35835;&#38145;&#12290;</p>
<p>&#35201;&#36827;&#19968;&#27493;&#25552;&#21319;&#24182;&#21457;&#25191;&#34892;&#25928;&#29575;&#65292;Java 8&#24341;&#20837;&#20102;&#26032;&#30340;&#35835;&#20889;&#38145;&#65306;<code>StampedLock</code>&#12290;</p>
<p><code>StampedLock</code>&#21644;<code>ReadWriteLock</code>&#30456;&#27604;&#65292;&#25913;&#36827;&#20043;&#22788;&#22312;&#20110;&#65306;&#35835;&#30340;&#36807;&#31243;&#20013;&#20063;&#20801;&#35768;&#33719;&#21462;&#20889;&#38145;&#21518;&#20889;&#20837;&#65281;&#36825;&#26679;&#19968;&#26469;&#65292;&#25105;&#20204;&#35835;&#30340;&#25968;&#25454;&#23601;&#21487;&#33021;&#19981;&#19968;&#33268;&#65292;&#25152;&#20197;&#65292;&#38656;&#35201;&#19968;&#28857;&#39069;&#22806;&#30340;&#20195;&#30721;&#26469;&#21028;&#26029;&#35835;&#30340;&#36807;&#31243;&#20013;&#26159;&#21542;&#26377;&#20889;&#20837;&#65292;&#36825;&#31181;&#35835;&#38145;&#26159;&#19968;&#31181;&#20048;&#35266;&#38145;&#12290;</p>
<p>&#20048;&#35266;&#38145;&#30340;&#24847;&#24605;&#23601;&#26159;&#20048;&#35266;&#22320;&#20272;&#35745;&#35835;&#30340;&#36807;&#31243;&#20013;&#22823;&#27010;&#29575;&#19981;&#20250;&#26377;&#20889;&#20837;&#65292;&#22240;&#27492;&#34987;&#31216;&#20026;&#20048;&#35266;&#38145;&#12290;&#21453;&#36807;&#26469;&#65292;&#24754;&#35266;&#38145;&#21017;&#26159;&#35835;&#30340;&#36807;&#31243;&#20013;&#25298;&#32477;&#26377;&#20889;&#20837;&#65292;&#20063;&#23601;&#26159;&#20889;&#20837;&#24517;&#39035;&#31561;&#24453;&#12290;&#26174;&#28982;&#20048;&#35266;&#38145;&#30340;&#24182;&#21457;&#25928;&#29575;&#26356;&#39640;&#65292;&#20294;&#19968;&#26086;&#26377;&#23567;&#27010;&#29575;&#30340;&#20889;&#20837;&#23548;&#33268;&#35835;&#21462;&#30340;&#25968;&#25454;&#19981;&#19968;&#33268;&#65292;&#38656;&#35201;&#33021;&#26816;&#27979;&#20986;&#26469;&#65292;&#20877;&#35835;&#19968;&#36941;&#23601;&#34892;&#12290;</p>
<p>&#25105;&#20204;&#26469;&#30475;&#20363;&#23376;&#65306;</p>
<pre><code>public class Point {
    private final StampedLock stampedLock = new StampedLock();

    private double x;
    private double y;

    public void move(double deltaX, double deltaY) {
        long stamp = stampedLock.writeLock(); // &#33719;&#21462;&#20889;&#38145;
        try {
            x += deltaX;
            y += deltaY;
        } finally {
            stampedLock.unlockWrite(stamp); // &#37322;&#25918;&#20889;&#38145;
        }
    }

    public double distanceFromOrigin() {
        long stamp = stampedLock.tryOptimisticRead(); // &#33719;&#24471;&#19968;&#20010;&#20048;&#35266;&#35835;&#38145;
        // &#27880;&#24847;&#19979;&#38754;&#20004;&#34892;&#20195;&#30721;&#19981;&#26159;&#21407;&#23376;&#25805;&#20316;
        // &#20551;&#35774;x,y = (100,200)
        double currentX = x;
        // &#27492;&#22788;&#24050;&#35835;&#21462;&#21040;x=100&#65292;&#20294;x,y&#21487;&#33021;&#34987;&#20889;&#32447;&#31243;&#20462;&#25913;&#20026;(300,400)
        double currentY = y;
        // &#27492;&#22788;&#24050;&#35835;&#21462;&#21040;y&#65292;&#22914;&#26524;&#27809;&#26377;&#20889;&#20837;&#65292;&#35835;&#21462;&#26159;&#27491;&#30830;&#30340;(100,200)
        // &#22914;&#26524;&#26377;&#20889;&#20837;&#65292;&#35835;&#21462;&#26159;&#38169;&#35823;&#30340;(100,400)
        if (!stampedLock.validate(stamp)) { // &#26816;&#26597;&#20048;&#35266;&#35835;&#38145;&#21518;&#26159;&#21542;&#26377;&#20854;&#20182;&#20889;&#38145;&#21457;&#29983;
            stamp = stampedLock.readLock(); // &#33719;&#21462;&#19968;&#20010;&#24754;&#35266;&#35835;&#38145;
            try {
                currentX = x;
                currentY = y;
            } finally {
                stampedLock.unlockRead(stamp); // &#37322;&#25918;&#24754;&#35266;&#35835;&#38145;
            }
        }
        return Math.sqrt(currentX * currentX + currentY * currentY);
    }
}
</code></pre>
<p>&#21644;<code>ReadWriteLock</code>&#30456;&#27604;&#65292;&#20889;&#20837;&#30340;&#21152;&#38145;&#26159;&#23436;&#20840;&#19968;&#26679;&#30340;&#65292;&#19981;&#21516;&#30340;&#26159;&#35835;&#21462;&#12290;&#27880;&#24847;&#21040;&#39318;&#20808;&#25105;&#20204;&#36890;&#36807;<code>tryOptimisticRead()</code>&#33719;&#21462;&#19968;&#20010;&#20048;&#35266;&#35835;&#38145;&#65292;&#24182;&#36820;&#22238;&#29256;&#26412;&#21495;&#12290;&#25509;&#30528;&#36827;&#34892;&#35835;&#21462;&#65292;&#35835;&#21462;&#23436;&#25104;&#21518;&#65292;&#25105;&#20204;&#36890;&#36807;<code>validate()</code>&#21435;&#39564;&#35777;&#29256;&#26412;&#21495;&#65292;&#22914;&#26524;&#22312;&#35835;&#21462;&#36807;&#31243;&#20013;&#27809;&#26377;&#20889;&#20837;&#65292;&#29256;&#26412;&#21495;&#19981;&#21464;&#65292;&#39564;&#35777;&#25104;&#21151;&#65292;&#25105;&#20204;&#23601;&#21487;&#20197;&#25918;&#24515;&#22320;&#32487;&#32493;&#21518;&#32493;&#25805;&#20316;&#12290;&#22914;&#26524;&#22312;&#35835;&#21462;&#36807;&#31243;&#20013;&#26377;&#20889;&#20837;&#65292;&#29256;&#26412;&#21495;&#20250;&#21457;&#29983;&#21464;&#21270;&#65292;&#39564;&#35777;&#23558;&#22833;&#36133;&#12290;&#22312;&#22833;&#36133;&#30340;&#26102;&#20505;&#65292;&#25105;&#20204;&#20877;&#36890;&#36807;&#33719;&#21462;&#24754;&#35266;&#35835;&#38145;&#20877;&#27425;&#35835;&#21462;&#12290;&#30001;&#20110;&#20889;&#20837;&#30340;&#27010;&#29575;&#19981;&#39640;&#65292;&#31243;&#24207;&#22312;&#32477;&#22823;&#37096;&#20998;&#24773;&#20917;&#19979;&#21487;&#20197;&#36890;&#36807;&#20048;&#35266;&#35835;&#38145;&#33719;&#21462;&#25968;&#25454;&#65292;&#26497;&#23569;&#25968;&#24773;&#20917;&#19979;&#20351;&#29992;&#24754;&#35266;&#35835;&#38145;&#33719;&#21462;&#25968;&#25454;&#12290;</p>
<p>&#21487;&#35265;&#65292;<code>StampedLock</code>&#25226;&#35835;&#38145;&#32454;&#20998;&#20026;&#20048;&#35266;&#35835;&#21644;&#24754;&#35266;&#35835;&#65292;&#33021;&#36827;&#19968;&#27493;&#25552;&#21319;&#24182;&#21457;&#25928;&#29575;&#12290;&#20294;&#36825;&#20063;&#26159;&#26377;&#20195;&#20215;&#30340;&#65306;&#19968;&#26159;&#20195;&#30721;&#26356;&#21152;&#22797;&#26434;&#65292;&#20108;&#26159;<code>StampedLock</code>&#26159;&#19981;&#21487;&#37325;&#20837;&#38145;&#65292;&#19981;&#33021;&#22312;&#19968;&#20010;&#32447;&#31243;&#20013;&#21453;&#22797;&#33719;&#21462;&#21516;&#19968;&#20010;&#38145;&#12290;</p>
<p><code>StampedLock</code>&#36824;&#25552;&#20379;&#20102;&#26356;&#22797;&#26434;&#30340;&#23558;&#24754;&#35266;&#35835;&#38145;&#21319;&#32423;&#20026;&#20889;&#38145;&#30340;&#21151;&#33021;&#65292;&#23427;&#20027;&#35201;&#20351;&#29992;&#22312;if-then-update&#30340;&#22330;&#26223;&#65306;&#21363;&#20808;&#35835;&#65292;&#22914;&#26524;&#35835;&#30340;&#25968;&#25454;&#28385;&#36275;&#26465;&#20214;&#65292;&#23601;&#36820;&#22238;&#65292;&#22914;&#26524;&#35835;&#30340;&#25968;&#25454;&#19981;&#28385;&#36275;&#26465;&#20214;&#65292;&#20877;&#23581;&#35797;&#20889;&#12290;</p>
<h3>&#23567;&#32467;</h3>
<p><code>StampedLock</code>&#25552;&#20379;&#20102;&#20048;&#35266;&#35835;&#38145;&#65292;&#21487;&#21462;&#20195;<code>ReadWriteLock</code>&#20197;&#36827;&#19968;&#27493;&#25552;&#21319;&#24182;&#21457;&#24615;&#33021;&#65307;</p>
<p><code>StampedLock</code>&#26159;&#19981;&#21487;&#37325;&#20837;&#38145;&#12290;</p>
</div>

    <hr>

    <div class="x-wiki-prev-next uk-clearfix"></div>

    <div class="x-anchor x-comment-anchor"><a name="comments"></a></div>
							</div>
							<div id="x-content-bottom">
								<!-- __snippet__.contentBottom -->
								<div id="sponsor-a" class="uk-margin-bottom"></div>
								<!-- // __snippet__.contentBottom -->
							</div>
							<div id="x-content-comment">
								    <h3>Comments</h3>

    <ul id="x-comment-list" class="uk-comment-list">
    </ul>

    <h3>Make a comment</h3>

    <div class="x-display-if-not-signin">
        <p><button type="button" class="uk-button" onclick="showSignin()"><i class="uk-icon-signin"></i> Sign in to make a comment</button></p>
    </div>

    <div id="x-comment-area"></div>

							</div>
						</div>
											
