<div class="uk-flex-item-1" style="padding-left:15px; ">
							<div id="x-content-top">
								<!-- __snippet__.contentTop -->
																<!-- // __snippet__.contentTop -->
							</div>
							<div id="x-content">
								    <h4>&#20351;&#29992;&#32447;&#31243;&#27744;</h4>
    <div class="x-wiki-info">
    	<span>Reads: 20562</span>
    	<a href="/manage/wiki/wikipage_update?id=1306581130018849" target="_blank" class="x-can-edit uk-text-danger">Edit</a>
</div>

    <hr>

    <div class="x-wiki-content x-main-content">
<p>Java&#35821;&#35328;&#34429;&#28982;&#20869;&#32622;&#20102;&#22810;&#32447;&#31243;&#25903;&#25345;&#65292;&#21551;&#21160;&#19968;&#20010;&#26032;&#32447;&#31243;&#38750;&#24120;&#26041;&#20415;&#65292;&#20294;&#26159;&#65292;&#21019;&#24314;&#32447;&#31243;&#38656;&#35201;&#25805;&#20316;&#31995;&#32479;&#36164;&#28304;&#65288;&#32447;&#31243;&#36164;&#28304;&#65292;&#26632;&#31354;&#38388;&#31561;&#65289;&#65292;&#39057;&#32321;&#21019;&#24314;&#21644;&#38144;&#27585;&#22823;&#37327;&#32447;&#31243;&#38656;&#35201;&#28040;&#32791;&#22823;&#37327;&#26102;&#38388;&#12290;</p>
<p>&#22914;&#26524;&#21487;&#20197;&#22797;&#29992;&#19968;&#32452;&#32447;&#31243;&#65306;</p>
<pre><code class="language-ascii">&#9484;&#9472;&#9472;&#9472;&#9472;&#9472;&#9488; execute  &#9484;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9488;
&#9474;Task1&#9474;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&gt;&#9474;ThreadPool        &#9474;
&#9500;&#9472;&#9472;&#9472;&#9472;&#9472;&#9508;          &#9474;&#9484;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9488;&#9484;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9488;&#9474;
&#9474;Task2&#9474;          &#9474;&#9474;Thread1&#9474;&#9474;Thread2&#9474;&#9474;
&#9500;&#9472;&#9472;&#9472;&#9472;&#9472;&#9508;          &#9474;&#9492;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9496;&#9492;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9496;&#9474;
&#9474;Task3&#9474;          &#9474;&#9484;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9488;&#9484;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9488;&#9474;
&#9500;&#9472;&#9472;&#9472;&#9472;&#9472;&#9508;          &#9474;&#9474;Thread3&#9474;&#9474;Thread4&#9474;&#9474;
&#9474;Task4&#9474;          &#9474;&#9492;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9496;&#9492;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9496;&#9474;
&#9500;&#9472;&#9472;&#9472;&#9472;&#9472;&#9508;          &#9492;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9496;
&#9474;Task5&#9474;
&#9500;&#9472;&#9472;&#9472;&#9472;&#9472;&#9508;
&#9474;Task6&#9474;
&#9492;&#9472;&#9472;&#9472;&#9472;&#9472;&#9496;
  ...
</code></pre>
<p>&#37027;&#20040;&#25105;&#20204;&#23601;&#21487;&#20197;&#25226;&#24456;&#22810;&#23567;&#20219;&#21153;&#35753;&#19968;&#32452;&#32447;&#31243;&#26469;&#25191;&#34892;&#65292;&#32780;&#19981;&#26159;&#19968;&#20010;&#20219;&#21153;&#23545;&#24212;&#19968;&#20010;&#26032;&#32447;&#31243;&#12290;&#36825;&#31181;&#33021;&#25509;&#25910;&#22823;&#37327;&#23567;&#20219;&#21153;&#24182;&#36827;&#34892;&#20998;&#21457;&#22788;&#29702;&#30340;&#23601;&#26159;&#32447;&#31243;&#27744;&#12290;</p>
<p>&#31616;&#21333;&#22320;&#35828;&#65292;&#32447;&#31243;&#27744;&#20869;&#37096;&#32500;&#25252;&#20102;&#33509;&#24178;&#20010;&#32447;&#31243;&#65292;&#27809;&#26377;&#20219;&#21153;&#30340;&#26102;&#20505;&#65292;&#36825;&#20123;&#32447;&#31243;&#37117;&#22788;&#20110;&#31561;&#24453;&#29366;&#24577;&#12290;&#22914;&#26524;&#26377;&#26032;&#20219;&#21153;&#65292;&#23601;&#20998;&#37197;&#19968;&#20010;&#31354;&#38386;&#32447;&#31243;&#25191;&#34892;&#12290;&#22914;&#26524;&#25152;&#26377;&#32447;&#31243;&#37117;&#22788;&#20110;&#24537;&#30860;&#29366;&#24577;&#65292;&#26032;&#20219;&#21153;&#35201;&#20040;&#25918;&#20837;&#38431;&#21015;&#31561;&#24453;&#65292;&#35201;&#20040;&#22686;&#21152;&#19968;&#20010;&#26032;&#32447;&#31243;&#36827;&#34892;&#22788;&#29702;&#12290;</p>
<p>Java&#26631;&#20934;&#24211;&#25552;&#20379;&#20102;<code>ExecutorService</code>&#25509;&#21475;&#34920;&#31034;&#32447;&#31243;&#27744;&#65292;&#23427;&#30340;&#20856;&#22411;&#29992;&#27861;&#22914;&#19979;&#65306;</p>
<pre><code>// &#21019;&#24314;&#22266;&#23450;&#22823;&#23567;&#30340;&#32447;&#31243;&#27744;:
ExecutorService executor = Executors.newFixedThreadPool(3);
// &#25552;&#20132;&#20219;&#21153;:
executor.submit(task1);
executor.submit(task2);
executor.submit(task3);
executor.submit(task4);
executor.submit(task5);
</code></pre>
<p>&#22240;&#20026;<code>ExecutorService</code>&#21482;&#26159;&#25509;&#21475;&#65292;Java&#26631;&#20934;&#24211;&#25552;&#20379;&#30340;&#20960;&#20010;&#24120;&#29992;&#23454;&#29616;&#31867;&#26377;&#65306;</p>
<ul>
<li>FixedThreadPool&#65306;&#32447;&#31243;&#25968;&#22266;&#23450;&#30340;&#32447;&#31243;&#27744;&#65307;</li>
<li>CachedThreadPool&#65306;&#32447;&#31243;&#25968;&#26681;&#25454;&#20219;&#21153;&#21160;&#24577;&#35843;&#25972;&#30340;&#32447;&#31243;&#27744;&#65307;</li>
<li>SingleThreadExecutor&#65306;&#20165;&#21333;&#32447;&#31243;&#25191;&#34892;&#30340;&#32447;&#31243;&#27744;&#12290;</li>
</ul>
<p>&#21019;&#24314;&#36825;&#20123;&#32447;&#31243;&#27744;&#30340;&#26041;&#27861;&#37117;&#34987;&#23553;&#35013;&#21040;<code>Executors</code>&#36825;&#20010;&#31867;&#20013;&#12290;&#25105;&#20204;&#20197;<code>FixedThreadPool</code>&#20026;&#20363;&#65292;&#30475;&#30475;&#32447;&#31243;&#27744;&#30340;&#25191;&#34892;&#36923;&#36753;&#65306;</p>
<pre><code class="language-x-java">// thread-pool
----
import java.util.concurrent.*;

public class Main {
    public static void main(String[] args) {
        // &#21019;&#24314;&#19968;&#20010;&#22266;&#23450;&#22823;&#23567;&#30340;&#32447;&#31243;&#27744;:
        ExecutorService es = Executors.newFixedThreadPool(4);
        for (int i = 0; i &lt; 6; i++) {
            es.submit(new Task("" + i));
        }
        // &#20851;&#38381;&#32447;&#31243;&#27744;:
        es.shutdown();
    }
}

class Task implements Runnable {
    private final String name;

    public Task(String name) {
        this.name = name;
    }

    @Override
    public void run() {
        System.out.println("start task " + name);
        try {
            Thread.sleep(1000);
        } catch (InterruptedException e) {
        }
        System.out.println("end task " + name);
    }
}
</code></pre>
<p>&#25105;&#20204;&#35266;&#23519;&#25191;&#34892;&#32467;&#26524;&#65292;&#19968;&#27425;&#24615;&#25918;&#20837;6&#20010;&#20219;&#21153;&#65292;&#30001;&#20110;&#32447;&#31243;&#27744;&#21482;&#26377;&#22266;&#23450;&#30340;4&#20010;&#32447;&#31243;&#65292;&#22240;&#27492;&#65292;&#21069;4&#20010;&#20219;&#21153;&#20250;&#21516;&#26102;&#25191;&#34892;&#65292;&#31561;&#21040;&#26377;&#32447;&#31243;&#31354;&#38386;&#21518;&#65292;&#25165;&#20250;&#25191;&#34892;&#21518;&#38754;&#30340;&#20004;&#20010;&#20219;&#21153;&#12290;</p>
<p>&#32447;&#31243;&#27744;&#22312;&#31243;&#24207;&#32467;&#26463;&#30340;&#26102;&#20505;&#35201;&#20851;&#38381;&#12290;&#20351;&#29992;<code>shutdown()</code>&#26041;&#27861;&#20851;&#38381;&#32447;&#31243;&#27744;&#30340;&#26102;&#20505;&#65292;&#23427;&#20250;&#31561;&#24453;&#27491;&#22312;&#25191;&#34892;&#30340;&#20219;&#21153;&#20808;&#23436;&#25104;&#65292;&#28982;&#21518;&#20877;&#20851;&#38381;&#12290;<code>shutdownNow()</code>&#20250;&#31435;&#21051;&#20572;&#27490;&#27491;&#22312;&#25191;&#34892;&#30340;&#20219;&#21153;&#65292;<code>awaitTermination()</code>&#21017;&#20250;&#31561;&#24453;&#25351;&#23450;&#30340;&#26102;&#38388;&#35753;&#32447;&#31243;&#27744;&#20851;&#38381;&#12290;</p>
<p>&#22914;&#26524;&#25105;&#20204;&#25226;&#32447;&#31243;&#27744;&#25913;&#20026;<code>CachedThreadPool</code>&#65292;&#30001;&#20110;&#36825;&#20010;&#32447;&#31243;&#27744;&#30340;&#23454;&#29616;&#20250;&#26681;&#25454;&#20219;&#21153;&#25968;&#37327;&#21160;&#24577;&#35843;&#25972;&#32447;&#31243;&#27744;&#30340;&#22823;&#23567;&#65292;&#25152;&#20197;6&#20010;&#20219;&#21153;&#21487;&#19968;&#27425;&#24615;&#20840;&#37096;&#21516;&#26102;&#25191;&#34892;&#12290;</p>
<p>&#22914;&#26524;&#25105;&#20204;&#24819;&#25226;&#32447;&#31243;&#27744;&#30340;&#22823;&#23567;&#38480;&#21046;&#22312;4&#65374;10&#20010;&#20043;&#38388;&#21160;&#24577;&#35843;&#25972;&#24590;&#20040;&#21150;&#65311;&#25105;&#20204;&#26597;&#30475;<code>Executors.newCachedThreadPool()</code>&#26041;&#27861;&#30340;&#28304;&#30721;&#65306;</p>
<pre><code>public static ExecutorService newCachedThreadPool() {
    return new ThreadPoolExecutor(0, Integer.MAX_VALUE,
                                    60L, TimeUnit.SECONDS,
                                    new SynchronousQueue&lt;Runnable&gt;());
}
</code></pre>
<p>&#22240;&#27492;&#65292;&#24819;&#21019;&#24314;&#25351;&#23450;&#21160;&#24577;&#33539;&#22260;&#30340;&#32447;&#31243;&#27744;&#65292;&#21487;&#20197;&#36825;&#20040;&#20889;&#65306;</p>
<pre><code>int min = 4;
int max = 10;
ExecutorService es = new ThreadPoolExecutor(min, max,
        60L, TimeUnit.SECONDS, new SynchronousQueue&lt;Runnable&gt;());
</code></pre>
<h3>ScheduledThreadPool</h3>
<p>&#36824;&#26377;&#19968;&#31181;&#20219;&#21153;&#65292;&#38656;&#35201;&#23450;&#26399;&#21453;&#22797;&#25191;&#34892;&#65292;&#20363;&#22914;&#65292;&#27599;&#31186;&#21047;&#26032;&#35777;&#21048;&#20215;&#26684;&#12290;&#36825;&#31181;&#20219;&#21153;&#26412;&#36523;&#22266;&#23450;&#65292;&#38656;&#35201;&#21453;&#22797;&#25191;&#34892;&#30340;&#65292;&#21487;&#20197;&#20351;&#29992;<code>ScheduledThreadPool</code>&#12290;&#25918;&#20837;<code>ScheduledThreadPool</code>&#30340;&#20219;&#21153;&#21487;&#20197;&#23450;&#26399;&#21453;&#22797;&#25191;&#34892;&#12290;</p>
<p>&#21019;&#24314;&#19968;&#20010;<code>ScheduledThreadPool</code>&#20173;&#28982;&#26159;&#36890;&#36807;<code>Executors</code>&#31867;&#65306;</p>
<pre><code>ScheduledExecutorService ses = Executors.newScheduledThreadPool(4);
</code></pre>
<p>&#25105;&#20204;&#21487;&#20197;&#25552;&#20132;&#19968;&#27425;&#24615;&#20219;&#21153;&#65292;&#23427;&#20250;&#22312;&#25351;&#23450;&#24310;&#36831;&#21518;&#21482;&#25191;&#34892;&#19968;&#27425;&#65306;</p>
<pre><code>// 1&#31186;&#21518;&#25191;&#34892;&#19968;&#27425;&#24615;&#20219;&#21153;:
ses.schedule(new Task("one-time"), 1, TimeUnit.SECONDS);
</code></pre>
<p>&#22914;&#26524;&#20219;&#21153;&#20197;&#22266;&#23450;&#30340;&#27599;3&#31186;&#25191;&#34892;&#65292;&#25105;&#20204;&#21487;&#20197;&#36825;&#26679;&#20889;&#65306;</p>
<pre><code>// 2&#31186;&#21518;&#24320;&#22987;&#25191;&#34892;&#23450;&#26102;&#20219;&#21153;&#65292;&#27599;3&#31186;&#25191;&#34892;:
ses.scheduleAtFixedRate(new Task("fixed-rate"), 2, 3, TimeUnit.SECONDS);
</code></pre>
<p>&#22914;&#26524;&#20219;&#21153;&#20197;&#22266;&#23450;&#30340;3&#31186;&#20026;&#38388;&#38548;&#25191;&#34892;&#65292;&#25105;&#20204;&#21487;&#20197;&#36825;&#26679;&#20889;&#65306;</p>
<pre><code>// 3&#31186;&#21518;&#24320;&#22987;&#25191;&#34892;&#23450;&#26102;&#20219;&#21153;&#65292;&#20197;3&#31186;&#20026;&#38388;&#38548;&#25191;&#34892;:
ses.scheduleWithFixedDelay(new Task("fixed-delay"), 2, 3, TimeUnit.SECONDS);
</code></pre>
<p>&#27880;&#24847;FixedRate&#21644;FixedDelay&#30340;&#21306;&#21035;&#12290;FixedRate&#26159;&#25351;&#20219;&#21153;&#24635;&#26159;&#20197;&#22266;&#23450;&#26102;&#38388;&#38388;&#38548;&#35302;&#21457;&#65292;&#19981;&#31649;&#20219;&#21153;&#25191;&#34892;&#22810;&#38271;&#26102;&#38388;&#65306;</p>
<pre><code class="language-ascii">&#9474;&#9617;&#9617;&#9617;&#9617;   &#9474;&#9617;&#9617;&#9617;&#9617;&#9617;&#9617; &#9474;&#9617;&#9617;&#9617;    &#9474;&#9617;&#9617;&#9617;&#9617;&#9617;  &#9474;&#9617;&#9617;&#9617;  
&#9500;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9532;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9532;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9532;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9532;&#9472;&#9472;&#9472;&#9472;&gt;
&#9474;&lt;&#9472;&#9472;&#9472;&#9472;&#9472;&gt;&#9474;&lt;&#9472;&#9472;&#9472;&#9472;&#9472;&gt;&#9474;&lt;&#9472;&#9472;&#9472;&#9472;&#9472;&gt;&#9474;&lt;&#9472;&#9472;&#9472;&#9472;&#9472;&gt;&#9474;
</code></pre>
<p>&#32780;FixedDelay&#26159;&#25351;&#65292;&#19978;&#19968;&#27425;&#20219;&#21153;&#25191;&#34892;&#23436;&#27605;&#21518;&#65292;&#31561;&#24453;&#22266;&#23450;&#30340;&#26102;&#38388;&#38388;&#38548;&#65292;&#20877;&#25191;&#34892;&#19979;&#19968;&#27425;&#20219;&#21153;&#65306;</p>
<pre><code class="language-ascii">&#9474;&#9617;&#9617;&#9617;&#9474;       &#9474;&#9617;&#9617;&#9617;&#9617;&#9617;&#9474;       &#9474;&#9617;&#9617;&#9474;       &#9474;&#9617;
&#9492;&#9472;&#9472;&#9472;&#9532;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9532;&#9472;&#9472;&#9472;&#9472;&#9472;&#9532;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9532;&#9472;&#9472;&#9532;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9532;&#9472;&#9472;&gt;
    &#9474;&lt;&#9472;&#9472;&#9472;&#9472;&#9472;&gt;&#9474;     &#9474;&lt;&#9472;&#9472;&#9472;&#9472;&#9472;&gt;&#9474;  &#9474;&lt;&#9472;&#9472;&#9472;&#9472;&#9472;&gt;&#9474;
</code></pre>
<p>&#22240;&#27492;&#65292;&#20351;&#29992;<code>ScheduledThreadPool</code>&#26102;&#65292;&#25105;&#20204;&#35201;&#26681;&#25454;&#38656;&#35201;&#36873;&#25321;&#25191;&#34892;&#19968;&#27425;&#12289;FixedRate&#25191;&#34892;&#36824;&#26159;FixedDelay&#25191;&#34892;&#12290;</p>
<p>&#32454;&#24515;&#30340;&#31461;&#38795;&#36824;&#21487;&#20197;&#24605;&#32771;&#19979;&#38754;&#30340;&#38382;&#39064;&#65306;</p>
<ul>
<li>
<p>&#22312;FixedRate&#27169;&#24335;&#19979;&#65292;&#20551;&#35774;&#27599;&#31186;&#35302;&#21457;&#65292;&#22914;&#26524;&#26576;&#27425;&#20219;&#21153;&#25191;&#34892;&#26102;&#38388;&#36229;&#36807;1&#31186;&#65292;&#21518;&#32493;&#20219;&#21153;&#20250;&#19981;&#20250;&#24182;&#21457;&#25191;&#34892;&#65311;</p>
</li>
<li>
<p>&#22914;&#26524;&#20219;&#21153;&#25243;&#20986;&#20102;&#24322;&#24120;&#65292;&#21518;&#32493;&#20219;&#21153;&#26159;&#21542;&#32487;&#32493;&#25191;&#34892;&#65311;</p>
</li>
</ul>
<p>Java&#26631;&#20934;&#24211;&#36824;&#25552;&#20379;&#20102;&#19968;&#20010;<code>java.util.Timer</code>&#31867;&#65292;&#36825;&#20010;&#31867;&#20063;&#21487;&#20197;&#23450;&#26399;&#25191;&#34892;&#20219;&#21153;&#65292;&#20294;&#26159;&#65292;&#19968;&#20010;<code>Timer</code>&#20250;&#23545;&#24212;&#19968;&#20010;<code>Thread</code>&#65292;&#25152;&#20197;&#65292;&#19968;&#20010;<code>Timer</code>&#21482;&#33021;&#23450;&#26399;&#25191;&#34892;&#19968;&#20010;&#20219;&#21153;&#65292;&#22810;&#20010;&#23450;&#26102;&#20219;&#21153;&#24517;&#39035;&#21551;&#21160;&#22810;&#20010;<code>Timer</code>&#65292;&#32780;&#19968;&#20010;<code>ScheduledThreadPool</code>&#23601;&#21487;&#20197;&#35843;&#24230;&#22810;&#20010;&#23450;&#26102;&#20219;&#21153;&#65292;&#25152;&#20197;&#65292;&#25105;&#20204;&#23436;&#20840;&#21487;&#20197;&#29992;<code>ScheduledThreadPool</code>&#21462;&#20195;&#26087;&#30340;<code>Timer</code>&#12290;</p>
<h3>&#32451;&#20064;</h3>
<p><a href="https://gitee.com/liaoxuefeng/learn-java/raw/master/practices/Java%E6%95%99%E7%A8%8B/130.%E5%A4%9A%E7%BA%BF%E7%A8%8B.1255943750561472/160.%E4%BD%BF%E7%94%A8%E7%BA%BF%E7%A8%8B%E6%B1%A0.1306581130018849/thread-pool.zip">&#20351;&#29992;&#32447;&#31243;&#27744;</a></p>
<h3>&#23567;&#32467;</h3>
<p>JDK&#25552;&#20379;&#20102;<code>ExecutorService</code>&#23454;&#29616;&#20102;&#32447;&#31243;&#27744;&#21151;&#33021;&#65306;</p>
<ul>
<li>
<p>&#32447;&#31243;&#27744;&#20869;&#37096;&#32500;&#25252;&#19968;&#32452;&#32447;&#31243;&#65292;&#21487;&#20197;&#39640;&#25928;&#25191;&#34892;&#22823;&#37327;&#23567;&#20219;&#21153;&#65307;</p>
</li>
<li>
<p><code>Executors</code>&#25552;&#20379;&#20102;&#38745;&#24577;&#26041;&#27861;&#21019;&#24314;&#19981;&#21516;&#31867;&#22411;&#30340;<code>ExecutorService</code>&#65307;</p>
</li>
<li>
<p>&#24517;&#39035;&#35843;&#29992;<code>shutdown()</code>&#20851;&#38381;<code>ExecutorService</code>&#65307;</p>
</li>
<li>
<p><code>ScheduledThreadPool</code>&#21487;&#20197;&#23450;&#26399;&#35843;&#24230;&#22810;&#20010;&#20219;&#21153;&#12290;</p>
</li>
</ul>
</div>

    <hr>

    <div class="x-wiki-prev-next uk-clearfix"></div>

    <div class="x-anchor x-comment-anchor"><a name="comments"></a></div>
							</div>
							<div id="x-content-bottom">
								<!-- __snippet__.contentBottom -->
								<div id="sponsor-a" class="uk-margin-bottom"></div>
								<!-- // __snippet__.contentBottom -->
							</div>
							<div id="x-content-comment">
								    <h3>Comments</h3>

    <ul id="x-comment-list" class="uk-comment-list">
    </ul>

    <h3>Make a comment</h3>

    <div class="x-display-if-not-signin">
        <p><button type="button" class="uk-button" onclick="showSignin()"><i class="uk-icon-signin"></i> Sign in to make a comment</button></p>
    </div>

    <div id="x-comment-area"></div>

							</div>
						</div>
											
