<div class="uk-flex-item-1" style="padding-left:15px; ">
							<div id="x-content-top">
								<!-- __snippet__.contentTop -->
																<!-- // __snippet__.contentTop -->
							</div>
							<div id="x-content">
								    <h4>&#32593;&#32476;&#32534;&#31243;&#22522;&#30784;</h4>
    <div class="x-wiki-info">
    	<span>Reads: 54035</span>
    	<a href="/manage/wiki/wikipage_update?id=1305163149082658" target="_blank" class="x-can-edit uk-text-danger">Edit</a>
</div>

    <hr>

    <div class="x-wiki-content x-main-content">
<p>&#22312;&#23398;&#20064;Java&#32593;&#32476;&#32534;&#31243;&#20043;&#21069;&#65292;&#25105;&#20204;&#20808;&#26469;&#20102;&#35299;&#20160;&#20040;&#26159;&#35745;&#31639;&#26426;&#32593;&#32476;&#12290;</p>
<p>&#35745;&#31639;&#26426;&#32593;&#32476;&#26159;&#25351;&#20004;&#21488;&#25110;&#26356;&#22810;&#30340;&#35745;&#31639;&#26426;&#32452;&#25104;&#30340;&#32593;&#32476;&#65292;&#22312;&#21516;&#19968;&#20010;&#32593;&#32476;&#20013;&#65292;&#20219;&#24847;&#20004;&#21488;&#35745;&#31639;&#26426;&#37117;&#21487;&#20197;&#30452;&#25509;&#36890;&#20449;&#65292;&#22240;&#20026;&#25152;&#26377;&#35745;&#31639;&#26426;&#37117;&#38656;&#35201;&#36981;&#24490;&#21516;&#19968;&#31181;&#32593;&#32476;&#21327;&#35758;&#12290;</p>
<p>&#37027;&#20160;&#20040;&#26159;&#20114;&#32852;&#32593;&#21602;&#65311;&#20114;&#32852;&#32593;&#26159;&#32593;&#32476;&#30340;&#32593;&#32476;&#65288;internet&#65289;&#65292;&#21363;&#25226;&#24456;&#22810;&#35745;&#31639;&#26426;&#32593;&#32476;&#36830;&#25509;&#36215;&#26469;&#65292;&#24418;&#25104;&#19968;&#20010;&#20840;&#29699;&#32479;&#19968;&#30340;&#20114;&#32852;&#32593;&#12290;</p>
<p>&#23545;&#26576;&#20010;&#29305;&#23450;&#30340;&#35745;&#31639;&#26426;&#32593;&#32476;&#26469;&#35828;&#65292;&#23427;&#21487;&#33021;&#20351;&#29992;&#32593;&#32476;&#21327;&#35758;ABC&#65292;&#32780;&#21478;&#19968;&#20010;&#35745;&#31639;&#26426;&#32593;&#32476;&#21487;&#33021;&#20351;&#29992;&#32593;&#32476;&#21327;&#35758;XYZ&#12290;&#22914;&#26524;&#35745;&#31639;&#26426;&#32593;&#32476;&#21508;&#33258;&#30340;&#36890;&#35759;&#21327;&#35758;&#19981;&#32479;&#19968;&#65292;&#23601;&#27809;&#27861;&#25226;&#19981;&#21516;&#30340;&#32593;&#32476;&#36830;&#25509;&#36215;&#26469;&#24418;&#25104;&#20114;&#32852;&#32593;&#12290;&#22240;&#27492;&#65292;&#20026;&#20102;&#25226;&#35745;&#31639;&#26426;&#32593;&#32476;&#25509;&#20837;&#20114;&#32852;&#32593;&#65292;&#23601;&#24517;&#39035;&#20351;&#29992;TCP/IP&#21327;&#35758;&#12290;</p>
<p>TCP/IP&#21327;&#35758;&#27867;&#25351;&#20114;&#32852;&#32593;&#21327;&#35758;&#65292;&#20854;&#20013;&#26368;&#37325;&#35201;&#30340;&#20004;&#20010;&#21327;&#35758;&#26159;TCP&#21327;&#35758;&#21644;IP&#21327;&#35758;&#12290;&#21482;&#26377;&#20351;&#29992;TCP/IP&#21327;&#35758;&#30340;&#35745;&#31639;&#26426;&#25165;&#33021;&#22815;&#32852;&#20837;&#20114;&#32852;&#32593;&#65292;&#20351;&#29992;&#20854;&#20182;&#32593;&#32476;&#21327;&#35758;&#65288;&#20363;&#22914;NetBIOS&#12289;AppleTalk&#21327;&#35758;&#31561;&#65289;&#26159;&#26080;&#27861;&#32852;&#20837;&#20114;&#32852;&#32593;&#30340;&#12290;</p>
<h3>IP&#22320;&#22336;</h3>
<p>&#22312;&#20114;&#32852;&#32593;&#20013;&#65292;&#19968;&#20010;IP&#22320;&#22336;&#29992;&#20110;&#21807;&#19968;&#26631;&#35782;&#19968;&#20010;&#32593;&#32476;&#25509;&#21475;&#65288;Network Interface&#65289;&#12290;&#19968;&#21488;&#32852;&#20837;&#20114;&#32852;&#32593;&#30340;&#35745;&#31639;&#26426;&#32943;&#23450;&#26377;&#19968;&#20010;IP&#22320;&#22336;&#65292;&#20294;&#20063;&#21487;&#33021;&#26377;&#22810;&#20010;IP&#22320;&#22336;&#12290;</p>
<p>IP&#22320;&#22336;&#20998;&#20026;IPv4&#21644;IPv6&#20004;&#31181;&#12290;IPv4&#37319;&#29992;32&#20301;&#22320;&#22336;&#65292;&#31867;&#20284;<code>101.202.99.12</code>&#65292;&#32780;IPv6&#37319;&#29992;128&#20301;&#22320;&#22336;&#65292;&#31867;&#20284;<code>2001:0DA8:100A:0000:0000:1020:F2F3:1428</code>&#12290;IPv4&#22320;&#22336;&#24635;&#20849;&#26377;2<sup>32</sup>&#20010;&#65288;&#22823;&#32422;42&#20159;&#65289;&#65292;&#32780;IPv6&#22320;&#22336;&#21017;&#24635;&#20849;&#26377;2<sup>128</sup>&#20010;&#65288;&#22823;&#32422;340&#19975;&#20159;&#20159;&#20159;&#20159;&#65289;&#65292;IPv4&#30340;&#22320;&#22336;&#30446;&#21069;&#24050;&#32791;&#23613;&#65292;&#32780;IPv6&#30340;&#22320;&#22336;&#26159;&#26681;&#26412;&#29992;&#19981;&#23436;&#30340;&#12290;</p>
<p>IP&#22320;&#22336;&#21448;&#20998;&#20026;&#20844;&#32593;IP&#22320;&#22336;&#21644;&#20869;&#32593;IP&#22320;&#22336;&#12290;&#20844;&#32593;IP&#22320;&#22336;&#21487;&#20197;&#30452;&#25509;&#34987;&#35775;&#38382;&#65292;&#20869;&#32593;IP&#22320;&#22336;&#21482;&#33021;&#22312;&#20869;&#32593;&#35775;&#38382;&#12290;&#20869;&#32593;IP&#22320;&#22336;&#31867;&#20284;&#20110;&#65306;</p>
<ul>
<li>192.168.x.x</li>
<li>10.x.x.x</li>
</ul>
<p>&#26377;&#19968;&#20010;&#29305;&#27530;&#30340;IP&#22320;&#22336;&#65292;&#31216;&#20043;&#20026;&#26412;&#26426;&#22320;&#22336;&#65292;&#23427;&#24635;&#26159;<code>127.0.0.1</code>&#12290;</p>
<p>IPv4&#22320;&#22336;&#23454;&#38469;&#19978;&#26159;&#19968;&#20010;32&#20301;&#25972;&#25968;&#12290;&#20363;&#22914;&#65306;</p>
<pre><code class="language-ascii">106717964 = 0x65ca630c
          = 65  ca  63 0c
          = 101.202.99.12
</code></pre>
<p>&#22914;&#26524;&#19968;&#21488;&#35745;&#31639;&#26426;&#21482;&#26377;&#19968;&#20010;&#32593;&#21345;&#65292;&#24182;&#19988;&#25509;&#20837;&#20102;&#32593;&#32476;&#65292;&#37027;&#20040;&#65292;&#23427;&#26377;&#19968;&#20010;&#26412;&#26426;&#22320;&#22336;<code>127.0.0.1</code>&#65292;&#36824;&#26377;&#19968;&#20010;IP&#22320;&#22336;&#65292;&#20363;&#22914;<code>101.202.99.12</code>&#65292;&#21487;&#20197;&#36890;&#36807;&#36825;&#20010;IP&#22320;&#22336;&#25509;&#20837;&#32593;&#32476;&#12290;</p>
<p>&#22914;&#26524;&#19968;&#21488;&#35745;&#31639;&#26426;&#26377;&#20004;&#22359;&#32593;&#21345;&#65292;&#37027;&#20040;&#38500;&#20102;&#26412;&#26426;&#22320;&#22336;&#65292;&#23427;&#21487;&#20197;&#26377;&#20004;&#20010;IP&#22320;&#22336;&#65292;&#21487;&#20197;&#20998;&#21035;&#25509;&#20837;&#20004;&#20010;&#32593;&#32476;&#12290;&#36890;&#24120;&#36830;&#25509;&#20004;&#20010;&#32593;&#32476;&#30340;&#35774;&#22791;&#26159;&#36335;&#30001;&#22120;&#25110;&#32773;&#20132;&#25442;&#26426;&#65292;&#23427;&#33267;&#23569;&#26377;&#20004;&#20010;IP&#22320;&#22336;&#65292;&#20998;&#21035;&#25509;&#20837;&#19981;&#21516;&#30340;&#32593;&#32476;&#65292;&#35753;&#32593;&#32476;&#20043;&#38388;&#36830;&#25509;&#36215;&#26469;&#12290;</p>
<p>&#22914;&#26524;&#20004;&#21488;&#35745;&#31639;&#26426;&#20301;&#20110;&#21516;&#19968;&#20010;&#32593;&#32476;&#65292;&#37027;&#20040;&#20182;&#20204;&#20043;&#38388;&#21487;&#20197;&#30452;&#25509;&#36890;&#20449;&#65292;&#22240;&#20026;&#20182;&#20204;&#30340;IP&#22320;&#22336;&#21069;&#27573;&#26159;&#30456;&#21516;&#30340;&#65292;&#20063;&#23601;&#26159;&#32593;&#32476;&#21495;&#26159;&#30456;&#21516;&#30340;&#12290;&#32593;&#32476;&#21495;&#26159;IP&#22320;&#22336;&#36890;&#36807;&#23376;&#32593;&#25513;&#30721;&#36807;&#28388;&#21518;&#24471;&#21040;&#30340;&#12290;&#20363;&#22914;&#65306;</p>
<p>&#26576;&#21488;&#35745;&#31639;&#26426;&#30340;IP&#26159;<code>101.202.99.2</code>&#65292;&#23376;&#32593;&#25513;&#30721;&#26159;<code>255.255.255.0</code>&#65292;&#37027;&#20040;&#35745;&#31639;&#35813;&#35745;&#31639;&#26426;&#30340;&#32593;&#32476;&#21495;&#26159;&#65306;</p>
<pre><code>IP = 101.202.99.2
Mask = 255.255.255.0
Network = IP &amp; Mask = 101.202.99.0
</code></pre>
<p>&#27599;&#21488;&#35745;&#31639;&#26426;&#37117;&#38656;&#35201;&#27491;&#30830;&#37197;&#32622;IP&#22320;&#22336;&#21644;&#23376;&#32593;&#25513;&#30721;&#65292;&#26681;&#25454;&#36825;&#20004;&#20010;&#23601;&#21487;&#20197;&#35745;&#31639;&#32593;&#32476;&#21495;&#65292;&#22914;&#26524;&#20004;&#21488;&#35745;&#31639;&#26426;&#35745;&#31639;&#20986;&#30340;&#32593;&#32476;&#21495;&#30456;&#21516;&#65292;&#35828;&#26126;&#20004;&#21488;&#35745;&#31639;&#26426;&#22312;&#21516;&#19968;&#20010;&#32593;&#32476;&#65292;&#21487;&#20197;&#30452;&#25509;&#36890;&#20449;&#12290;&#22914;&#26524;&#20004;&#21488;&#35745;&#31639;&#26426;&#35745;&#31639;&#20986;&#30340;&#32593;&#32476;&#21495;&#19981;&#21516;&#65292;&#37027;&#20040;&#20004;&#21488;&#35745;&#31639;&#26426;&#19981;&#22312;&#21516;&#19968;&#20010;&#32593;&#32476;&#65292;&#19981;&#33021;&#30452;&#25509;&#36890;&#20449;&#65292;&#23427;&#20204;&#20043;&#38388;&#24517;&#39035;&#36890;&#36807;&#36335;&#30001;&#22120;&#25110;&#32773;&#20132;&#25442;&#26426;&#36825;&#26679;&#30340;&#32593;&#32476;&#35774;&#22791;&#38388;&#25509;&#36890;&#20449;&#65292;&#25105;&#20204;&#25226;&#36825;&#31181;&#35774;&#22791;&#31216;&#20026;&#32593;&#20851;&#12290;</p>
<p>&#32593;&#20851;&#30340;&#20316;&#29992;&#23601;&#26159;&#36830;&#25509;&#22810;&#20010;&#32593;&#32476;&#65292;&#36127;&#36131;&#25226;&#26469;&#33258;&#19968;&#20010;&#32593;&#32476;&#30340;&#25968;&#25454;&#21253;&#21457;&#21040;&#21478;&#19968;&#20010;&#32593;&#32476;&#65292;&#36825;&#20010;&#36807;&#31243;&#21483;&#36335;&#30001;&#12290;</p>
<p>&#25152;&#20197;&#65292;&#19968;&#21488;&#35745;&#31639;&#26426;&#30340;&#19968;&#20010;&#32593;&#21345;&#20250;&#26377;3&#20010;&#20851;&#38190;&#37197;&#32622;&#65306;</p>
<p><img src="/static/img/loading.svg" data-src="/files/attachments/1318110181195841/l" alt="network"></p>
<ul>
<li>IP&#22320;&#22336;&#65292;&#20363;&#22914;&#65306;<code>10.0.2.15</code>
</li>
<li>&#23376;&#32593;&#25513;&#30721;&#65292;&#20363;&#22914;&#65306;<code>255.255.255.0</code>
</li>
<li>&#32593;&#20851;&#30340;IP&#22320;&#22336;&#65292;&#20363;&#22914;&#65306;<code>10.0.2.2</code>
</li>
</ul>
<h3>&#22495;&#21517;</h3>
<p>&#22240;&#20026;&#30452;&#25509;&#35760;&#24518;IP&#22320;&#22336;&#38750;&#24120;&#22256;&#38590;&#65292;&#25152;&#20197;&#25105;&#20204;&#36890;&#24120;&#20351;&#29992;&#22495;&#21517;&#35775;&#38382;&#26576;&#20010;&#29305;&#23450;&#30340;&#26381;&#21153;&#12290;&#22495;&#21517;&#35299;&#26512;&#26381;&#21153;&#22120;DNS&#36127;&#36131;&#25226;&#22495;&#21517;&#32763;&#35793;&#25104;&#23545;&#24212;&#30340;IP&#65292;&#23458;&#25143;&#31471;&#20877;&#26681;&#25454;IP&#22320;&#22336;&#35775;&#38382;&#26381;&#21153;&#22120;&#12290;</p>
<p>&#29992;<code>nslookup</code>&#21487;&#20197;&#26597;&#30475;&#22495;&#21517;&#23545;&#24212;&#30340;IP&#22320;&#22336;&#65306;</p>
<pre><code>$ nslookup www.liaoxuefeng.com
Server:  xxx.xxx.xxx.xxx
Address: xxx.xxx.xxx.xxx#53

Non-authoritative answer:
Name:    www.liaoxuefeng.com
Address: 47.98.33.223
</code></pre>
<p>&#26377;&#19968;&#20010;&#29305;&#27530;&#30340;&#26412;&#26426;&#22495;&#21517;<code>localhost</code>&#65292;&#23427;&#23545;&#24212;&#30340;IP&#22320;&#22336;&#24635;&#26159;&#26412;&#26426;&#22320;&#22336;<code>127.0.0.1</code>&#12290;</p>
<h3>&#32593;&#32476;&#27169;&#22411;</h3>
<p>&#30001;&#20110;&#35745;&#31639;&#26426;&#32593;&#32476;&#20174;&#24213;&#23618;&#30340;&#20256;&#36755;&#21040;&#39640;&#23618;&#30340;&#36719;&#20214;&#35774;&#35745;&#21313;&#20998;&#22797;&#26434;&#65292;&#35201;&#21512;&#29702;&#22320;&#35774;&#35745;&#35745;&#31639;&#26426;&#32593;&#32476;&#27169;&#22411;&#65292;&#24517;&#39035;&#37319;&#29992;&#20998;&#23618;&#27169;&#22411;&#65292;&#27599;&#19968;&#23618;&#36127;&#36131;&#22788;&#29702;&#33258;&#24049;&#30340;&#25805;&#20316;&#12290;OSI&#65288;Open System Interconnect&#65289;&#32593;&#32476;&#27169;&#22411;&#26159;ISO&#32452;&#32455;&#23450;&#20041;&#30340;&#19968;&#20010;&#35745;&#31639;&#26426;&#20114;&#32852;&#30340;&#26631;&#20934;&#27169;&#22411;&#65292;&#27880;&#24847;&#23427;&#21482;&#26159;&#19968;&#20010;&#23450;&#20041;&#65292;&#30446;&#30340;&#26159;&#20026;&#20102;&#31616;&#21270;&#32593;&#32476;&#21508;&#23618;&#30340;&#25805;&#20316;&#65292;&#25552;&#20379;&#26631;&#20934;&#25509;&#21475;&#20415;&#20110;&#23454;&#29616;&#21644;&#32500;&#25252;&#12290;&#36825;&#20010;&#27169;&#22411;&#20174;&#19978;&#21040;&#19979;&#20381;&#27425;&#26159;&#65306;</p>
<ul>
<li>&#24212;&#29992;&#23618;&#65292;&#25552;&#20379;&#24212;&#29992;&#31243;&#24207;&#20043;&#38388;&#30340;&#36890;&#20449;&#65307;</li>
<li>&#34920;&#31034;&#23618;&#65306;&#22788;&#29702;&#25968;&#25454;&#26684;&#24335;&#65292;&#21152;&#35299;&#23494;&#31561;&#31561;&#65307;</li>
<li>&#20250;&#35805;&#23618;&#65306;&#36127;&#36131;&#24314;&#31435;&#21644;&#32500;&#25252;&#20250;&#35805;&#65307;</li>
<li>&#20256;&#36755;&#23618;&#65306;&#36127;&#36131;&#25552;&#20379;&#31471;&#21040;&#31471;&#30340;&#21487;&#38752;&#20256;&#36755;&#65307;</li>
<li>&#32593;&#32476;&#23618;&#65306;&#36127;&#36131;&#26681;&#25454;&#30446;&#26631;&#22320;&#22336;&#36873;&#25321;&#36335;&#30001;&#26469;&#20256;&#36755;&#25968;&#25454;&#65307;</li>
<li>&#38142;&#36335;&#23618;&#21644;&#29289;&#29702;&#23618;&#36127;&#36131;&#25226;&#25968;&#25454;&#36827;&#34892;&#20998;&#29255;&#24182;&#19988;&#30495;&#27491;&#36890;&#36807;&#29289;&#29702;&#32593;&#32476;&#20256;&#36755;&#65292;&#20363;&#22914;&#65292;&#26080;&#32447;&#32593;&#12289;&#20809;&#32420;&#31561;&#12290;</li>
</ul>
<p>&#20114;&#32852;&#32593;&#23454;&#38469;&#20351;&#29992;&#30340;TCP/IP&#27169;&#22411;&#24182;&#19981;&#26159;&#23545;&#24212;&#21040;OSI&#30340;7&#23618;&#27169;&#22411;&#65292;&#32780;&#26159;&#22823;&#33268;&#23545;&#24212;OSI&#30340;5&#23618;&#27169;&#22411;&#65306;</p>
<table class="uk-table">
<thead>
  <tr>
    <th>OSI</th>
    <th>TCP/IP</th>
  </tr>
</thead>
  <tbody>
  <tr>
    <td>&#24212;&#29992;&#23618;</td>
    <td rowspan="3">&#24212;&#29992;&#23618;</td>
  </tr>
  <tr>
    <td>&#34920;&#31034;&#23618;</td>
  </tr>
  <tr>
    <td>&#20250;&#35805;&#23618;</td>
  </tr>
  <tr>
    <td>&#20256;&#36755;&#23618;</td>
    <td>&#20256;&#36755;&#23618;</td>
  </tr>
  <tr>
    <td>&#32593;&#32476;&#23618;</td>
    <td>IP&#23618;</td>
  </tr>
  <tr>
    <td>&#38142;&#36335;&#23618;</td>
    <td rowspan="2">&#32593;&#32476;&#25509;&#21475;&#23618;</td>
  </tr>
  <tr>
    <td>&#29289;&#29702;&#23618;</td>
  </tr>
</tbody>
</table>
<h3>&#24120;&#29992;&#21327;&#35758;</h3>
<p>IP&#21327;&#35758;&#26159;&#19968;&#20010;&#20998;&#32452;&#20132;&#25442;&#65292;&#23427;&#19981;&#20445;&#35777;&#21487;&#38752;&#20256;&#36755;&#12290;&#32780;TCP&#21327;&#35758;&#26159;&#20256;&#36755;&#25511;&#21046;&#21327;&#35758;&#65292;&#23427;&#26159;&#38754;&#21521;&#36830;&#25509;&#30340;&#21327;&#35758;&#65292;&#25903;&#25345;&#21487;&#38752;&#20256;&#36755;&#21644;&#21452;&#21521;&#36890;&#20449;&#12290;TCP&#21327;&#35758;&#26159;&#24314;&#31435;&#22312;IP&#21327;&#35758;&#20043;&#19978;&#30340;&#65292;&#31616;&#21333;&#22320;&#35828;&#65292;IP&#21327;&#35758;&#21482;&#36127;&#36131;&#21457;&#25968;&#25454;&#21253;&#65292;&#19981;&#20445;&#35777;&#39034;&#24207;&#21644;&#27491;&#30830;&#24615;&#65292;&#32780;TCP&#21327;&#35758;&#36127;&#36131;&#25511;&#21046;&#25968;&#25454;&#21253;&#20256;&#36755;&#65292;&#23427;&#22312;&#20256;&#36755;&#25968;&#25454;&#20043;&#21069;&#38656;&#35201;&#20808;&#24314;&#31435;&#36830;&#25509;&#65292;&#24314;&#31435;&#36830;&#25509;&#21518;&#25165;&#33021;&#20256;&#36755;&#25968;&#25454;&#65292;&#20256;&#36755;&#23436;&#21518;&#36824;&#38656;&#35201;&#26029;&#24320;&#36830;&#25509;&#12290;TCP&#21327;&#35758;&#20043;&#25152;&#20197;&#33021;&#20445;&#35777;&#25968;&#25454;&#30340;&#21487;&#38752;&#20256;&#36755;&#65292;&#26159;&#36890;&#36807;&#25509;&#25910;&#30830;&#35748;&#12289;&#36229;&#26102;&#37325;&#20256;&#36825;&#20123;&#26426;&#21046;&#23454;&#29616;&#30340;&#12290;&#24182;&#19988;&#65292;TCP&#21327;&#35758;&#20801;&#35768;&#21452;&#21521;&#36890;&#20449;&#65292;&#21363;&#36890;&#20449;&#21452;&#26041;&#21487;&#20197;&#21516;&#26102;&#21457;&#36865;&#21644;&#25509;&#25910;&#25968;&#25454;&#12290;</p>
<p>TCP&#21327;&#35758;&#20063;&#26159;&#24212;&#29992;&#26368;&#24191;&#27867;&#30340;&#21327;&#35758;&#65292;&#35768;&#22810;&#39640;&#32423;&#21327;&#35758;&#37117;&#26159;&#24314;&#31435;&#22312;TCP&#21327;&#35758;&#20043;&#19978;&#30340;&#65292;&#20363;&#22914;HTTP&#12289;SMTP&#31561;&#12290;</p>
<p>UDP&#21327;&#35758;&#65288;User Datagram Protocol&#65289;&#26159;&#19968;&#31181;&#25968;&#25454;&#25253;&#25991;&#21327;&#35758;&#65292;&#23427;&#26159;&#26080;&#36830;&#25509;&#21327;&#35758;&#65292;&#19981;&#20445;&#35777;&#21487;&#38752;&#20256;&#36755;&#12290;&#22240;&#20026;UDP&#21327;&#35758;&#22312;&#36890;&#20449;&#21069;&#19981;&#38656;&#35201;&#24314;&#31435;&#36830;&#25509;&#65292;&#22240;&#27492;&#23427;&#30340;&#20256;&#36755;&#25928;&#29575;&#27604;TCP&#39640;&#65292;&#32780;&#19988;UDP&#21327;&#35758;&#27604;TCP&#21327;&#35758;&#35201;&#31616;&#21333;&#24471;&#22810;&#12290;</p>
<p>&#36873;&#25321;UDP&#21327;&#35758;&#26102;&#65292;&#20256;&#36755;&#30340;&#25968;&#25454;&#36890;&#24120;&#26159;&#33021;&#23481;&#24525;&#20002;&#22833;&#30340;&#65292;&#20363;&#22914;&#65292;&#19968;&#20123;&#35821;&#38899;&#35270;&#39057;&#36890;&#20449;&#30340;&#24212;&#29992;&#20250;&#36873;&#25321;UDP&#21327;&#35758;&#12290;</p>
<h3>&#23567;&#32467;</h3>
<p>&#35745;&#31639;&#26426;&#32593;&#32476;&#30340;&#22522;&#26412;&#27010;&#24565;&#20027;&#35201;&#26377;&#65306;</p>
<ul>
<li>&#35745;&#31639;&#26426;&#32593;&#32476;&#65306;&#30001;&#20004;&#21488;&#25110;&#26356;&#22810;&#35745;&#31639;&#26426;&#32452;&#25104;&#30340;&#32593;&#32476;&#65307;</li>
<li>&#20114;&#32852;&#32593;&#65306;&#36830;&#25509;&#32593;&#32476;&#30340;&#32593;&#32476;&#65307;</li>
<li>IP&#22320;&#22336;&#65306;&#35745;&#31639;&#26426;&#30340;&#32593;&#32476;&#25509;&#21475;&#65288;&#36890;&#24120;&#26159;&#32593;&#21345;&#65289;&#22312;&#32593;&#32476;&#20013;&#30340;&#21807;&#19968;&#26631;&#35782;&#65307;</li>
<li>&#32593;&#20851;&#65306;&#36127;&#36131;&#36830;&#25509;&#22810;&#20010;&#32593;&#32476;&#65292;&#24182;&#22312;&#22810;&#20010;&#32593;&#32476;&#20043;&#38388;&#36716;&#21457;&#25968;&#25454;&#30340;&#35745;&#31639;&#26426;&#65292;&#36890;&#24120;&#26159;&#36335;&#30001;&#22120;&#25110;&#20132;&#25442;&#26426;&#65307;</li>
<li>&#32593;&#32476;&#21327;&#35758;&#65306;&#20114;&#32852;&#32593;&#20351;&#29992;TCP/IP&#21327;&#35758;&#65292;&#23427;&#27867;&#25351;&#20114;&#32852;&#32593;&#21327;&#35758;&#31751;&#65307;</li>
<li>IP&#21327;&#35758;&#65306;&#19968;&#31181;&#20998;&#32452;&#20132;&#25442;&#20256;&#36755;&#21327;&#35758;&#65307;</li>
<li>TCP&#21327;&#35758;&#65306;&#19968;&#31181;&#38754;&#21521;&#36830;&#25509;&#65292;&#21487;&#38752;&#20256;&#36755;&#30340;&#21327;&#35758;&#65307;</li>
<li>UDP&#21327;&#35758;&#65306;&#19968;&#31181;&#26080;&#36830;&#25509;&#65292;&#19981;&#21487;&#38752;&#20256;&#36755;&#30340;&#21327;&#35758;&#12290;</li>
</ul>
</div>

    <hr>

    <div class="x-wiki-prev-next uk-clearfix"></div>

    <div class="x-anchor x-comment-anchor"><a name="comments"></a></div>
							</div>
							<div id="x-content-bottom">
								<!-- __snippet__.contentBottom -->
								<div id="sponsor-a" class="uk-margin-bottom"></div>
								<!-- // __snippet__.contentBottom -->
							</div>
							<div id="x-content-comment">
								    <h3>Comments</h3>

    <ul id="x-comment-list" class="uk-comment-list">
    </ul>

    <h3>Make a comment</h3>

    <div class="x-display-if-not-signin">
        <p><button type="button" class="uk-button" onclick="showSignin()"><i class="uk-icon-signin"></i> Sign in to make a comment</button></p>
    </div>

    <div id="x-comment-area"></div>

							</div>
						</div>
											
