<div class="uk-flex-item-1" style="padding-left:15px; ">
							<div id="x-content-top">
								<!-- __snippet__.contentTop -->
																<!-- // __snippet__.contentTop -->
							</div>
							<div id="x-content">
								    <h4>JDBC&#31616;&#20171;</h4>
    <div class="x-wiki-info">
    	<span>Reads: 27732</span>
    	<a href="/manage/wiki/wikipage_update?id=1305152088703009" target="_blank" class="x-can-edit uk-text-danger">Edit</a>
</div>

    <hr>

    <div class="x-wiki-content x-main-content">
<p>&#22312;&#20171;&#32461;JDBC&#20043;&#21069;&#65292;&#25105;&#20204;&#20808;&#31616;&#21333;&#20171;&#32461;&#19968;&#19979;&#20851;&#31995;&#25968;&#25454;&#24211;&#12290;</p>
<p>&#31243;&#24207;&#36816;&#34892;&#30340;&#26102;&#20505;&#65292;&#25968;&#25454;&#37117;&#26159;&#22312;&#20869;&#23384;&#20013;&#30340;&#12290;&#24403;&#31243;&#24207;&#32456;&#27490;&#30340;&#26102;&#20505;&#65292;&#36890;&#24120;&#37117;&#38656;&#35201;&#23558;&#25968;&#25454;&#20445;&#23384;&#21040;&#30913;&#30424;&#19978;&#65292;&#26080;&#35770;&#26159;&#20445;&#23384;&#21040;&#26412;&#22320;&#30913;&#30424;&#65292;&#36824;&#26159;&#36890;&#36807;&#32593;&#32476;&#20445;&#23384;&#21040;&#26381;&#21153;&#22120;&#19978;&#65292;&#26368;&#32456;&#37117;&#20250;&#23558;&#25968;&#25454;&#20889;&#20837;&#30913;&#30424;&#25991;&#20214;&#12290;</p>
<p>&#32780;&#22914;&#20309;&#23450;&#20041;&#25968;&#25454;&#30340;&#23384;&#20648;&#26684;&#24335;&#23601;&#26159;&#19968;&#20010;&#22823;&#38382;&#39064;&#12290;&#22914;&#26524;&#25105;&#20204;&#33258;&#24049;&#26469;&#23450;&#20041;&#23384;&#20648;&#26684;&#24335;&#65292;&#27604;&#22914;&#20445;&#23384;&#19968;&#20010;&#29677;&#32423;&#25152;&#26377;&#23398;&#29983;&#30340;&#25104;&#32489;&#21333;&#65306;</p>
<table class="uk-table">
<tr>
<th>&#21517;&#23383;</th>
<th>&#25104;&#32489;</th>
</tr>
<tr>
<td>Michael</td>
<td>99</td>
</tr>
<tr>
<td>Bob</td>
<td>85</td>
</tr>
<tr>
<td>Bart</td>
<td>59</td>
</tr>
<tr>
<td>Lisa</td>
<td>87</td>
</tr>
</table>
<p>&#20320;&#21487;&#20197;&#29992;&#19968;&#20010;&#25991;&#26412;&#25991;&#20214;&#20445;&#23384;&#65292;&#19968;&#34892;&#20445;&#23384;&#19968;&#20010;&#23398;&#29983;&#65292;&#29992;<code>,</code>&#38548;&#24320;&#65306;</p>
<pre><code>Michael,99
Bob,85
Bart,59
Lisa,87
</code></pre>
<p>&#20320;&#36824;&#21487;&#20197;&#29992;JSON&#26684;&#24335;&#20445;&#23384;&#65292;&#20063;&#26159;&#25991;&#26412;&#25991;&#20214;&#65306;</p>
<pre><code>[
    {"name":"Michael","score":99},
    {"name":"Bob","score":85},
    {"name":"Bart","score":59},
    {"name":"Lisa","score":87}
]
</code></pre>
<p>&#20320;&#36824;&#21487;&#20197;&#23450;&#20041;&#21508;&#31181;&#20445;&#23384;&#26684;&#24335;&#65292;&#20294;&#26159;&#38382;&#39064;&#26469;&#20102;&#65306;</p>
<p>&#23384;&#20648;&#21644;&#35835;&#21462;&#38656;&#35201;&#33258;&#24049;&#23454;&#29616;&#65292;JSON&#36824;&#26159;&#26631;&#20934;&#65292;&#33258;&#24049;&#23450;&#20041;&#30340;&#26684;&#24335;&#23601;&#21508;&#24335;&#21508;&#26679;&#20102;&#65307;</p>
<p>&#19981;&#33021;&#20570;&#24555;&#36895;&#26597;&#35810;&#65292;&#21482;&#26377;&#25226;&#25968;&#25454;&#20840;&#37096;&#35835;&#21040;&#20869;&#23384;&#20013;&#25165;&#33021;&#33258;&#24049;&#36941;&#21382;&#65292;&#20294;&#26377;&#26102;&#20505;&#25968;&#25454;&#30340;&#22823;&#23567;&#36828;&#36828;&#36229;&#36807;&#20102;&#20869;&#23384;&#65288;&#27604;&#22914;&#34013;&#20809;&#30005;&#24433;&#65292;40GB&#30340;&#25968;&#25454;&#65289;&#65292;&#26681;&#26412;&#26080;&#27861;&#20840;&#37096;&#35835;&#20837;&#20869;&#23384;&#12290;</p>
<p>&#20026;&#20102;&#20415;&#20110;&#31243;&#24207;&#20445;&#23384;&#21644;&#35835;&#21462;&#25968;&#25454;&#65292;&#32780;&#19988;&#65292;&#33021;&#30452;&#25509;&#36890;&#36807;&#26465;&#20214;&#24555;&#36895;&#26597;&#35810;&#21040;&#25351;&#23450;&#30340;&#25968;&#25454;&#65292;&#23601;&#20986;&#29616;&#20102;&#25968;&#25454;&#24211;&#65288;Database&#65289;&#36825;&#31181;&#19987;&#38376;&#29992;&#20110;&#38598;&#20013;&#23384;&#20648;&#21644;&#26597;&#35810;&#30340;&#36719;&#20214;&#12290;</p>
<p>&#25968;&#25454;&#24211;&#36719;&#20214;&#35806;&#29983;&#30340;&#21382;&#21490;&#38750;&#24120;&#20037;&#36828;&#65292;&#26089;&#22312;1950&#24180;&#25968;&#25454;&#24211;&#23601;&#35806;&#29983;&#20102;&#12290;&#32463;&#21382;&#20102;&#32593;&#29366;&#25968;&#25454;&#24211;&#65292;&#23618;&#27425;&#25968;&#25454;&#24211;&#65292;&#25105;&#20204;&#29616;&#22312;&#24191;&#27867;&#20351;&#29992;&#30340;&#20851;&#31995;&#25968;&#25454;&#24211;&#26159;20&#19990;&#32426;70&#24180;&#20195;&#22522;&#20110;&#20851;&#31995;&#27169;&#22411;&#30340;&#22522;&#30784;&#19978;&#35806;&#29983;&#30340;&#12290;</p>
<p>&#20851;&#31995;&#27169;&#22411;&#26377;&#19968;&#22871;&#22797;&#26434;&#30340;&#25968;&#23398;&#29702;&#35770;&#65292;&#20294;&#26159;&#20174;&#27010;&#24565;&#19978;&#26159;&#21313;&#20998;&#23481;&#26131;&#29702;&#35299;&#30340;&#12290;&#20030;&#20010;&#23398;&#26657;&#30340;&#20363;&#23376;&#65306;</p>
<p>&#20551;&#35774;&#26576;&#20010;XX&#30465;YY&#24066;ZZ&#21439;&#31532;&#19968;&#23454;&#39564;&#23567;&#23398;&#26377;3&#20010;&#24180;&#32423;&#65292;&#35201;&#34920;&#31034;&#20986;&#36825;3&#20010;&#24180;&#32423;&#65292;&#21487;&#20197;&#22312;Excel&#20013;&#29992;&#19968;&#20010;&#34920;&#26684;&#30011;&#20986;&#26469;&#65306;</p>
<p><img src="/static/img/loading.svg" data-src="/files/attachments/946658275213632/0" alt="grade"></p>
<p>&#27599;&#20010;&#24180;&#32423;&#21448;&#26377;&#33509;&#24178;&#20010;&#29677;&#32423;&#65292;&#35201;&#25226;&#25152;&#26377;&#29677;&#32423;&#34920;&#31034;&#20986;&#26469;&#65292;&#21487;&#20197;&#22312;Excel&#20013;&#20877;&#30011;&#19968;&#20010;&#34920;&#26684;&#65306;</p>
<p><img src="/static/img/loading.svg" data-src="/files/attachments/946658306690400/0" alt="class"></p>
<p>&#36825;&#20004;&#20010;&#34920;&#26684;&#26377;&#20010;&#26144;&#23556;&#20851;&#31995;&#65292;&#23601;&#26159;&#26681;&#25454;Grade_ID&#21487;&#20197;&#22312;&#29677;&#32423;&#34920;&#20013;&#26597;&#25214;&#21040;&#23545;&#24212;&#30340;&#25152;&#26377;&#29677;&#32423;&#65306;</p>
<p><img src="/static/img/loading.svg" data-src="/files/attachments/946658423992288/0" alt="grade-classes"></p>
<p>&#20063;&#23601;&#26159;Grade&#34920;&#30340;&#27599;&#19968;&#34892;&#23545;&#24212;Class&#34920;&#30340;&#22810;&#34892;&#65292;&#22312;&#20851;&#31995;&#25968;&#25454;&#24211;&#20013;&#65292;&#36825;&#31181;&#22522;&#20110;&#34920;&#65288;Table&#65289;&#30340;&#19968;&#23545;&#22810;&#30340;&#20851;&#31995;&#23601;&#26159;&#20851;&#31995;&#25968;&#25454;&#24211;&#30340;&#22522;&#30784;&#12290;</p>
<p>&#26681;&#25454;&#26576;&#20010;&#24180;&#32423;&#30340;ID&#23601;&#21487;&#20197;&#26597;&#25214;&#25152;&#26377;&#29677;&#32423;&#30340;&#34892;&#65292;&#36825;&#31181;&#26597;&#35810;&#35821;&#21477;&#22312;&#20851;&#31995;&#25968;&#25454;&#24211;&#20013;&#31216;&#20026;SQL&#35821;&#21477;&#65292;&#21487;&#20197;&#20889;&#25104;&#65306;</p>
<pre><code>SELECT * FROM classes WHERE grade_id = '1';
</code></pre>
<p>&#32467;&#26524;&#20063;&#26159;&#19968;&#20010;&#34920;&#65306;</p>
<pre><code>---------+----------+----------
grade_id | class_id | name
---------+----------+----------
1        | 11       | &#19968;&#24180;&#32423;&#19968;&#29677;
---------+----------+----------
1        | 12       | &#19968;&#24180;&#32423;&#20108;&#29677;
---------+----------+----------
1        | 13       | &#19968;&#24180;&#32423;&#19977;&#29677;
---------+----------+----------
</code></pre>
<p>&#31867;&#20284;&#30340;&#65292;Class&#34920;&#30340;&#19968;&#34892;&#35760;&#24405;&#21448;&#21487;&#20197;&#20851;&#32852;&#21040;Student&#34920;&#30340;&#22810;&#34892;&#35760;&#24405;&#65306;</p>
<p><img src="/static/img/loading.svg" data-src="/files/attachments/946658709643776/0" alt="class-students"></p>
<p>&#30001;&#20110;&#26412;&#25945;&#31243;&#19981;&#28041;&#21450;&#21040;&#20851;&#31995;&#25968;&#25454;&#24211;&#30340;&#35814;&#32454;&#20869;&#23481;&#65292;&#22914;&#26524;&#20320;&#24819;&#20174;&#38646;&#23398;&#20064;&#20851;&#31995;&#25968;&#25454;&#24211;&#21644;&#22522;&#26412;&#30340;SQL&#35821;&#21477;&#65292;&#35831;&#21442;&#32771;<a href="/wiki/1177760294764384">SQL&#35838;&#31243;</a>&#12290;</p>
<h3>NoSQL</h3>
<p>&#20320;&#20063;&#35768;&#36824;&#21548;&#35828;&#36807;NoSQL&#25968;&#25454;&#24211;&#65292;&#24456;&#22810;NoSQL&#23459;&#20256;&#20854;&#36895;&#24230;&#21644;&#35268;&#27169;&#36828;&#36828;&#36229;&#36807;&#20851;&#31995;&#25968;&#25454;&#24211;&#65292;&#25152;&#20197;&#24456;&#22810;&#21516;&#23398;&#35273;&#24471;&#26377;&#20102;NoSQL&#26159;&#21542;&#23601;&#19981;&#38656;&#35201;SQL&#20102;&#21602;&#65311;&#21315;&#19975;&#19981;&#35201;&#34987;&#20182;&#20204;&#24573;&#24736;&#20102;&#65292;&#36830;SQL&#37117;&#19981;&#26126;&#30333;&#24590;&#20040;&#21487;&#33021;&#25630;&#26126;&#30333;NoSQL&#21602;&#65311;</p>
<h3>&#25968;&#25454;&#24211;&#31867;&#21035;</h3>
<p>&#26082;&#28982;&#25105;&#20204;&#35201;&#20351;&#29992;&#20851;&#31995;&#25968;&#25454;&#24211;&#65292;&#23601;&#24517;&#39035;&#36873;&#25321;&#19968;&#20010;&#20851;&#31995;&#25968;&#25454;&#24211;&#12290;&#30446;&#21069;&#24191;&#27867;&#20351;&#29992;&#30340;&#20851;&#31995;&#25968;&#25454;&#24211;&#20063;&#23601;&#36825;&#20040;&#20960;&#31181;&#65306;</p>
<p>&#20184;&#36153;&#30340;&#21830;&#29992;&#25968;&#25454;&#24211;&#65306;</p>
<ul>
<li>
<p>Oracle&#65292;&#20856;&#22411;&#30340;&#39640;&#23500;&#24069;&#65307;</p>
</li>
<li>
<p>SQL Server&#65292;&#24494;&#36719;&#33258;&#23478;&#20135;&#21697;&#65292;Windows&#23450;&#21046;&#19987;&#27454;&#65307;</p>
</li>
<li>
<p>DB2&#65292;IBM&#30340;&#20135;&#21697;&#65292;&#21548;&#36215;&#26469;&#25402;&#39640;&#31471;&#65307;</p>
</li>
<li>
<p>Sybase&#65292;&#26366;&#32463;&#36319;&#24494;&#36719;&#26159;&#22909;&#22522;&#21451;&#65292;&#21518;&#26469;&#20851;&#31995;&#30772;&#35010;&#65292;&#29616;&#22312;&#23478;&#22659;&#24808;&#28129;&#12290;</p>
</li>
</ul>
<p>&#36825;&#20123;&#25968;&#25454;&#24211;&#37117;&#26159;&#19981;&#24320;&#28304;&#32780;&#19988;&#20184;&#36153;&#30340;&#65292;&#26368;&#22823;&#30340;&#22909;&#22788;&#26159;&#33457;&#20102;&#38065;&#20986;&#20102;&#38382;&#39064;&#21487;&#20197;&#25214;&#21378;&#23478;&#35299;&#20915;&#65292;&#19981;&#36807;&#22312;Web&#30340;&#19990;&#30028;&#37324;&#65292;&#24120;&#24120;&#38656;&#35201;&#37096;&#32626;&#25104;&#21315;&#19978;&#19975;&#30340;&#25968;&#25454;&#24211;&#26381;&#21153;&#22120;&#65292;&#24403;&#28982;&#19981;&#33021;&#25226;&#22823;&#25226;&#22823;&#25226;&#30340;&#38134;&#23376;&#25172;&#32473;&#21378;&#23478;&#65292;&#25152;&#20197;&#65292;&#26080;&#35770;&#26159;Google&#12289;Facebook&#65292;&#36824;&#26159;&#22269;&#20869;&#30340;BAT&#65292;&#26080;&#19968;&#20363;&#22806;&#37117;&#36873;&#25321;&#20102;&#20813;&#36153;&#30340;&#24320;&#28304;&#25968;&#25454;&#24211;&#65306;</p>
<ul>
<li>
<p>MySQL&#65292;&#22823;&#23478;&#37117;&#22312;&#29992;&#65292;&#19968;&#33324;&#38169;&#19981;&#20102;&#65307;</p>
</li>
<li>
<p>PostgreSQL&#65292;&#23398;&#26415;&#27668;&#24687;&#26377;&#28857;&#37325;&#65292;&#20854;&#23454;&#25402;&#19981;&#38169;&#65292;&#20294;&#30693;&#21517;&#24230;&#27809;&#26377;MySQL&#39640;&#65307;</p>
</li>
<li>
<p>sqlite&#65292;&#23884;&#20837;&#24335;&#25968;&#25454;&#24211;&#65292;&#36866;&#21512;&#26700;&#38754;&#21644;&#31227;&#21160;&#24212;&#29992;&#12290;</p>
</li>
</ul>
<p>&#20316;&#20026;&#19968;&#20010;Java&#24037;&#31243;&#24072;&#65292;&#36873;&#25321;&#21738;&#20010;&#20813;&#36153;&#25968;&#25454;&#24211;&#21602;&#65311;&#24403;&#28982;&#26159;MySQL&#12290;&#22240;&#20026;MySQL&#26222;&#21450;&#29575;&#26368;&#39640;&#65292;&#20986;&#20102;&#38169;&#65292;&#21487;&#20197;&#24456;&#23481;&#26131;&#25214;&#21040;&#35299;&#20915;&#26041;&#27861;&#12290;&#32780;&#19988;&#65292;&#22260;&#32469;MySQL&#26377;&#19968;&#22823;&#22534;&#30417;&#25511;&#21644;&#36816;&#32500;&#30340;&#24037;&#20855;&#65292;&#23433;&#35013;&#21644;&#20351;&#29992;&#24456;&#26041;&#20415;&#12290;</p>
<h3>&#23433;&#35013;MySQL</h3>
<p>&#20026;&#20102;&#33021;&#32487;&#32493;&#21518;&#38754;&#30340;&#23398;&#20064;&#65292;&#20320;&#38656;&#35201;&#20174;MySQL&#23448;&#26041;&#32593;&#31449;&#19979;&#36733;&#24182;&#23433;&#35013;<a href="http://dev.mysql.com/downloads/mysql/">MySQL Community Server 5.6</a>&#65292;&#36825;&#20010;&#29256;&#26412;&#26159;&#20813;&#36153;&#30340;&#65292;&#20854;&#20182;&#39640;&#32423;&#29256;&#26412;&#26159;&#35201;&#25910;&#38065;&#30340;&#65288;&#35831;&#25918;&#24515;&#65292;&#25910;&#38065;&#30340;&#21151;&#33021;&#25105;&#20204;&#29992;&#19981;&#19978;&#65289;&#12290;MySQL&#26159;&#36328;&#24179;&#21488;&#30340;&#65292;&#36873;&#25321;&#23545;&#24212;&#30340;&#24179;&#21488;&#19979;&#36733;&#23433;&#35013;&#25991;&#20214;&#65292;&#23433;&#35013;&#21363;&#21487;&#12290;</p>
<p>&#23433;&#35013;&#26102;&#65292;MySQL&#20250;&#25552;&#31034;&#36755;&#20837;<code>root</code>&#29992;&#25143;&#30340;&#21475;&#20196;&#65292;&#35831;&#21153;&#24517;&#35760;&#28165;&#26970;&#12290;&#22914;&#26524;&#24597;&#35760;&#19981;&#20303;&#65292;&#23601;&#25226;&#21475;&#20196;&#35774;&#32622;&#20026;<code>password</code>&#12290;</p>
<p>&#22312;Windows&#19978;&#65292;&#23433;&#35013;&#26102;&#35831;&#36873;&#25321;<code>UTF-8</code>&#32534;&#30721;&#65292;&#20197;&#20415;&#27491;&#30830;&#22320;&#22788;&#29702;&#20013;&#25991;&#12290;</p>
<p>&#22312;Mac&#25110;Linux&#19978;&#65292;&#38656;&#35201;&#32534;&#36753;MySQL&#30340;&#37197;&#32622;&#25991;&#20214;&#65292;&#25226;&#25968;&#25454;&#24211;&#40664;&#35748;&#30340;&#32534;&#30721;&#20840;&#37096;&#25913;&#20026;UTF-8&#12290;MySQL&#30340;&#37197;&#32622;&#25991;&#20214;&#40664;&#35748;&#23384;&#25918;&#22312;<code>/etc/my.cnf</code>&#25110;&#32773;<code>/etc/mysql/my.cnf</code>&#65306;</p>
<pre><code>[client]
default-character-set = utf8

[mysqld]
default-storage-engine = INNODB
character-set-server = utf8
collation-server = utf8_general_ci
</code></pre>
<p>&#37325;&#21551;MySQL&#21518;&#65292;&#21487;&#20197;&#36890;&#36807;MySQL&#30340;&#23458;&#25143;&#31471;&#21629;&#20196;&#34892;&#26816;&#26597;&#32534;&#30721;&#65306;</p>
<pre><code>$ mysql -u root -p
Enter password: 
Welcome to the MySQL monitor...
...

mysql&gt; show variables like '%char%';
+--------------------------+--------------------------------------------------------+
| Variable_name            | Value                                                  |
+--------------------------+--------------------------------------------------------+
| character_set_client     | utf8                                                   |
| character_set_connection | utf8                                                   |
| character_set_database   | utf8                                                   |
| character_set_filesystem | binary                                                 |
| character_set_results    | utf8                                                   |
| character_set_server     | utf8                                                   |
| character_set_system     | utf8                                                   |
| character_sets_dir       | /usr/local/mysql-5.1.65-osx10.6-x86_64/share/charsets/ |
+--------------------------+--------------------------------------------------------+
8 rows in set (0.00 sec)
</code></pre>
<p>&#30475;&#21040;<code>utf8</code>&#23383;&#26679;&#23601;&#34920;&#31034;&#32534;&#30721;&#35774;&#32622;&#27491;&#30830;&#12290;</p>
<p><em>&#27880;</em>&#65306;&#22914;&#26524;MySQL&#30340;&#29256;&#26412;&#8805;5.5.3&#65292;&#21487;&#20197;&#25226;&#32534;&#30721;&#35774;&#32622;&#20026;<code>utf8mb4</code>&#65292;<code>utf8mb4</code>&#21644;<code>utf8</code>&#23436;&#20840;&#20860;&#23481;&#65292;&#20294;&#23427;&#25903;&#25345;&#26368;&#26032;&#30340;Unicode&#26631;&#20934;&#65292;&#21487;&#20197;&#26174;&#31034;emoji&#23383;&#31526;&#12290;</p>
<h3>JDBC</h3>
<p>&#20160;&#20040;&#26159;JDBC&#65311;JDBC&#26159;Java DataBase Connectivity&#30340;&#32553;&#20889;&#65292;&#23427;&#26159;Java&#31243;&#24207;&#35775;&#38382;&#25968;&#25454;&#24211;&#30340;&#26631;&#20934;&#25509;&#21475;&#12290;</p>
<p>&#20351;&#29992;Java&#31243;&#24207;&#35775;&#38382;&#25968;&#25454;&#24211;&#26102;&#65292;Java&#20195;&#30721;&#24182;&#19981;&#26159;&#30452;&#25509;&#36890;&#36807;TCP&#36830;&#25509;&#21435;&#35775;&#38382;&#25968;&#25454;&#24211;&#65292;&#32780;&#26159;&#36890;&#36807;JDBC&#25509;&#21475;&#26469;&#35775;&#38382;&#65292;&#32780;JDBC&#25509;&#21475;&#21017;&#36890;&#36807;JDBC&#39537;&#21160;&#26469;&#23454;&#29616;&#30495;&#27491;&#23545;&#25968;&#25454;&#24211;&#30340;&#35775;&#38382;&#12290;</p>
<p>&#20363;&#22914;&#65292;&#25105;&#20204;&#22312;Java&#20195;&#30721;&#20013;&#22914;&#26524;&#35201;&#35775;&#38382;MySQL&#65292;&#37027;&#20040;&#24517;&#39035;&#32534;&#20889;&#20195;&#30721;&#25805;&#20316;JDBC&#25509;&#21475;&#12290;&#27880;&#24847;&#21040;JDBC&#25509;&#21475;&#26159;Java&#26631;&#20934;&#24211;&#33258;&#24102;&#30340;&#65292;&#25152;&#20197;&#21487;&#20197;&#30452;&#25509;&#32534;&#35793;&#12290;&#32780;&#20855;&#20307;&#30340;JDBC&#39537;&#21160;&#26159;&#30001;&#25968;&#25454;&#24211;&#21378;&#21830;&#25552;&#20379;&#30340;&#65292;&#20363;&#22914;&#65292;MySQL&#30340;JDBC&#39537;&#21160;&#30001;Oracle&#25552;&#20379;&#12290;&#22240;&#27492;&#65292;&#35775;&#38382;&#26576;&#20010;&#20855;&#20307;&#30340;&#25968;&#25454;&#24211;&#65292;&#25105;&#20204;&#21482;&#38656;&#35201;&#24341;&#20837;&#35813;&#21378;&#21830;&#25552;&#20379;&#30340;JDBC&#39537;&#21160;&#65292;&#23601;&#21487;&#20197;&#36890;&#36807;JDBC&#25509;&#21475;&#26469;&#35775;&#38382;&#65292;&#36825;&#26679;&#20445;&#35777;&#20102;Java&#31243;&#24207;&#32534;&#20889;&#30340;&#26159;&#19968;&#22871;&#25968;&#25454;&#24211;&#35775;&#38382;&#20195;&#30721;&#65292;&#21364;&#21487;&#20197;&#35775;&#38382;&#21508;&#31181;&#19981;&#21516;&#30340;&#25968;&#25454;&#24211;&#65292;&#22240;&#20026;&#20182;&#20204;&#37117;&#25552;&#20379;&#20102;&#26631;&#20934;&#30340;JDBC&#39537;&#21160;&#65306;</p>
<pre><code class="language-ascii">&#9484; &#9472; &#9472; &#9472; &#9472; &#9472; &#9472; &#9472; &#9472; &#9472; &#9472; &#9488;

&#9474;  &#9484;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9488;  &#9474;
   &#9474;   Java App    &#9474;
&#9474;  &#9492;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9496;  &#9474;
           &#9474;
&#9474;          &#9660;          &#9474;
   &#9484;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9488;
&#9474;  &#9474;JDBC Interface &#9474;&lt;&#9472;&#9532;&#9472;&#9472;&#9472; JDK
   &#9492;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9496;
&#9474;          &#9474;          &#9474;
           &#9660;
&#9474;  &#9484;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9488;  &#9474;
   &#9474;  JDBC Driver  &#9474;&lt;&#9472;&#9472;&#9472;&#9472;&#9472; Vendor
&#9474;  &#9492;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9496;  &#9474;
           &#9474;
&#9492; &#9472; &#9472; &#9472; &#9472; &#9472;&#9474;&#9472; &#9472; &#9472; &#9472; &#9472; &#9496;
           &#9660;
   &#9484;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9488;
   &#9474;   Database    &#9474;
   &#9492;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9496;
</code></pre>
<p>&#20174;&#20195;&#30721;&#26469;&#30475;&#65292;Java&#26631;&#20934;&#24211;&#33258;&#24102;&#30340;JDBC&#25509;&#21475;&#20854;&#23454;&#23601;&#26159;&#23450;&#20041;&#20102;&#19968;&#32452;&#25509;&#21475;&#65292;&#32780;&#26576;&#20010;&#20855;&#20307;&#30340;JDBC&#39537;&#21160;&#20854;&#23454;&#23601;&#26159;&#23454;&#29616;&#20102;&#36825;&#20123;&#25509;&#21475;&#30340;&#31867;&#65306;</p>
<pre><code class="language-ascii">&#9484; &#9472; &#9472; &#9472; &#9472; &#9472; &#9472; &#9472; &#9472; &#9472; &#9472; &#9488;

&#9474;  &#9484;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9488;  &#9474;
   &#9474;   Java App    &#9474;
&#9474;  &#9492;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9496;  &#9474;
           &#9474;
&#9474;          &#9660;          &#9474;
   &#9484;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9488;
&#9474;  &#9474;JDBC Interface &#9474;&lt;&#9472;&#9532;&#9472;&#9472;&#9472; JDK
   &#9492;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9496;
&#9474;          &#9474;          &#9474;
           &#9660;
&#9474;  &#9484;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9488;  &#9474;
   &#9474; MySQL Driver  &#9474;&lt;&#9472;&#9472;&#9472;&#9472;&#9472; Oracle
&#9474;  &#9492;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9496;  &#9474;
           &#9474;
&#9492; &#9472; &#9472; &#9472; &#9472; &#9472;&#9474;&#9472; &#9472; &#9472; &#9472; &#9472; &#9496;
           &#9660;
   &#9484;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9488;
   &#9474;     MySQL     &#9474;
   &#9492;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9496;
</code></pre>
<p>&#23454;&#38469;&#19978;&#65292;&#19968;&#20010;MySQL&#30340;JDBC&#30340;&#39537;&#21160;&#23601;&#26159;&#19968;&#20010;jar&#21253;&#65292;&#23427;&#26412;&#36523;&#20063;&#26159;&#32431;Java&#32534;&#20889;&#30340;&#12290;&#25105;&#20204;&#33258;&#24049;&#32534;&#20889;&#30340;&#20195;&#30721;&#21482;&#38656;&#35201;&#24341;&#29992;Java&#26631;&#20934;&#24211;&#25552;&#20379;&#30340;java.sql&#21253;&#19979;&#38754;&#30340;&#30456;&#20851;&#25509;&#21475;&#65292;&#30001;&#27492;&#20877;&#38388;&#25509;&#22320;&#36890;&#36807;MySQL&#39537;&#21160;&#30340;jar&#21253;&#36890;&#36807;&#32593;&#32476;&#35775;&#38382;MySQL&#26381;&#21153;&#22120;&#65292;&#25152;&#26377;&#22797;&#26434;&#30340;&#32593;&#32476;&#36890;&#35759;&#37117;&#34987;&#23553;&#35013;&#21040;JDBC&#39537;&#21160;&#20013;&#65292;&#22240;&#27492;&#65292;Java&#31243;&#24207;&#26412;&#36523;&#21482;&#38656;&#35201;&#24341;&#20837;&#19968;&#20010;MySQL&#39537;&#21160;&#30340;jar&#21253;&#23601;&#21487;&#20197;&#27491;&#24120;&#35775;&#38382;MySQL&#26381;&#21153;&#22120;&#65306;</p>
<pre><code class="language-ascii">&#9484; &#9472; &#9472; &#9472; &#9472; &#9472; &#9472; &#9472; &#9472; &#9472; &#9472; &#9488;
   &#9484;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9488;
&#9474;  &#9474;   App.class   &#9474;  &#9474;
   &#9492;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9496;
&#9474;          &#9474;          &#9474;
           &#9660;
&#9474;  &#9484;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9488;  &#9474;
   &#9474;  java.sql.*   &#9474;
&#9474;  &#9492;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9496;  &#9474;
           &#9474;
&#9474;          &#9660;          &#9474;
   &#9484;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9488;     TCP    &#9484;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9488;
&#9474;  &#9474; mysql-xxx.jar &#9474;&#9472;&#9472;&#9532;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&gt;&#9474;     MySQL     &#9474;
   &#9492;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9496;            &#9492;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9496;
&#9492; &#9472; &#9472; &#9472; &#9472; &#9472; &#9472; &#9472; &#9472; &#9472; &#9472; &#9496;
          JVM
</code></pre>
<h3>&#23567;&#32467;</h3>
<p>&#20351;&#29992;JDBC&#30340;&#22909;&#22788;&#26159;&#65306;</p>
<ul>
<li>
<p>&#21508;&#25968;&#25454;&#24211;&#21378;&#21830;&#20351;&#29992;&#30456;&#21516;&#30340;&#25509;&#21475;&#65292;Java&#20195;&#30721;&#19981;&#38656;&#35201;&#38024;&#23545;&#19981;&#21516;&#25968;&#25454;&#24211;&#20998;&#21035;&#24320;&#21457;&#65307;</p>
</li>
<li>
<p>Java&#31243;&#24207;&#32534;&#35793;&#26399;&#20165;&#20381;&#36182;java.sql&#21253;&#65292;&#19981;&#20381;&#36182;&#20855;&#20307;&#25968;&#25454;&#24211;&#30340;jar&#21253;&#65307;</p>
</li>
<li>
<p>&#21487;&#38543;&#26102;&#26367;&#25442;&#24213;&#23618;&#25968;&#25454;&#24211;&#65292;&#35775;&#38382;&#25968;&#25454;&#24211;&#30340;Java&#20195;&#30721;&#22522;&#26412;&#19981;&#21464;&#12290;</p>
</li>
</ul>
</div>

    <hr>

    <div class="x-wiki-prev-next uk-clearfix"></div>

    <div class="x-anchor x-comment-anchor"><a name="comments"></a></div>
							</div>
							<div id="x-content-bottom">
								<!-- __snippet__.contentBottom -->
								<div id="sponsor-a" class="uk-margin-bottom"></div>
								<!-- // __snippet__.contentBottom -->
							</div>
							<div id="x-content-comment">
								    <h3>Comments</h3>

    <ul id="x-comment-list" class="uk-comment-list">
    </ul>

    <h3>Make a comment</h3>

    <div class="x-display-if-not-signin">
        <p><button type="button" class="uk-button" onclick="showSignin()"><i class="uk-icon-signin"></i> Sign in to make a comment</button></p>
    </div>

    <div id="x-comment-area"></div>

							</div>
						</div>
											
