<div class="uk-flex-item-1" style="padding-left:15px; ">
							<div id="x-content-top">
								<!-- __snippet__.contentTop -->
																<!-- // __snippet__.contentTop -->
							</div>
							<div id="x-content">
								    <h4>&#20989;&#25968;&#24335;&#32534;&#31243;</h4>
    <div class="x-wiki-info">
    	<span>Reads: 20570</span>
    	<a href="/manage/wiki/wikipage_update?id=1255943847278976" target="_blank" class="x-can-edit uk-text-danger">Edit</a>
</div>

    <hr>

    <div class="x-wiki-content x-main-content">
<p>&#26412;&#31456;&#25105;&#20204;&#20171;&#32461;Java&#30340;&#20989;&#25968;&#24335;&#32534;&#31243;&#12290;</p>
<p>&#25105;&#20204;&#20808;&#30475;&#30475;&#20160;&#20040;&#26159;&#20989;&#25968;&#12290;&#20989;&#25968;&#26159;&#19968;&#31181;&#26368;&#22522;&#26412;&#30340;&#20219;&#21153;&#65292;&#19968;&#20010;&#22823;&#22411;&#31243;&#24207;&#23601;&#26159;&#19968;&#20010;&#39030;&#23618;&#20989;&#25968;&#35843;&#29992;&#33509;&#24178;&#24213;&#23618;&#20989;&#25968;&#65292;&#36825;&#20123;&#34987;&#35843;&#29992;&#30340;&#20989;&#25968;&#21448;&#21487;&#20197;&#35843;&#29992;&#20854;&#20182;&#20989;&#25968;&#65292;&#21363;&#22823;&#20219;&#21153;&#34987;&#19968;&#23618;&#23618;&#25286;&#35299;&#24182;&#25191;&#34892;&#12290;&#25152;&#20197;&#20989;&#25968;&#23601;&#26159;&#38754;&#21521;&#36807;&#31243;&#30340;&#31243;&#24207;&#35774;&#35745;&#30340;&#22522;&#26412;&#21333;&#20803;&#12290;</p>
<p>Java&#19981;&#25903;&#25345;&#21333;&#29420;&#23450;&#20041;&#20989;&#25968;&#65292;&#20294;&#21487;&#20197;&#25226;&#38745;&#24577;&#26041;&#27861;&#35270;&#20026;&#29420;&#31435;&#30340;&#20989;&#25968;&#65292;&#25226;&#23454;&#20363;&#26041;&#27861;&#35270;&#20026;&#33258;&#24102;<code>this</code>&#21442;&#25968;&#30340;&#20989;&#25968;&#12290;</p>
<p>&#32780;&#20989;&#25968;&#24335;&#32534;&#31243;&#65288;&#35831;&#27880;&#24847;&#22810;&#20102;&#19968;&#20010;&#8220;&#24335;&#8221;&#23383;&#65289;&#8212;&#8212;Functional Programming&#65292;&#34429;&#28982;&#20063;&#21487;&#20197;&#24402;&#32467;&#21040;&#38754;&#21521;&#36807;&#31243;&#30340;&#31243;&#24207;&#35774;&#35745;&#65292;&#20294;&#20854;&#24605;&#24819;&#26356;&#25509;&#36817;&#25968;&#23398;&#35745;&#31639;&#12290;</p>
<p>&#25105;&#20204;&#39318;&#20808;&#35201;&#25630;&#26126;&#30333;&#35745;&#31639;&#26426;&#65288;Computer&#65289;&#21644;&#35745;&#31639;&#65288;Compute&#65289;&#30340;&#27010;&#24565;&#12290;</p>
<p>&#22312;&#35745;&#31639;&#26426;&#30340;&#23618;&#27425;&#19978;&#65292;CPU&#25191;&#34892;&#30340;&#26159;&#21152;&#20943;&#20056;&#38500;&#30340;&#25351;&#20196;&#20195;&#30721;&#65292;&#20197;&#21450;&#21508;&#31181;&#26465;&#20214;&#21028;&#26029;&#21644;&#36339;&#36716;&#25351;&#20196;&#65292;&#25152;&#20197;&#65292;&#27719;&#32534;&#35821;&#35328;&#26159;&#26368;&#36148;&#36817;&#35745;&#31639;&#26426;&#30340;&#35821;&#35328;&#12290;</p>
<p>&#32780;&#35745;&#31639;&#21017;&#25351;&#25968;&#23398;&#24847;&#20041;&#19978;&#30340;&#35745;&#31639;&#65292;&#36234;&#26159;&#25277;&#35937;&#30340;&#35745;&#31639;&#65292;&#31163;&#35745;&#31639;&#26426;&#30828;&#20214;&#36234;&#36828;&#12290;</p>
<p>&#23545;&#24212;&#21040;&#32534;&#31243;&#35821;&#35328;&#65292;&#23601;&#26159;&#36234;&#20302;&#32423;&#30340;&#35821;&#35328;&#65292;&#36234;&#36148;&#36817;&#35745;&#31639;&#26426;&#65292;&#25277;&#35937;&#31243;&#24230;&#20302;&#65292;&#25191;&#34892;&#25928;&#29575;&#39640;&#65292;&#27604;&#22914;C&#35821;&#35328;&#65307;&#36234;&#39640;&#32423;&#30340;&#35821;&#35328;&#65292;&#36234;&#36148;&#36817;&#35745;&#31639;&#65292;&#25277;&#35937;&#31243;&#24230;&#39640;&#65292;&#25191;&#34892;&#25928;&#29575;&#20302;&#65292;&#27604;&#22914;Lisp&#35821;&#35328;&#12290;</p>
<p>&#20989;&#25968;&#24335;&#32534;&#31243;&#23601;&#26159;&#19968;&#31181;&#25277;&#35937;&#31243;&#24230;&#24456;&#39640;&#30340;&#32534;&#31243;&#33539;&#24335;&#65292;&#32431;&#31929;&#30340;&#20989;&#25968;&#24335;&#32534;&#31243;&#35821;&#35328;&#32534;&#20889;&#30340;&#20989;&#25968;&#27809;&#26377;&#21464;&#37327;&#65292;&#22240;&#27492;&#65292;&#20219;&#24847;&#19968;&#20010;&#20989;&#25968;&#65292;&#21482;&#35201;&#36755;&#20837;&#26159;&#30830;&#23450;&#30340;&#65292;&#36755;&#20986;&#23601;&#26159;&#30830;&#23450;&#30340;&#65292;&#36825;&#31181;&#32431;&#20989;&#25968;&#25105;&#20204;&#31216;&#20043;&#20026;&#27809;&#26377;&#21103;&#20316;&#29992;&#12290;&#32780;&#20801;&#35768;&#20351;&#29992;&#21464;&#37327;&#30340;&#31243;&#24207;&#35774;&#35745;&#35821;&#35328;&#65292;&#30001;&#20110;&#20989;&#25968;&#20869;&#37096;&#30340;&#21464;&#37327;&#29366;&#24577;&#19981;&#30830;&#23450;&#65292;&#21516;&#26679;&#30340;&#36755;&#20837;&#65292;&#21487;&#33021;&#24471;&#21040;&#19981;&#21516;&#30340;&#36755;&#20986;&#65292;&#22240;&#27492;&#65292;&#36825;&#31181;&#20989;&#25968;&#26159;&#26377;&#21103;&#20316;&#29992;&#30340;&#12290;</p>
<p>&#20989;&#25968;&#24335;&#32534;&#31243;&#30340;&#19968;&#20010;&#29305;&#28857;&#23601;&#26159;&#65292;&#20801;&#35768;&#25226;&#20989;&#25968;&#26412;&#36523;&#20316;&#20026;&#21442;&#25968;&#20256;&#20837;&#21478;&#19968;&#20010;&#20989;&#25968;&#65292;&#36824;&#20801;&#35768;&#36820;&#22238;&#19968;&#20010;&#20989;&#25968;&#65281;</p>
<p>&#20989;&#25968;&#24335;&#32534;&#31243;&#26368;&#26089;&#26159;&#25968;&#23398;&#23478;<a href="https://zh.wikipedia.org/wiki/%E9%98%BF%E9%9A%86%E4%BD%90%C2%B7%E9%82%B1%E5%A5%87">&#38463;&#38534;&#20304;&#183;&#37041;&#22855;</a>&#30740;&#31350;&#30340;&#19968;&#22871;&#20989;&#25968;&#21464;&#25442;&#36923;&#36753;&#65292;&#21448;&#31216;Lambda Calculus&#65288;&#955;-Calculus&#65289;&#65292;&#25152;&#20197;&#20063;&#32463;&#24120;&#25226;&#20989;&#25968;&#24335;&#32534;&#31243;&#31216;&#20026;Lambda&#35745;&#31639;&#12290;</p>
<p>Java&#24179;&#21488;&#20174;Java 8&#24320;&#22987;&#65292;&#25903;&#25345;&#20989;&#25968;&#24335;&#32534;&#31243;&#12290;</p>
<p><img src="/static/img/loading.svg" data-src="/files/attachments/1262036445094400/l" alt="java-lambda"></p>
</div>

    <hr>

    <div class="x-wiki-prev-next uk-clearfix"></div>

    <div class="x-anchor x-comment-anchor"><a name="comments"></a></div>
							</div>
							<div id="x-content-bottom">
								<!-- __snippet__.contentBottom -->
								<div id="sponsor-a" class="uk-margin-bottom"></div>
								<!-- // __snippet__.contentBottom -->
							</div>
							<div id="x-content-comment">
								    <h3>Comments</h3>

    <ul id="x-comment-list" class="uk-comment-list">
    </ul>

    <h3>Make a comment</h3>

    <div class="x-display-if-not-signin">
        <p><button type="button" class="uk-button" onclick="showSignin()"><i class="uk-icon-signin"></i> Sign in to make a comment</button></p>
    </div>

    <div id="x-comment-area"></div>

							</div>
						</div>
											
