<div class="uk-flex-item-1" style="padding-left:15px; ">
							<div id="x-content-top">
								<!-- __snippet__.contentTop -->
																<!-- // __snippet__.contentTop -->
							</div>
							<div id="x-content">
								    <h4>&#26725;&#25509;</h4>
    <div class="x-wiki-info">
    	<span>Reads: 797</span>
    	<a href="/manage/wiki/wikipage_update?id=1281319266943009" target="_blank" class="x-can-edit uk-text-danger">Edit</a>
</div>

    <hr>

    <div class="x-wiki-content x-main-content">
<blockquote>
<p>&#23558;&#25277;&#35937;&#37096;&#20998;&#19982;&#23427;&#30340;&#23454;&#29616;&#37096;&#20998;&#20998;&#31163;&#65292;&#20351;&#23427;&#20204;&#37117;&#21487;&#20197;&#29420;&#31435;&#22320;&#21464;&#21270;&#12290;</p>
</blockquote>
<p>&#26725;&#25509;&#27169;&#24335;&#30340;&#23450;&#20041;&#38750;&#24120;&#29572;&#20046;&#65292;&#30452;&#25509;&#29702;&#35299;&#19981;&#22826;&#23481;&#26131;&#65292;&#25152;&#20197;&#25105;&#20204;&#36824;&#26159;&#20030;&#20363;&#23376;&#12290;</p>
<p>&#20551;&#35774;&#26576;&#20010;&#27773;&#36710;&#21378;&#21830;&#29983;&#20135;&#19977;&#31181;&#21697;&#29260;&#30340;&#27773;&#36710;&#65306;Big&#12289;Tiny&#21644;Boss&#65292;&#27599;&#31181;&#21697;&#29260;&#21448;&#21487;&#20197;&#36873;&#25321;&#29123;&#27833;&#12289;&#32431;&#30005;&#21644;&#28151;&#21512;&#21160;&#21147;&#12290;&#22914;&#26524;&#29992;&#20256;&#32479;&#30340;&#32487;&#25215;&#26469;&#34920;&#31034;&#21508;&#20010;&#26368;&#32456;&#36710;&#22411;&#65292;&#19968;&#20849;&#26377;3&#20010;&#25277;&#35937;&#31867;&#21152;9&#20010;&#26368;&#32456;&#23376;&#31867;&#65306;</p>
<pre><code class="language-ascii">                   &#9484;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9488;
                   &#9474;  Car  &#9474;
                   &#9492;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9496;
                       &#9650;
    &#9484;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9532;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9488;
    &#9474;                  &#9474;                   &#9474;
&#9484;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9488;          &#9484;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9488;          &#9484;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9488;
&#9474;BigCar &#9474;          &#9474;TinyCar&#9474;          &#9474;BossCar&#9474;
&#9492;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9496;          &#9492;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9496;          &#9492;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9496;
    &#9650;                  &#9650;                  &#9650;
    &#9474;                  &#9474;                  &#9474;
    &#9474; &#9484;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9488;&#9474; &#9484;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9488;&#9474; &#9484;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9488;
    &#9500;&#9472;&#9474;  BigFuelCar   &#9474;&#9500;&#9472;&#9474;  TinyFuelCar  &#9474;&#9500;&#9472;&#9474;  BossFuelCar  &#9474;
    &#9474; &#9492;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9496;&#9474; &#9492;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9496;&#9474; &#9492;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9496;
    &#9474; &#9484;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9488;&#9474; &#9484;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9488;&#9474; &#9484;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9488;
    &#9500;&#9472;&#9474;BigElectricCar &#9474;&#9500;&#9472;&#9474;TinyElectricCar&#9474;&#9500;&#9472;&#9474;BossElectricCar&#9474;
    &#9474; &#9492;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9496;&#9474; &#9492;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9496;&#9474; &#9492;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9496;
    &#9474; &#9484;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9488;&#9474; &#9484;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9488;&#9474; &#9484;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9488;
    &#9492;&#9472;&#9474; BigHybridCar  &#9474;&#9492;&#9472;&#9474; TinyHybridCar &#9474;&#9492;&#9472;&#9474; BossHybridCar &#9474;
      &#9492;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9496;  &#9492;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9496;  &#9492;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9496;
</code></pre>
<p>&#22914;&#26524;&#35201;&#26032;&#22686;&#19968;&#20010;&#21697;&#29260;&#65292;&#25110;&#32773;&#21152;&#19968;&#20010;&#26032;&#30340;&#24341;&#25806;&#65288;&#27604;&#22914;&#26680;&#21160;&#21147;&#65289;&#65292;&#37027;&#20040;&#23376;&#31867;&#30340;&#25968;&#37327;&#22686;&#38271;&#26356;&#24555;&#12290;</p>
<p>&#25152;&#20197;&#65292;&#26725;&#25509;&#27169;&#24335;&#23601;&#26159;&#20026;&#20102;&#36991;&#20813;&#30452;&#25509;&#32487;&#25215;&#24102;&#26469;&#30340;&#23376;&#31867;&#29190;&#28856;&#12290;</p>
<p>&#25105;&#20204;&#26469;&#30475;&#30475;&#26725;&#25509;&#27169;&#24335;&#22914;&#20309;&#35299;&#20915;&#19978;&#36848;&#38382;&#39064;&#12290;</p>
<p>&#22312;&#26725;&#25509;&#27169;&#24335;&#20013;&#65292;&#39318;&#20808;&#25226;<code>Car</code>&#25353;&#21697;&#29260;&#36827;&#34892;&#23376;&#31867;&#21270;&#65292;&#20294;&#26159;&#65292;&#27599;&#20010;&#21697;&#29260;&#36873;&#25321;&#20160;&#20040;&#21457;&#21160;&#26426;&#65292;&#19981;&#20877;&#20351;&#29992;&#23376;&#31867;&#25193;&#20805;&#65292;&#32780;&#26159;&#36890;&#36807;&#19968;&#20010;&#25277;&#35937;&#30340;&#8220;&#20462;&#27491;&#8221;&#31867;&#65292;&#20197;&#32452;&#21512;&#30340;&#24418;&#24335;&#24341;&#20837;&#12290;&#25105;&#20204;&#26469;&#30475;&#30475;&#20855;&#20307;&#30340;&#23454;&#29616;&#12290;</p>
<p>&#39318;&#20808;&#23450;&#20041;&#25277;&#35937;&#31867;<code>Car</code>&#65292;&#23427;&#24341;&#29992;&#19968;&#20010;<code>Engine</code>&#65306;</p>
<pre><code>public abstract class Car {
    // &#24341;&#29992;Engine:
    protected Engine engine;

    public Car(Engine engine) {
        this.engine = engine;
    }

    public abstract void drive();
}
</code></pre>
<p><code>Engine</code>&#30340;&#23450;&#20041;&#22914;&#19979;&#65306;</p>
<pre><code>public interface Engine {
    void start();
}
</code></pre>
<p>&#32039;&#25509;&#30528;&#65292;&#22312;&#19968;&#20010;&#8220;&#20462;&#27491;&#8221;&#30340;&#25277;&#35937;&#31867;<code>RefinedCar</code>&#20013;&#23450;&#20041;&#19968;&#20123;&#39069;&#22806;&#25805;&#20316;&#65306;</p>
<pre><code>public abstract class RefinedCar extends Car {
    public RefinedCar(Engine engine) {
        super(engine);
    }

    public void drive() {
        this.engine.start();
        System.out.println("Drive " + getBrand() + " car...");
    }

    public abstract String getBrand();
}
</code></pre>
<p>&#36825;&#26679;&#19968;&#26469;&#65292;&#26368;&#32456;&#30340;&#19981;&#21516;&#21697;&#29260;&#32487;&#25215;&#33258;<code>RefinedCar</code>&#65292;&#20363;&#22914;<code>BossCar</code>&#65306;</p>
<pre><code>public class BossCar extends RefinedCar {
    public BossCar(Engine engine) {
        super(engine);
    }

    public String getBrand() {
        return "Boss";
    }
}
</code></pre>
<p>&#32780;&#38024;&#23545;&#27599;&#19968;&#31181;&#24341;&#25806;&#65292;&#32487;&#25215;&#33258;<code>Engine</code>&#65292;&#20363;&#22914;<code>HybridEngine</code>&#65306;</p>
<pre><code>public class HybridEngine implements Engine {
    public void start() {
        System.out.println("Start Hybrid Engine...");
    }
}
</code></pre>
<p>&#23458;&#25143;&#31471;&#36890;&#36807;&#33258;&#24049;&#36873;&#25321;&#19968;&#20010;&#21697;&#29260;&#65292;&#20877;&#37197;&#21512;&#19968;&#31181;&#24341;&#25806;&#65292;&#24471;&#21040;&#26368;&#32456;&#30340;Car&#65306;</p>
<pre><code>RefinedCar car = new BossCar(new HybridEngine());
car.drive();
</code></pre>
<p>&#20351;&#29992;&#26725;&#25509;&#27169;&#24335;&#30340;&#22909;&#22788;&#22312;&#20110;&#65292;&#22914;&#26524;&#35201;&#22686;&#21152;&#19968;&#31181;&#24341;&#25806;&#65292;&#21482;&#38656;&#35201;&#38024;&#23545;<code>Engine</code>&#27966;&#29983;&#19968;&#20010;&#26032;&#30340;&#23376;&#31867;&#65292;&#22914;&#26524;&#35201;&#22686;&#21152;&#19968;&#20010;&#21697;&#29260;&#65292;&#21482;&#38656;&#35201;&#38024;&#23545;<code>RefinedCar</code>&#27966;&#29983;&#19968;&#20010;&#23376;&#31867;&#65292;&#20219;&#20309;<code>RefinedCar</code>&#30340;&#23376;&#31867;&#37117;&#21487;&#20197;&#21644;&#20219;&#20309;&#19968;&#31181;<code>Engine</code>&#33258;&#30001;&#32452;&#21512;&#65292;&#21363;&#19968;&#36742;&#27773;&#36710;&#30340;&#20004;&#20010;&#32500;&#24230;&#65306;&#21697;&#29260;&#21644;&#24341;&#25806;&#37117;&#21487;&#20197;&#29420;&#31435;&#22320;&#21464;&#21270;&#12290;</p>
<pre><code class="language-ascii">       &#9484;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9488;
       &#9474;    Car    &#9474;
       &#9492;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9496;
             &#9650;
             &#9474;
       &#9484;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9488;       &#9484;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9488;
       &#9474;RefinedCar &#9474; &#9472; &#9472; &#9472;&gt;&#9474; Engine  &#9474;
       &#9492;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9496;       &#9492;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9496;
             &#9650;                  &#9650;
    &#9484;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9532;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9488;         &#9474; &#9484;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9488;
    &#9474;        &#9474;        &#9474;         &#9500;&#9472;&#9474;  FuelEngine  &#9474;
&#9484;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9488;&#9484;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9488;&#9484;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9488;     &#9474; &#9492;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9496;
&#9474;BigCar &#9474;&#9474;TinyCar&#9474;&#9474;BossCar&#9474;     &#9474; &#9484;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9488;
&#9492;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9496;&#9492;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9496;&#9492;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9496;     &#9500;&#9472;&#9474;ElectricEngine&#9474;
                                &#9474; &#9492;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9496;
                                &#9474; &#9484;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9488;
                                &#9492;&#9472;&#9474; HybridEngine &#9474;
                                  &#9492;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9496;
</code></pre>
<p>&#26725;&#25509;&#27169;&#24335;&#23454;&#29616;&#27604;&#36739;&#22797;&#26434;&#65292;&#23454;&#38469;&#24212;&#29992;&#20063;&#38750;&#24120;&#23569;&#65292;&#20294;&#23427;&#25552;&#20379;&#30340;&#35774;&#35745;&#24605;&#24819;&#20540;&#24471;&#20511;&#37492;&#65292;&#21363;&#19981;&#35201;&#36807;&#24230;&#20351;&#29992;&#32487;&#25215;&#65292;&#32780;&#26159;&#20248;&#20808;&#25286;&#20998;&#26576;&#20123;&#37096;&#20214;&#65292;&#20351;&#29992;&#32452;&#21512;&#30340;&#26041;&#24335;&#26469;&#25193;&#23637;&#21151;&#33021;&#12290;</p>
<h3>&#32451;&#20064;</h3>
<p>&#20351;&#29992;&#26725;&#25509;&#27169;&#24335;&#25193;&#23637;&#19968;&#31181;&#26032;&#30340;&#21697;&#29260;&#21644;&#26032;&#30340;&#26680;&#21160;&#21147;&#24341;&#25806;&#12290;</p>
<p><a href="https://gitee.com/liaoxuefeng/learn-java/raw/master/practices/Java%E6%95%99%E7%A8%8B/190.%E8%AE%BE%E8%AE%A1%E6%A8%A1%E5%BC%8F.1264742167474528/20.%E7%BB%93%E6%9E%84%E5%9E%8B%E6%A8%A1%E5%BC%8F.1281319233388578/20.%E6%A1%A5%E6%8E%A5.1281319266943009/pattern-bridge.zip">&#26725;&#25509;&#27169;&#24335;&#32451;&#20064;</a></p>
<h3>&#23567;&#32467;</h3>
<p>&#26725;&#25509;&#27169;&#24335;&#36890;&#36807;&#20998;&#31163;&#19968;&#20010;&#25277;&#35937;&#25509;&#21475;&#21644;&#23427;&#30340;&#23454;&#29616;&#37096;&#20998;&#65292;&#20351;&#24471;&#35774;&#35745;&#21487;&#20197;&#25353;&#20004;&#20010;&#32500;&#24230;&#29420;&#31435;&#25193;&#23637;&#12290;</p>
</div>

    <hr>

    <div class="x-wiki-prev-next uk-clearfix"></div>

    <div class="x-anchor x-comment-anchor"><a name="comments"></a></div>
							</div>
							<div id="x-content-bottom">
								<!-- __snippet__.contentBottom -->
								<div id="sponsor-a" class="uk-margin-bottom"></div>
								<!-- // __snippet__.contentBottom -->
							</div>
							<div id="x-content-comment">
								    <h3>Comments</h3>

    <ul id="x-comment-list" class="uk-comment-list">
    </ul>

    <h3>Make a comment</h3>

    <div class="x-display-if-not-signin">
        <p><button type="button" class="uk-button" onclick="showSignin()"><i class="uk-icon-signin"></i> Sign in to make a comment</button></p>
    </div>

    <div id="x-comment-area"></div>

							</div>
						</div>
											
