<div class="uk-flex-item-1" style="padding-left:15px; ">
							<div id="x-content-top">
								<!-- __snippet__.contentTop -->
																<!-- // __snippet__.contentTop -->
							</div>
							<div id="x-content">
								    <h4>&#38745;&#24577;&#23383;&#27573;&#21644;&#38745;&#24577;&#26041;&#27861;</h4>
    <div class="x-wiki-info">
    	<span>Reads: 819311</span>
    	<a href="/manage/wiki/wikipage_update?id=1260464690677856" target="_blank" class="x-can-edit uk-text-danger">Edit</a>
</div>

    <hr>

    <div class="x-wiki-content x-main-content">
<p>&#22312;&#19968;&#20010;<code>class</code>&#20013;&#23450;&#20041;&#30340;&#23383;&#27573;&#65292;&#25105;&#20204;&#31216;&#20043;&#20026;&#23454;&#20363;&#23383;&#27573;&#12290;&#23454;&#20363;&#23383;&#27573;&#30340;&#29305;&#28857;&#26159;&#65292;&#27599;&#20010;&#23454;&#20363;&#37117;&#26377;&#29420;&#31435;&#30340;&#23383;&#27573;&#65292;&#21508;&#20010;&#23454;&#20363;&#30340;&#21516;&#21517;&#23383;&#27573;&#20114;&#19981;&#24433;&#21709;&#12290;</p>
<p>&#36824;&#26377;&#19968;&#31181;&#23383;&#27573;&#65292;&#26159;&#29992;<code>static</code>&#20462;&#39280;&#30340;&#23383;&#27573;&#65292;&#31216;&#20026;&#38745;&#24577;&#23383;&#27573;&#65306;<code>static field</code>&#12290;</p>
<p>&#23454;&#20363;&#23383;&#27573;&#22312;&#27599;&#20010;&#23454;&#20363;&#20013;&#37117;&#26377;&#33258;&#24049;&#30340;&#19968;&#20010;&#29420;&#31435;&#8220;&#31354;&#38388;&#8221;&#65292;&#20294;&#26159;&#38745;&#24577;&#23383;&#27573;&#21482;&#26377;&#19968;&#20010;&#20849;&#20139;&#8220;&#31354;&#38388;&#8221;&#65292;&#25152;&#26377;&#23454;&#20363;&#37117;&#20250;&#20849;&#20139;&#35813;&#23383;&#27573;&#12290;&#20030;&#20010;&#20363;&#23376;&#65306;</p>
<pre><code>class Person {
    public String name;
    public int age;
    // &#23450;&#20041;&#38745;&#24577;&#23383;&#27573;number:
    public static int number;
}
</code></pre>
<p>&#25105;&#20204;&#26469;&#30475;&#30475;&#19979;&#38754;&#30340;&#20195;&#30721;&#65306;</p>
<pre><code class="language-x-java">// static field
----
public class Main {
    public static void main(String[] args) {
        Person ming = new Person("Xiao Ming", 12);
        Person hong = new Person("Xiao Hong", 15);
        ming.number = 88;
        System.out.println(hong.number);
        hong.number = 99;
        System.out.println(ming.number);
    }
}

class Person {
    public String name;
    public int age;

    public static int number;

    public Person(String name, int age) {
        this.name = name;
        this.age = age;
    }
}
</code></pre>
<p>&#23545;&#20110;&#38745;&#24577;&#23383;&#27573;&#65292;&#26080;&#35770;&#20462;&#25913;&#21738;&#20010;&#23454;&#20363;&#30340;&#38745;&#24577;&#23383;&#27573;&#65292;&#25928;&#26524;&#37117;&#26159;&#19968;&#26679;&#30340;&#65306;&#25152;&#26377;&#23454;&#20363;&#30340;&#38745;&#24577;&#23383;&#27573;&#37117;&#34987;&#20462;&#25913;&#20102;&#65292;&#21407;&#22240;&#26159;&#38745;&#24577;&#23383;&#27573;&#24182;&#19981;&#23646;&#20110;&#23454;&#20363;&#65306;</p>
<pre><code class="language-ascii">        &#9484;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9488;
ming &#9472;&#9472;&gt;&#9474;Person instance   &#9474;
        &#9500;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9508;
        &#9474;name = "Xiao Ming"&#9474;
        &#9474;age = 12          &#9474;
        &#9474;number &#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9532;&#9472;&#9472;&#9488;    &#9484;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9488;
        &#9492;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9496;  &#9474;    &#9474;Person class &#9474;
                              &#9474;    &#9500;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9508;
                              &#9500;&#9472;&#9472;&#9472;&gt;&#9474;number = 99  &#9474;
        &#9484;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9488;  &#9474;    &#9492;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9496;
hong &#9472;&#9472;&gt;&#9474;Person instance   &#9474;  &#9474;
        &#9500;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9508;  &#9474;
        &#9474;name = "Xiao Hong"&#9474;  &#9474;
        &#9474;age = 15          &#9474;  &#9474;
        &#9474;number &#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9532;&#9472;&#9472;&#9496;
        &#9492;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9496;
</code></pre>
<p>&#34429;&#28982;&#23454;&#20363;&#21487;&#20197;&#35775;&#38382;&#38745;&#24577;&#23383;&#27573;&#65292;&#20294;&#26159;&#23427;&#20204;&#25351;&#21521;&#30340;&#20854;&#23454;&#37117;&#26159;<code>Person class</code>&#30340;&#38745;&#24577;&#23383;&#27573;&#12290;&#25152;&#20197;&#65292;&#25152;&#26377;&#23454;&#20363;&#20849;&#20139;&#19968;&#20010;&#38745;&#24577;&#23383;&#27573;&#12290;</p>
<p>&#22240;&#27492;&#65292;&#19981;&#25512;&#33616;&#29992;<code>&#23454;&#20363;&#21464;&#37327;.&#38745;&#24577;&#23383;&#27573;</code>&#21435;&#35775;&#38382;&#38745;&#24577;&#23383;&#27573;&#65292;&#22240;&#20026;&#22312;Java&#31243;&#24207;&#20013;&#65292;&#23454;&#20363;&#23545;&#35937;&#24182;&#27809;&#26377;&#38745;&#24577;&#23383;&#27573;&#12290;&#22312;&#20195;&#30721;&#20013;&#65292;&#23454;&#20363;&#23545;&#35937;&#33021;&#35775;&#38382;&#38745;&#24577;&#23383;&#27573;&#21482;&#26159;&#22240;&#20026;&#32534;&#35793;&#22120;&#21487;&#20197;&#26681;&#25454;&#23454;&#20363;&#31867;&#22411;&#33258;&#21160;&#36716;&#25442;&#20026;<code>&#31867;&#21517;.&#38745;&#24577;&#23383;&#27573;</code>&#26469;&#35775;&#38382;&#38745;&#24577;&#23545;&#35937;&#12290;</p>
<p>&#25512;&#33616;&#29992;&#31867;&#21517;&#26469;&#35775;&#38382;&#38745;&#24577;&#23383;&#27573;&#12290;&#21487;&#20197;&#25226;&#38745;&#24577;&#23383;&#27573;&#29702;&#35299;&#20026;&#25551;&#36848;<code>class</code>&#26412;&#36523;&#30340;&#23383;&#27573;&#65288;&#38750;&#23454;&#20363;&#23383;&#27573;&#65289;&#12290;&#23545;&#20110;&#19978;&#38754;&#30340;&#20195;&#30721;&#65292;&#26356;&#22909;&#30340;&#20889;&#27861;&#26159;&#65306;</p>
<pre><code>Person.number = 99;
System.out.println(Person.number);
</code></pre>
<h3>&#38745;&#24577;&#26041;&#27861;</h3>
<p>&#26377;&#38745;&#24577;&#23383;&#27573;&#65292;&#23601;&#26377;&#38745;&#24577;&#26041;&#27861;&#12290;&#29992;<code>static</code>&#20462;&#39280;&#30340;&#26041;&#27861;&#31216;&#20026;&#38745;&#24577;&#26041;&#27861;&#12290;</p>
<p>&#35843;&#29992;&#23454;&#20363;&#26041;&#27861;&#24517;&#39035;&#36890;&#36807;&#19968;&#20010;&#23454;&#20363;&#21464;&#37327;&#65292;&#32780;&#35843;&#29992;&#38745;&#24577;&#26041;&#27861;&#21017;&#19981;&#38656;&#35201;&#23454;&#20363;&#21464;&#37327;&#65292;&#36890;&#36807;&#31867;&#21517;&#23601;&#21487;&#20197;&#35843;&#29992;&#12290;&#38745;&#24577;&#26041;&#27861;&#31867;&#20284;&#20854;&#23427;&#32534;&#31243;&#35821;&#35328;&#30340;&#20989;&#25968;&#12290;&#20363;&#22914;&#65306;</p>
<pre><code class="language-x-java">// static method
----
public class Main {
    public static void main(String[] args) {
        Person.setNumber(99);
        System.out.println(Person.number);
    }
}

class Person {
    public static int number;

    public static void setNumber(int value) {
        number = value;
    }
}
</code></pre>
<p>&#22240;&#20026;&#38745;&#24577;&#26041;&#27861;&#23646;&#20110;<code>class</code>&#32780;&#19981;&#23646;&#20110;&#23454;&#20363;&#65292;&#22240;&#27492;&#65292;&#38745;&#24577;&#26041;&#27861;&#20869;&#37096;&#65292;&#26080;&#27861;&#35775;&#38382;<code>this</code>&#21464;&#37327;&#65292;&#20063;&#26080;&#27861;&#35775;&#38382;&#23454;&#20363;&#23383;&#27573;&#65292;&#23427;&#21482;&#33021;&#35775;&#38382;&#38745;&#24577;&#23383;&#27573;&#12290;</p>
<p>&#36890;&#36807;&#23454;&#20363;&#21464;&#37327;&#20063;&#21487;&#20197;&#35843;&#29992;&#38745;&#24577;&#26041;&#27861;&#65292;&#20294;&#36825;&#21482;&#26159;&#32534;&#35793;&#22120;&#33258;&#21160;&#24110;&#25105;&#20204;&#25226;&#23454;&#20363;&#25913;&#20889;&#25104;&#31867;&#21517;&#32780;&#24050;&#12290;</p>
<p>&#36890;&#24120;&#24773;&#20917;&#19979;&#65292;&#36890;&#36807;&#23454;&#20363;&#21464;&#37327;&#35775;&#38382;&#38745;&#24577;&#23383;&#27573;&#21644;&#38745;&#24577;&#26041;&#27861;&#65292;&#20250;&#24471;&#21040;&#19968;&#20010;&#32534;&#35793;&#35686;&#21578;&#12290;</p>
<p>&#38745;&#24577;&#26041;&#27861;&#32463;&#24120;&#29992;&#20110;&#24037;&#20855;&#31867;&#12290;&#20363;&#22914;&#65306;</p>
<ul>
<li>
<p>Arrays.sort()</p>
</li>
<li>
<p>Math.random()</p>
</li>
</ul>
<p>&#38745;&#24577;&#26041;&#27861;&#20063;&#32463;&#24120;&#29992;&#20110;&#36741;&#21161;&#26041;&#27861;&#12290;&#27880;&#24847;&#21040;Java&#31243;&#24207;&#30340;&#20837;&#21475;<code>main()</code>&#20063;&#26159;&#38745;&#24577;&#26041;&#27861;&#12290;</p>
<h3>&#25509;&#21475;&#30340;&#38745;&#24577;&#23383;&#27573;</h3>
<p>&#22240;&#20026;<code>interface</code>&#26159;&#19968;&#20010;&#32431;&#25277;&#35937;&#31867;&#65292;&#25152;&#20197;&#23427;&#19981;&#33021;&#23450;&#20041;&#23454;&#20363;&#23383;&#27573;&#12290;&#20294;&#26159;&#65292;<code>interface</code>&#26159;&#21487;&#20197;&#26377;&#38745;&#24577;&#23383;&#27573;&#30340;&#65292;&#24182;&#19988;&#38745;&#24577;&#23383;&#27573;&#24517;&#39035;&#20026;<code>final</code>&#31867;&#22411;&#65306;</p>
<pre><code>public interface Person {
    public static final int MALE = 1;
    public static final int FEMALE = 2;
}
</code></pre>
<p>&#23454;&#38469;&#19978;&#65292;&#22240;&#20026;<code>interface</code>&#30340;&#23383;&#27573;&#21482;&#33021;&#26159;<code>public static final</code>&#31867;&#22411;&#65292;&#25152;&#20197;&#25105;&#20204;&#21487;&#20197;&#25226;&#36825;&#20123;&#20462;&#39280;&#31526;&#37117;&#21435;&#25481;&#65292;&#19978;&#36848;&#20195;&#30721;&#21487;&#20197;&#31616;&#20889;&#20026;&#65306;</p>
<pre><code>public interface Person {
    // &#32534;&#35793;&#22120;&#20250;&#33258;&#21160;&#21152;&#19978;public statc final:
    int MALE = 1;
    int FEMALE = 2;
}
</code></pre>
<p>&#32534;&#35793;&#22120;&#20250;&#33258;&#21160;&#25226;&#35813;&#23383;&#27573;&#21464;&#20026;<code>public static final</code>&#31867;&#22411;&#12290;</p>
<h3>&#32451;&#20064;</h3>
<p>&#32473;Person&#31867;&#22686;&#21152;&#19968;&#20010;&#38745;&#24577;&#23383;&#27573;count&#21644;&#38745;&#24577;&#26041;&#27861;getCount&#65292;&#32479;&#35745;&#23454;&#20363;&#21019;&#24314;&#30340;&#20010;&#25968;&#12290;</p>
<p><a href="https://gitee.com/liaoxuefeng/learn-java/raw/master/practices/Java%E6%95%99%E7%A8%8B/20.%E9%9D%A2%E5%90%91%E5%AF%B9%E8%B1%A1%E7%BC%96%E7%A8%8B.1255943520012800/10.%E9%9D%A2%E5%90%91%E5%AF%B9%E8%B1%A1%E5%9F%BA%E7%A1%80.1260451488854880/80.%E9%9D%99%E6%80%81%E5%AD%97%E6%AE%B5%E5%92%8C%E6%96%B9%E6%B3%95.1260464690677856/oop-static.zip">&#38745;&#24577;&#23383;&#27573;&#21644;&#38745;&#24577;&#26041;&#27861;</a></p>
<h3>&#23567;&#32467;</h3>
<ul>
<li>
<p>&#38745;&#24577;&#23383;&#27573;&#23646;&#20110;&#25152;&#26377;&#23454;&#20363;&#8220;&#20849;&#20139;&#8221;&#30340;&#23383;&#27573;&#65292;&#23454;&#38469;&#19978;&#26159;&#23646;&#20110;<code>class</code>&#30340;&#23383;&#27573;&#65307;</p>
</li>
<li>
<p>&#35843;&#29992;&#38745;&#24577;&#26041;&#27861;&#19981;&#38656;&#35201;&#23454;&#20363;&#65292;&#26080;&#27861;&#35775;&#38382;<code>this</code>&#65292;&#20294;&#21487;&#20197;&#35775;&#38382;&#38745;&#24577;&#23383;&#27573;&#21644;&#20854;&#20182;&#38745;&#24577;&#26041;&#27861;&#65307;</p>
</li>
<li>
<p>&#38745;&#24577;&#26041;&#27861;&#24120;&#29992;&#20110;&#24037;&#20855;&#31867;&#21644;&#36741;&#21161;&#26041;&#27861;&#12290;</p>
</li>
</ul>
</div>

    <hr>

    <div class="x-wiki-prev-next uk-clearfix"></div>

    <div class="x-anchor x-comment-anchor"><a name="comments"></a></div>
							</div>
							<div id="x-content-bottom">
								<!-- __snippet__.contentBottom -->
								<div id="sponsor-a" class="uk-margin-bottom"></div>
								<!-- // __snippet__.contentBottom -->
							</div>
							<div id="x-content-comment">
								    <h3>Comments</h3>

    <ul id="x-comment-list" class="uk-comment-list">
    </ul>

    <h3>Make a comment</h3>

    <div class="x-display-if-not-signin">
        <p><button type="button" class="uk-button" onclick="showSignin()"><i class="uk-icon-signin"></i> Sign in to make a comment</button></p>
    </div>

    <div id="x-comment-area"></div>

							</div>
						</div>
											
