<div class="uk-flex-item-1" style="padding-left:15px; ">
							<div id="x-content-top">
								<!-- __snippet__.contentTop -->
																<!-- // __snippet__.contentTop -->
							</div>
							<div id="x-content">
								    <h4>&#20351;&#29992;&#27880;&#35299;</h4>
    <div class="x-wiki-info">
    	<span>Reads: 702252</span>
    	<a href="/manage/wiki/wikipage_update?id=1265102413966176" target="_blank" class="x-can-edit uk-text-danger">Edit</a>
</div>

    <hr>

    <div class="x-wiki-content x-main-content">
<p>&#20160;&#20040;&#26159;&#27880;&#35299;&#65288;Annotation&#65289;&#65311;&#27880;&#35299;&#26159;&#25918;&#22312;Java&#28304;&#30721;&#30340;&#31867;&#12289;&#26041;&#27861;&#12289;&#23383;&#27573;&#12289;&#21442;&#25968;&#21069;&#30340;&#19968;&#31181;&#29305;&#27530;&#8220;&#27880;&#37322;&#8221;&#65306;</p>
<pre><code>// this is a component:
@Resource("hello")
public class Hello {
    @Inject
    int n;

    @PostConstruct
    public void hello(@Param String name) {
        System.out.println(name);
    }

    @Override
    public String toString() {
        return "Hello";
    }
}
</code></pre>
<p>&#27880;&#37322;&#20250;&#34987;&#32534;&#35793;&#22120;&#30452;&#25509;&#24573;&#30053;&#65292;&#27880;&#35299;&#21017;&#21487;&#20197;&#34987;&#32534;&#35793;&#22120;&#25171;&#21253;&#36827;&#20837;class&#25991;&#20214;&#65292;&#22240;&#27492;&#65292;&#27880;&#35299;&#26159;&#19968;&#31181;&#29992;&#20316;&#26631;&#27880;&#30340;&#8220;&#20803;&#25968;&#25454;&#8221;&#12290;</p>
<h3>&#27880;&#35299;&#30340;&#20316;&#29992;</h3>
<p>&#20174;JVM&#30340;&#35282;&#24230;&#30475;&#65292;&#27880;&#35299;&#26412;&#36523;&#23545;&#20195;&#30721;&#36923;&#36753;&#27809;&#26377;&#20219;&#20309;&#24433;&#21709;&#65292;&#22914;&#20309;&#20351;&#29992;&#27880;&#35299;&#23436;&#20840;&#30001;&#24037;&#20855;&#20915;&#23450;&#12290;</p>
<p>Java&#30340;&#27880;&#35299;&#21487;&#20197;&#20998;&#20026;&#19977;&#31867;&#65306;</p>
<p>&#31532;&#19968;&#31867;&#26159;&#30001;&#32534;&#35793;&#22120;&#20351;&#29992;&#30340;&#27880;&#35299;&#65292;&#20363;&#22914;&#65306;</p>
<ul>
<li>
<code>@Override</code>&#65306;&#35753;&#32534;&#35793;&#22120;&#26816;&#26597;&#35813;&#26041;&#27861;&#26159;&#21542;&#27491;&#30830;&#22320;&#23454;&#29616;&#20102;&#35206;&#20889;&#65307;</li>
<li>
<code>@SuppressWarnings</code>&#65306;&#21578;&#35785;&#32534;&#35793;&#22120;&#24573;&#30053;&#27492;&#22788;&#20195;&#30721;&#20135;&#29983;&#30340;&#35686;&#21578;&#12290;</li>
</ul>
<p>&#36825;&#31867;&#27880;&#35299;&#19981;&#20250;&#34987;&#32534;&#35793;&#36827;&#20837;<code>.class</code>&#25991;&#20214;&#65292;&#23427;&#20204;&#22312;&#32534;&#35793;&#21518;&#23601;&#34987;&#32534;&#35793;&#22120;&#25172;&#25481;&#20102;&#12290;</p>
<p>&#31532;&#20108;&#31867;&#26159;&#30001;&#24037;&#20855;&#22788;&#29702;<code>.class</code>&#25991;&#20214;&#20351;&#29992;&#30340;&#27880;&#35299;&#65292;&#27604;&#22914;&#26377;&#20123;&#24037;&#20855;&#20250;&#22312;&#21152;&#36733;class&#30340;&#26102;&#20505;&#65292;&#23545;class&#20570;&#21160;&#24577;&#20462;&#25913;&#65292;&#23454;&#29616;&#19968;&#20123;&#29305;&#27530;&#30340;&#21151;&#33021;&#12290;&#36825;&#31867;&#27880;&#35299;&#20250;&#34987;&#32534;&#35793;&#36827;&#20837;<code>.class</code>&#25991;&#20214;&#65292;&#20294;&#21152;&#36733;&#32467;&#26463;&#21518;&#24182;&#19981;&#20250;&#23384;&#22312;&#20110;&#20869;&#23384;&#20013;&#12290;&#36825;&#31867;&#27880;&#35299;&#21482;&#34987;&#19968;&#20123;&#24213;&#23618;&#24211;&#20351;&#29992;&#65292;&#19968;&#33324;&#25105;&#20204;&#19981;&#24517;&#33258;&#24049;&#22788;&#29702;&#12290;</p>
<p>&#31532;&#19977;&#31867;&#26159;&#22312;&#31243;&#24207;&#36816;&#34892;&#26399;&#33021;&#22815;&#35835;&#21462;&#30340;&#27880;&#35299;&#65292;&#23427;&#20204;&#22312;&#21152;&#36733;&#21518;&#19968;&#30452;&#23384;&#22312;&#20110;JVM&#20013;&#65292;&#36825;&#20063;&#26159;&#26368;&#24120;&#29992;&#30340;&#27880;&#35299;&#12290;&#20363;&#22914;&#65292;&#19968;&#20010;&#37197;&#32622;&#20102;<code>@PostConstruct</code>&#30340;&#26041;&#27861;&#20250;&#22312;&#35843;&#29992;&#26500;&#36896;&#26041;&#27861;&#21518;&#33258;&#21160;&#34987;&#35843;&#29992;&#65288;&#36825;&#26159;Java&#20195;&#30721;&#35835;&#21462;&#35813;&#27880;&#35299;&#23454;&#29616;&#30340;&#21151;&#33021;&#65292;JVM&#24182;&#19981;&#20250;&#35782;&#21035;&#35813;&#27880;&#35299;&#65289;&#12290;</p>
<p>&#23450;&#20041;&#19968;&#20010;&#27880;&#35299;&#26102;&#65292;&#36824;&#21487;&#20197;&#23450;&#20041;&#37197;&#32622;&#21442;&#25968;&#12290;&#37197;&#32622;&#21442;&#25968;&#21487;&#20197;&#21253;&#25324;&#65306;</p>
<ul>
<li>&#25152;&#26377;&#22522;&#26412;&#31867;&#22411;&#65307;</li>
<li>String&#65307;</li>
<li>&#26522;&#20030;&#31867;&#22411;&#65307;</li>
<li>&#22522;&#26412;&#31867;&#22411;&#12289;String&#20197;&#21450;&#26522;&#20030;&#30340;&#25968;&#32452;&#12290;</li>
</ul>
<p>&#22240;&#20026;&#37197;&#32622;&#21442;&#25968;&#24517;&#39035;&#26159;&#24120;&#37327;&#65292;&#25152;&#20197;&#65292;&#19978;&#36848;&#38480;&#21046;&#20445;&#35777;&#20102;&#27880;&#35299;&#22312;&#23450;&#20041;&#26102;&#23601;&#24050;&#32463;&#30830;&#23450;&#20102;&#27599;&#20010;&#21442;&#25968;&#30340;&#20540;&#12290;</p>
<p>&#27880;&#35299;&#30340;&#37197;&#32622;&#21442;&#25968;&#21487;&#20197;&#26377;&#40664;&#35748;&#20540;&#65292;&#32570;&#23569;&#26576;&#20010;&#37197;&#32622;&#21442;&#25968;&#26102;&#23558;&#20351;&#29992;&#40664;&#35748;&#20540;&#12290;</p>
<p>&#27492;&#22806;&#65292;&#22823;&#37096;&#20998;&#27880;&#35299;&#20250;&#26377;&#19968;&#20010;&#21517;&#20026;<code>value</code>&#30340;&#37197;&#32622;&#21442;&#25968;&#65292;&#23545;&#27492;&#21442;&#25968;&#36171;&#20540;&#65292;&#21487;&#20197;&#21482;&#20889;&#24120;&#37327;&#65292;&#30456;&#24403;&#20110;&#30465;&#30053;&#20102;value&#21442;&#25968;&#12290;</p>
<p>&#22914;&#26524;&#21482;&#20889;&#27880;&#35299;&#65292;&#30456;&#24403;&#20110;&#20840;&#37096;&#20351;&#29992;&#40664;&#35748;&#20540;&#12290;</p>
<p>&#20030;&#20010;&#26647;&#23376;&#65292;&#23545;&#20197;&#19979;&#20195;&#30721;&#65306;</p>
<pre><code>public class Hello {
    @Check(min=0, max=100, value=55)
    public int n;

    @Check(value=99)
    public int p;

    @Check(99) // @Check(value=99)
    public int x;

    @Check
    public int y;
}
</code></pre>
<p><code>@Check</code>&#23601;&#26159;&#19968;&#20010;&#27880;&#35299;&#12290;&#31532;&#19968;&#20010;<code>@Check(min=0, max=100, value=55)</code>&#26126;&#30830;&#23450;&#20041;&#20102;&#19977;&#20010;&#21442;&#25968;&#65292;&#31532;&#20108;&#20010;<code>@Check(value=99)</code>&#21482;&#23450;&#20041;&#20102;&#19968;&#20010;<code>value</code>&#21442;&#25968;&#65292;&#23427;&#23454;&#38469;&#19978;&#21644;<code>@Check(99)</code>&#26159;&#23436;&#20840;&#19968;&#26679;&#30340;&#12290;&#26368;&#21518;&#19968;&#20010;<code>@Check</code>&#34920;&#31034;&#25152;&#26377;&#21442;&#25968;&#37117;&#20351;&#29992;&#40664;&#35748;&#20540;&#12290;</p>
<h3>&#23567;&#32467;</h3>
<p>&#27880;&#35299;&#65288;Annotation&#65289;&#26159;Java&#35821;&#35328;&#29992;&#20110;&#24037;&#20855;&#22788;&#29702;&#30340;&#26631;&#27880;&#65306;</p>
<p>&#27880;&#35299;&#21487;&#20197;&#37197;&#32622;&#21442;&#25968;&#65292;&#27809;&#26377;&#25351;&#23450;&#37197;&#32622;&#30340;&#21442;&#25968;&#20351;&#29992;&#40664;&#35748;&#20540;&#65307;</p>
<p>&#22914;&#26524;&#21442;&#25968;&#21517;&#31216;&#26159;<code>value</code>&#65292;&#19988;&#21482;&#26377;&#19968;&#20010;&#21442;&#25968;&#65292;&#37027;&#20040;&#21487;&#20197;&#30465;&#30053;&#21442;&#25968;&#21517;&#31216;&#12290;</p>
</div>

    <hr>

    <div class="x-wiki-prev-next uk-clearfix"></div>

    <div class="x-anchor x-comment-anchor"><a name="comments"></a></div>
							</div>
							<div id="x-content-bottom">
								<!-- __snippet__.contentBottom -->
								<div id="sponsor-a" class="uk-margin-bottom"></div>
								<!-- // __snippet__.contentBottom -->
							</div>
							<div id="x-content-comment">
								    <h3>Comments</h3>

    <ul id="x-comment-list" class="uk-comment-list">
    </ul>

    <h3>Make a comment</h3>

    <div class="x-display-if-not-signin">
        <p><button type="button" class="uk-button" onclick="showSignin()"><i class="uk-icon-signin"></i> Sign in to make a comment</button></p>
    </div>

    <div id="x-comment-area"></div>

							</div>
						</div>
											
